[
    {
        "title": "Rwandan High Commissioner invites Indian businessmen to invest in her country",
        "link": "https://www.thehindu.com/news/national/karnataka/rwandan-high-commissioner-invites-indian-businessmen-to-invest-in-her-country/article68622171.ece",
        "keywords": [
            "karnataka"
        ],
        "description": "Minister Satish Jarkiholi announces setting up of a sports school in the African country",
        "pubDate": "2024-09-09 14:22:58",
        "source_priority": 2972,
        "source_name": "The Hindu",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8922631144523621
    },
    {
        "title": "Total sowing area swells 23% to 109.23 million hectares. Bumper harvest on the cards?",
        "link": "https://www.livemint.com/industry/agriculture/sowing-area-paddy-sowing-area-pulses-sowing-area-millets-sowing-area-food-inflation-food-prices-indian-agriculture-11725887233901.html",
        "keywords": null,
        "description": "The increase in sowing area is a promising sign for the agriculture sector and the government's efforts to boost farm productivity, especially as the data shows a broad increase across various crops.",
        "pubDate": "2024-09-09 14:22:46",
        "source_priority": 7134,
        "source_name": "Mint",
        "category": [
            "business"
        ],
        "sentiment": "positive",
        "score": 0.9482467770576477
    },
    {
        "title": "Ola Electric Mobility rival Ather Energy files for Rs 3,100 crore IPO",
        "link": "https://www.business-standard.com/companies/news/ola-electric-mobility-rival-ather-energy-files-for-rs-3-100-crore-ipo-124090901124_1.html",
        "keywords": [
            "companies"
        ],
        "description": "Ather said it will use the funds raised from the proceeds of the IPO to establish an electric two-wheeler factory in India's Maharashtra state",
        "pubDate": "2024-09-09 14:22:32",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.854374349117279
    },
    {
        "title": "India News | DUSU Polls 2024-25: ABVP Releases List of 9 Probable Candidates, Begins Pre-election Campaigning",
        "link": "https://www.latestly.com/agency-news/india-news-dusu-polls-2024-25-abvp-releases-list-of-9-probable-candidates-begins-pre-election-campaigning-6253337.html",
        "keywords": null,
        "description": "Get latest articles and stories on India at LatestLY. The Akhil Bharatiya Vidyarthi Parishad on Monday released a list of nine probable candidates for the upcoming Delhi University Students Union (DUSU) elections slated for September 27.",
        "pubDate": "2024-09-09 14:22:16",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.9125646352767944
    },
    {
        "title": "Adani Green Energy Fully Redeems $750 Million Holdco Notes",
        "link": "https://news.abplive.com/business/adani-green-energy-fully-redeems-750-million-holdco-notes-1716144",
        "keywords": [
            "business"
        ],
        "description": "Adani Green Energy Ltd (AGEL) completes redemption of all outstanding $750 million 4.375 per cent Holdco Notes due on 8 September 2024. This follows AGEL's announcement, in January 2024, to fully backstop the Holdco Notes through a fully funded redemption reserve account maintained eight months prior to the redemption date to facilitate full redemption of Holdco Notes upon maturity in compliance with applicable guidelines.Issued in September 2021, the three-year Holdco Notes have supported AGEL’s high-growth objectives. During the period, AGEL’s capacity has increased more than threefold — from 3.5 GW to 11.2 GW, registering a CAGR (compounded annual growth rate) of 48 per cent.AGEL's overall capital management philosophy has remained focused on long-term value creation through asset development and positioned AGEL as a self-propelled growth engine. It also emphasises the structured approach to accomplish credit metrics akin to investment grade profile for its underlying debt capital raise programme.With this, AGEL is committed to having capital market issuances tailored for long-term infra asset class supported through the predictable and robust cashflow stream to attain long curve emulating underlying asset life. Over the years, the Capital Management Plan has matured to allow AGEL to have a 'seasoned' portfolio with a superior operational asset base supporting the under-construction development. With surplus cash from operating assets augmenting the under-construction projects’ requirement, AGEL’s overall capex program remains fully funded with such operational assets cashflows and the available construction facility pool. In addition, AGEL’s promoters had agreed, in December 2023, to subscribe to a preferential warrant amounting to Rs 9,350 crore, out of which, Rs 7,013 crore ($835 million equivalent) shall be available with AGEL to fund any accelerated capital expenditure requirements.AGEL thanks its investors and lenders for their confidence and its vendor partners, including Adani Infra (India) Ltd and Adani Infra Management Services Ltd, for their continuous support in achieving the accelerated growth plan, putting AGEL on track to achieve 50 GW of renewable energy capacity by 2030.",
        "pubDate": "2024-09-09 14:21:58",
        "source_priority": 10959,
        "source_name": "Abp News",
        "category": [
            "business"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Senior Maoist cadre fleeing outfit in a bid to surrender, found killed in Bastar",
        "link": "https://timesofindia.indiatimes.com/city/raipur/senior-maoist-cadre-fleeing-outfit-in-a-bid-to-surrender-found-killed-in-bastar/articleshow/113199711.cms",
        "keywords": null,
        "description": "A senior Maoist cadre attempting to surrender with an INSAS rifle was murdered by his colleagues near the Narayanpur-Kanker border. A nearby leaflet accused him of betrayal. This event highlights severe internal strife within the Maoist ranks, causing increased suspicion and mistrust among members, reflecting growing dissatisfaction and conflict in the organization.",
        "pubDate": "2024-09-09 14:21:58",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "score": 0.8337279558181763
    },
    {
        "title": "US top cops unveil groundbreaking UAP guide: The chilling truth behind UFO encounters & safety protocols",
        "link": "https://newsable.asianetnews.com/world/us-top-cops-unveil-groundbreaking-uap-guide-the-chilling-truth-behind-ufo-encounters-safety-protocols-shk-sjjuk0",
        "keywords": null,
        "description": "In an unprecedented move that melds the realms of law enforcement and extraterrestrial enigma, police chiefs from America’s largest metropolises have unveiled a guide addressing Unidentified Aerial Phenomena (UAPs). This 11-page compendium, which emerged in June, serves as both a chilling chronicle and a practical manual for officers grappling with the specter of UFO encounters. According to DailyMail, the guide, meticulously crafted by the Major Cities Chiefs Association (MCCA), cautions that unidentified flying objects “pose significant safety risks to law enforcement air support units,” advocating for heightened vigilance among helicopter crews. The document delves into nerve-wracking real-life incidents, underscoring the urgency for police departments to stay attuned to the unknown threats these aerial anomalies might represent. Among the harrowing narratives included, one from November 2023 stands out: a Blairsville, Georgia officer reported witnessing a “triangle craft with 3 dim green lights per side” navigating the night sky. “I am a police officer and deputy sheriff. While on duty after dark, near the top of my windshield (frame of view) I witnessed movement in the sky (southbound direction of view),” the officer recounted. Despite his familiarity with conventional aerial traffic, he described the sighting as “unlike anything I had ever witnessed.” The guide’s pages are also punctuated with accounts from other officers who have encountered UFOs while on patrol. In Harper Woods, Michigan, for instance, two officers observed three enigmatic objects in the sky that, as they described, “blinked out” of existence. Their account reads: “At approximately 6:00am, myself and a fellow officer were standing in a parking lot of a church talking before the end of our shift... The objects appeared to drift towards the east, maintaining the equal distance. As we watched the objects, they appeared to ‘blink out’ of our vision.” The guide does not shy away from including high-profile testimonies and historical context. It features insights from notable figures such as former United States Air Force officer and intelligence official David Grusch, who in a 2023 congressional hearing, claimed knowledge of aircraft with “nonhuman” origins. Further enriching the guide are civilian reports documenting sightings of police helicopters seemingly pursuing UFOs. An Austin, Texas resident noted, “When I walked out front door, saw Triangle Craft—with white lights illuminated on each corner—being closely followed by police helicopter.” Similarly, a Winnipeg, Canada resident described witnessing a police chopper being overtaken by unidentified craft while relaxing in his hot tub. Nigel Watson, author of Captured by Aliens? A History and Analysis of American Abduction Claims, remarked on the guide's utility for law enforcement. He noted, “The short history of the study of UAPs and the links to organizations where sightings can be reported is very helpful.” However, Watson also critiqued the guide for its reliance on testimonies from former government officials without substantial evidence, and for neglecting skeptical perspectives that could provide a more balanced view.",
        "pubDate": "2024-09-09 14:21:36",
        "source_priority": 7749,
        "source_name": "Asianet Newsable",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Abu Dhabi crown prince plants amaltas sapling at Rajghat, creates unique legacy in India-UAE ties",
        "link": "https://theprint.in/diplomacy/abu-dhabi-crown-prince-plants-amaltas-sapling-at-rajghat-creates-unique-legacy-in-india-uae-ties/2259785/",
        "keywords": [
            "crown prince",
            "india-uae ties",
            "rajghat",
            "diplomacy",
            "abu dhabi"
        ],
        "description": "This comes 12 yrs after crown prince’s father, current president of UAE, planted a molshri sapling at the memorial dedicated to Mahatma Gandhi, following in his own father's footsteps.",
        "pubDate": "2024-09-09 14:21:23",
        "source_priority": 14094,
        "source_name": "Theprint",
        "category": [
            "world"
        ],
        "sentiment": "neutral",
        "score": 0.8247113823890686
    },
    {
        "title": "31,382 students to receive degrees at 59th convocation of Bangalore University",
        "link": "https://www.thehindu.com/news/national/karnataka/31382-students-to-receive-degrees-at-59th-convocation-of-bangalore-university/article68621971.ece",
        "keywords": [
            "karnataka"
        ],
        "description": null,
        "pubDate": "2024-09-09 14:21:10",
        "source_priority": 2972,
        "source_name": "The Hindu",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Abu Dhabi Crown Prince meets President Droupadi Murmu at Rashtrapati Bhavan",
        "link": "https://economictimes.indiatimes.com/news/et-tv/abu-dhabi-crown-prince-meets-president-droupadi-murmu-at-rashtrapati-bhavan/videoshow/113199697.cms",
        "keywords": null,
        "description": "Abu Dhabi Crown Prince meets President Droupadi Murmu at Rashtrapati Bhavan",
        "pubDate": "2024-09-09 14:21:03",
        "source_priority": 231,
        "source_name": "The Economic Times",
        "category": [
            "business"
        ],
        "sentiment": "neutral",
        "score": 0.9359924793243408
    },
    {
        "title": "'Lower your pitch...': CJI Chandrachud schools lawyer for ‘demeaning’ behaviour | RG Kar case hearing",
        "link": "https://economictimes.indiatimes.com/news/et-tv/lower-your-pitch-cji-chandrachud-schools-lawyer-for-demeaning-behaviour-rg-kar-case-hearing/videoshow/113199692.cms",
        "keywords": null,
        "description": "'Lower your pitch...': CJI Chandrachud schools lawyer for ‘demeaning’ behaviour | RG Kar case hearing",
        "pubDate": "2024-09-09 14:20:47",
        "source_priority": 231,
        "source_name": "The Economic Times",
        "category": [
            "business"
        ],
        "sentiment": "neutral",
        "score": 0.5494679808616638
    },
    {
        "title": "Khawaja believes India's success in Australia has made rivalry intense",
        "link": "https://www.business-standard.com/cricket/news/khawaja-believes-india-s-success-in-australia-has-made-rivalry-intense-124090900506_1.html",
        "keywords": null,
        "description": "India beating Australia in the last two Test series in the latter's backyard has made the rivalry between the two teams more intense, feels senior batter Usman Khawaja ahead of the five-match battle beginning November 22.India had beaten Australia on their last two tours of Australia (2018-19 and 2020-21) with an identical 2-1 margin.In fact, India have won all the last four series of the Border-Gavaskar Trophy, taking into account their home wins in 2016-17 and 2022-23 -- both also 2-1 results in a four-match contest.\"For Indians it's always been the case to beat Australia. And more recently, you know, since the rise of India and IPL and everything else that happened, it's the same way with Australia against India,\" Khawaja said.\"And particularly since India's beaten Australia in Australia the last two times they've come out of the Border-Gavaskar Trophy. It just means a little bit more, he told Star Sports.The 37-year-old left-handed opener said that the rivalry between th",
        "pubDate": "2024-09-09 14:20:41",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "sports"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Latest News | Govt to Announce New Cooperative Policy Next 2-3 Months: Coop Secretary",
        "link": "https://www.latestly.com/agency-news/latest-news-govt-to-announce-new-cooperative-policy-next-2-3-months-coop-secretary-6253335.html",
        "keywords": null,
        "description": "Get latest articles and stories on Latest News at LatestLY. The new National Cooperative Policy is almost ready and will be announced in the next 2-3 months, a top cooperation ministry official said on Monday.",
        "pubDate": "2024-09-09 14:20:35",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.6334589123725891
    },
    {
        "title": "Asifabad: 17 held for communal clashes in Jainoor",
        "link": "https://telanganatoday.com/asifabad-17-held-for-communal-clashes-in-jainoor",
        "keywords": [
            "jainoor",
            "kumram bheem asifabad",
            "telangana",
            "asifabad"
        ],
        "description": "Sources said that around 20 cases were booked against the protesters who torched commercial establishments during the protest.",
        "pubDate": "2024-09-09 14:20:33",
        "source_priority": 63887,
        "source_name": "Telangana Today",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "score": 0.6470387578010559
    },
    {
        "title": "Salem Collector distributes ₹124.13 crore to women SHGs",
        "link": "https://www.thehindu.com/news/cities/Coimbatore/salem-collector-distributes-12413-crore-to-women-shgs/article68621611.ece",
        "keywords": [
            "coimbatore"
        ],
        "description": null,
        "pubDate": "2024-09-09 14:20:29",
        "source_priority": 2972,
        "source_name": "The Hindu",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Latest News | BoB Raises Rs 5,000 Cr from Infra Bond Issue",
        "link": "https://www.latestly.com/agency-news/latest-news-bob-raises-rs-5000-cr-from-infra-bond-issue-6253334.html",
        "keywords": null,
        "description": "Get latest articles and stories on Latest News at LatestLY. State-owned Bank of Baroda on Monday announced that it has raised Rs 5,000 crore through a 10-year infrastructure bond issuance subscribed by domestic investors.",
        "pubDate": "2024-09-09 14:20:27",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.7011736035346985
    },
    {
        "title": "Magaly Medina EXPLODES with Rodrigo González for Andrés Hurtado: “A little sheep says that I must respond” | Entertainment",
        "link": "https://thenewsglory.com/magaly-medina-explodes-with-rodrigo-gonzalez-for-andres-hurtado-a-little-sheep-says-that-i-must-respond-entertainment/",
        "keywords": [
            "world"
        ],
        "description": "Magaly Medina, one of the most prominent figures of Peruvian television, was once again the center of attention after her harsh words against Rodrigo Gonzalezpopularly known as ‘Peluchín’. The controversy arose after the host of ‘Amor y fuego’ suggested that he address the controversial case of Andres HurtadoHowever, Medina made it clear that he will [...]The post Magaly Medina EXPLODES with Rodrigo González for Andrés Hurtado: “A little sheep says that I must respond” | Entertainment appeared first on The News Glory.",
        "pubDate": "2024-09-09 14:20:25",
        "source_priority": 321007,
        "source_name": "Tng News",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "India News | Annual Census of Monsoon Birds Begins in Odisha's Bhitarkanika National Park",
        "link": "https://www.latestly.com/agency-news/india-news-annual-census-of-monsoon-birds-begins-in-odishas-bhitarkanika-national-park-6253333.html",
        "keywords": null,
        "description": "Get latest articles and stories on India at LatestLY. The Bhitarkanika National Park authorities, on Monday, began the annual census of monsoon birds, which throng the wetland sites for nesting in large numbers every year.",
        "pubDate": "2024-09-09 14:20:16",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8623533844947815
    },
    {
        "title": "Late strike from Ronaldo help Portugal beat Scotland 2-1 in Nations League",
        "link": "https://www.business-standard.com/sports/football-news/late-strike-from-ronaldo-help-portugal-beat-scotland-2-1-in-nations-league-124090900102_1.html",
        "keywords": null,
        "description": "Cristiano Ronaldo is showing just why Portugal is persisting with him at the age of 39.Make that a record-extending 132 international goals for the five-time world player of the year after Ronaldo came on as a halftime substitute and slotted home an 88th-minute winner for Portugal in its 2-1 victory over Scotland in the Nations League on Sunday.Minutes earlier, Ronaldo had struck both posts within a matter of seconds. Indeed, he was an ever-present danger in Lisbon, demonstrating he is far from finished as a force in international soccer especially against the likes of a struggling Scotland.Ronaldo failed to score at all in five games at the recent European Championship, but Portugal coach Robert Martinez has kept faith with the country's greatest ever player and is reaping the rewards.On Thursday, Ronaldo scored his 900th career goal spanning games for club and country in a 2-1 win over Croatia.The quest for 1,000 began three days later and he didn't disappoint, despite o",
        "pubDate": "2024-09-09 14:20:12",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "sports"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Shocker! Bhopal Doctor, Along With Staff, Thrashes Neighbour & His Family With Shovel Publicly; VIDEO",
        "link": "https://www.freepressjournal.in/bhopal/shocker-bhopal-doctor-along-with-staff-thrashes-neighbour-his-family-with-shovel-publicly-video",
        "keywords": [
            "topnews",
            "bhopal news"
        ],
        "description": null,
        "pubDate": "2024-09-09 14:20:08",
        "source_priority": 83130,
        "source_name": "The Free Press Journal",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Job Alert - 09/09/2024",
        "link": "https://www.sentinelassam.com/ampstories/web-stories/job-alert-09092024",
        "keywords": null,
        "description": null,
        "pubDate": "2024-09-09 14:20:00",
        "source_priority": 177615,
        "source_name": "The Sentinel",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Haryana TET 2024 exam dates released: Check details here",
        "link": "https://timesofindia.indiatimes.com/education/news/haryana-tet-2024-exam-dates-released-check-details-here/articleshow/113199649.cms",
        "keywords": null,
        "description": "The Haryana Board of School Education (HBSE) will hold the HTET 2024 on December 7 and 8. HTET Level 3 is scheduled for December 7, while Levels 1 and 2 will be on December 8. Registration details will be available soon on bseh.org.in. Check important details here.",
        "pubDate": "2024-09-09 14:19:31",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "education"
        ],
        "sentiment": "neutral",
        "score": 0.9225139021873474
    },
    {
        "title": "Dr Shiva Rajkumar launches ‘Subrahmanyaa’ first look",
        "link": "https://www.thehansindia.com/cinema/dr-shiva-rajkumar-launches-subrahmanyaa-first-look-905523",
        "keywords": [
            "entertainment"
        ],
        "description": "Popular actor and dubbing artiste P Ravishankar is introducing his son Advay as a hero with his latest directorial venture ‘Subrahmanyaa’.",
        "pubDate": "2024-09-09 14:19:21",
        "source_priority": 58957,
        "source_name": "The Hans India",
        "category": [
            "entertainment"
        ],
        "sentiment": "positive",
        "score": 0.7142777442932129
    },
    {
        "title": "World Bank experts meet Kerala CM Vijayan, praise state's education reforms",
        "link": "https://www.business-standard.com/india-news/world-bank-experts-meet-kerala-cm-vijayan-praise-state-s-education-reforms-124090900928_1.html",
        "keywords": null,
        "description": "In a significant boost to Kerala's efforts to revamp its higher education system, a team of World Bank experts on Monday met with Chief Minister Pinarayi Vijayan, praising the state's reforms and expressing interest in a collaborative initiative to draw international students to the state.The World Bank experts, including Nina Arnhold (Global Lead for Tertiary Education), Denis Nikolaev (Senior Education Specialist), and Ambarish Ambuj (Consultant, Education, South Asia Region), met the CM at his office here to discuss a potential partnership, according to an official release.The project seeks to attract foreign students to Kerala and improve the overall higher education system, with a focus on sustainability and social justice.\"The World Bank representatives were impressed by the reforms taking place in the higher education sector. They expressed interest in collaborating with the state Higher Education Council to attract foreign students to Kerala as part of a related project,\"",
        "pubDate": "2024-09-09 14:19:19",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Case booked against suspended ACP Bhujanga Rao",
        "link": "https://telanganatoday.com/case-booked-against-suspended-acp-bhujanga-rao",
        "keywords": [
            "acp bhujanga rao",
            "cyberabad",
            "acp",
            "cheating case",
            "forgery",
            "hyderabad",
            "news",
            "economic offences wing",
            "eow"
        ],
        "description": "The Cyberabad Economic Offences Wing (EOW) booked a case against Bhujanaga Rao following accusations of his involvement in aiding several individuals in the fabrication of documents related to a 340-acre property in Kukatpally.",
        "pubDate": "2024-09-09 14:19:17",
        "source_priority": 63887,
        "source_name": "Telangana Today",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.6455788016319275
    },
    {
        "title": "I'm happy I got laid off from Deloitte. The physical and mental toll wasn't worth the paycheck.",
        "link": "https://www.businessinsider.in/careers/news/im-happy-i-got-laid-off-from-deloitte-the-physical-and-mental-toll-wasnt-worth-the-paycheck-/articleshow/113201887.cms",
        "keywords": [
            "careers"
        ],
        "description": "Cierra Desmaratti worked at Deloitte as an actuarial analyst for a year before getting laid off.Desmaratti struggled with Deloitte's hustle culture and felt like she didn't fit in with her peers.This as-told-to conversation is based on a conversation with Cierra Desmaratti, a 25-year-old actuarial analyst from Miami. It's been edited for length and clarity.When I received a call from a Deloitte representative saying I'd landed a post-grad job as an actuarial analyst, I was ecstatic. It wasn't just the job; it was the safety that would come with it.I was raised in a low-income family in Naperville, Illinois, and financially supported myself throughout my time at North Central College. Getting this job meant I could finally take a breath and be normal.But I felt anything but normal at Deloitte.",
        "pubDate": "2024-09-09 14:19:17",
        "source_priority": 6525,
        "source_name": "Business Insider India",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "First Case Of Monkeypox Confirmed In India: Ministry Of Health",
        "link": "https://www.india.com/news/india/first-case-of-monkeypox-confirmed-in-india-ministry-of-health-7232241/",
        "keywords": [
            "monkeypox case in india",
            "india",
            "mpox"
        ],
        "description": "The Ministry said that the patient remains clinically stable.",
        "pubDate": "2024-09-09 14:19:11",
        "source_priority": 8067,
        "source_name": "India",
        "category": [
            "other"
        ],
        "sentiment": "neutral",
        "score": 0.8309392929077148
    },
    {
        "title": "The Hema Committee Report will make the Malayalam film industry safer: Revathi",
        "link": "https://frontline.thehindu.com/interviews/hema-committee-report-revathi-interview-wcc-malayalam-cinema-sexual-harrassment/article68621742.ece",
        "keywords": [
            "interviews"
        ],
        "description": "The actor speaks about the WCC, the revelations made in the report, its fallouts, and potential solutions to ensure safety of women in cinema.",
        "pubDate": "2024-09-09 14:19:08",
        "source_priority": 1539,
        "source_name": "Frontline Thehindu",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8468444347381592
    },
    {
        "title": "5.6L MGNREGS workers to get Onam bonus",
        "link": "https://timesofindia.indiatimes.com/city/thiruvananthapuram/onam-bonus-for-mgnregs-and-coir-workers-in-kerala/articleshow/113199653.cms",
        "keywords": null,
        "description": null,
        "pubDate": "2024-09-09 14:18:58",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "entertainment"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Contract staff nurses at KGH in Visakhapatnam stage protest demanding repeal of G.O. no. 115",
        "link": "https://www.thehindu.com/news/cities/Visakhapatnam/contract-staff-nurses-at-kgh-in-visakhapatnam-stage-protest-demanding-repeal-of-go-no-115/article68622410.ece",
        "keywords": [
            "visakhapatnam"
        ],
        "description": "The protestors demand that the contract staff nurses be given the position of Staff Nurses and fill in the vacancies for which the G.O. was issued",
        "pubDate": "2024-09-09 14:18:53",
        "source_priority": 2972,
        "source_name": "The Hindu",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8850722908973694
    },
    {
        "title": "Sanju Samson Becomes Co-Owner Of Super League Kerala Franchise Malappuram FC",
        "link": "https://www.latestly.com/socially/sports/football/sanju-samson-becomes-co-owner-of-super-league-kerala-franchise-malappuram-fc-6253288.html",
        "keywords": null,
        "description": "Sanju Samson has always been a fan of football and the star Indian cricketer's passion for the game could be spotted on several occasions when he played football in Kerala.",
        "pubDate": "2024-09-09 14:18:41",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "sports"
        ],
        "sentiment": "positive",
        "score": 0.8940183520317078
    },
    {
        "title": "Tamannaah Reveals She Has Had Two Heartbreaks: \"I Could See That The Person Was Not Good For Me\"",
        "link": "https://www.ndtv.com/entertainment/tamannaah-reveals-she-has-had-two-heartbreaks-i-could-see-that-the-person-was-not-good-for-me-6526843",
        "keywords": null,
        "description": "Tamannaah confirmed her relationship with Lust Stories 2 co-actor Vijay Varma last year in June.",
        "pubDate": "2024-09-09 14:18:41",
        "source_priority": 1204,
        "source_name": "Ndtv",
        "category": [
            "entertainment"
        ],
        "sentiment": "neutral",
        "score": 0.892470121383667
    },
    {
        "title": "Kamal Haasan's House Of Khaddar Supports Sustainable Fashion With 'Sutura' Collection At New York Fashion Week 2024",
        "link": "https://www.freepressjournal.in/lifestyle/kamal-haasans-house-of-khaddar-supports-sustainable-fashion-with-sutura-collection-at-new-york-fashion-week-2024",
        "keywords": [
            "fpj shorts",
            "lifestyle",
            "topnews",
            "featured news"
        ],
        "description": null,
        "pubDate": "2024-09-09 14:18:38",
        "source_priority": 83130,
        "source_name": "The Free Press Journal",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Janhvi Kapoor loses her cool as paparazzi pushes each other during Devara promotions: ‘Aaram se’",
        "link": "https://www.hindustantimes.com/entertainment/bollywood/janhvi-kapoor-loses-her-cool-as-paparazzi-pushes-each-other-during-devara-promotions-aaram-se-101725889957190.html",
        "keywords": [
            "latest"
        ],
        "description": "Janhvi Kapoor was surrounded by paparazzi as she stepped out to promote her upcoming film Devara: Part 1. Check out what happened next.",
        "pubDate": "2024-09-09 14:18:37",
        "source_priority": 933,
        "source_name": "Hindustan Times",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8397477269172668
    },
    {
        "title": "'Behavioral disorder': Why a golden eagle went on assault spree in Norway",
        "link": "https://timesofindia.indiatimes.com/world/europe/behavioral-disorder-why-a-golden-eagle-went-on-assault-spree-in-norway/articleshow/113199588.cms",
        "keywords": null,
        "description": "A golden eagle in Norway has attacked four individuals, including a toddler, due to what experts suspect is a behavioral disorder. The bird was killed following its attack on the child. Victims needed stitches and medication for deep gouges. Experts attribute favorable weather conditions to the eagle's ability to cover long distances.",
        "pubDate": "2024-09-09 14:18:35",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "score": 0.6983017325401306
    },
    {
        "title": "Former Congress minister, three others booked for abetment to suicide of a teacher in Chhattisgarh",
        "link": "https://timesofindia.indiatimes.com/city/raipur/former-congress-minister-three-others-booked-for-abetment-to-suicide-of-a-teacher-in-chhattisgarh/articleshow/113199646.cms",
        "keywords": null,
        "description": "Senior Congress leader Mohammad Akbar and three others face charges for allegedly abetting the suicide of a government school teacher in Balod district. The deceased's suicide note accuses them of taking money for unfulfilled job promises. Another case involving job fraud in the forest department is also under investigation. No arrests have been made yet.",
        "pubDate": "2024-09-09 14:18:29",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "score": 0.7918757200241089
    },
    {
        "title": "India News | GST Council Sets Up GoM on Reduction in GST on Health Insurance; Cuts Rate on Cancer Drugs",
        "link": "https://www.latestly.com/agency-news/india-news-gst-council-sets-up-gom-on-reduction-in-gst-on-health-insurance-cuts-rate-on-cancer-drugs-6253329.html",
        "keywords": null,
        "description": "Get latest articles and stories on India at LatestLY. GST Council headed by Union Finance Minister Nirmala Sitharaman on Monday decided to set up a Group of Ministers (GoM) on reducing tax rate on life and health insurance and cut GST on cancer drugs and namkeens.",
        "pubDate": "2024-09-09 14:18:26",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8766239881515503
    },
    {
        "title": "Buchi Babu final: Rohit Rayudu, Tanay Thyagarajan star as Hyderabad takes charge on day two",
        "link": "https://sportstar.thehindu.com/cricket/domestic/hyderabad-vs-chhattisgarh-buchi-babu-final-result-day-two-scores-rohit-rayadu-tanay-thyagarajan-news-updates/article68622596.ece",
        "keywords": [
            "domestic"
        ],
        "description": "Hyderabad posted a total of 417 in the first innings before running through the Chhattisgarh top-order and reduced them to 145 for eight at stumps.",
        "pubDate": "2024-09-09 14:18:25",
        "source_priority": 2972,
        "source_name": "Sport Star The Hindu",
        "category": [
            "sports"
        ],
        "sentiment": "neutral",
        "score": 0.9393892884254456
    },
    {
        "title": "Eknath Shinde-Led Shiv Sena Aims To Contest 107 Seats In Maharashtra, Sends Proposal To BJP | Exclusive",
        "link": "https://www.news18.com/elections/eknath-shinde-led-shiv-sena-submits-proposal-for-107-seats-in-upcoming-maharashtra-elections-9044947.html",
        "keywords": [
            "elections"
        ],
        "description": "This will mark Shinde’s first state assembly election after he won the battle for the Shiv Sena party name and symbol.",
        "pubDate": "2024-09-09 14:18:18",
        "source_priority": 6644,
        "source_name": "News 18",
        "category": [
            "politics"
        ],
        "sentiment": "neutral",
        "score": 0.8228036761283875
    },
    {
        "title": "Chia seeds to flax seeds: 7 Omega 3 rich foods for vegetarians",
        "link": "https://newsable.asianetnews.com/webstories/lifestyle/chia-seeds-to-flax-seeds-7-omega-3-rich-foods-for-vegetarians-atg-sjjuef",
        "keywords": null,
        "description": "Omega-3 fatty acids are essential for brain and heart health. This article lists some of the best plant-based sources of omega-3s for vegetarians Fish is considered the best source of omega 3 fatty acids. But let's get to know the foods that vegetarians should eat to get omega acids Chia seeds contain omega 3 fatty acids, fiber, calcium, iron, protein, antioxidants, etc Flax seeds are an excellent source of omega 3 fatty acids. They are also rich in fiber and magnesium Walnuts are a type of nut that is rich in omega 3 fatty acids. Therefore, they can also be included in the diet It is also good to eat leafy greens like spinach which contain omega 3 fatty acids You can also eat these which contain omega 3 fatty acids Avocado also contains omega 3 fatty acids Make changes to your diet only after seeking the advice of a health expert or nutritionist",
        "pubDate": "2024-09-09 14:18:16",
        "source_priority": 7749,
        "source_name": "Asianet Newsable",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Red-hot Musheer Khan set to travel to Australia for India 'A' tour",
        "link": "https://timesofindia.indiatimes.com/sports/cricket/news/red-hot-musheer-khan-set-to-travel-to-australia-for-india-a-tour/articleshow/113199253.cms",
        "keywords": null,
        "description": "Rising cricketer Musheer Khan, 19, is set to join India A's shadow tour to Australia after an impressive first-class season. His performances in the Ranji Trophy and for India B have drawn a considerable attention. The squad will be selected based on Duleep Trophy and Irani Cup performances, which will take place before the team's departure for Australia.",
        "pubDate": "2024-09-09 14:18:09",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "score": 0.7426542639732361
    },
    {
        "title": "Latest News | Tata Power Commences Production of Solar Cells at Tirunelveli Plant",
        "link": "https://www.latestly.com/agency-news/latest-news-tata-power-commences-production-of-solar-cells-at-tirunelveli-plant-6253326.html",
        "keywords": null,
        "description": "Get latest articles and stories on Latest News at LatestLY. Tata Power has commenced production of solar cells at India's largest single-location in Tirunelveli, Tamil Nadu, helping boost domestic manufacturing of cells and modules needed to convert sunlight into electricity.",
        "pubDate": "2024-09-09 14:18:09",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.6668084263801575
    },
    {
        "title": "Shoaib Bashir Takes Impressive Diving Catch to Dismiss Kusal Mendis During ENG vs SL 3rd Test 2024 (Watch Video)",
        "link": "https://www.latestly.com/socially/sports/cricket/shoaib-bashir-takes-impressive-diving-catch-to-dismiss-kusal-mendis-during-eng-vs-sl-3rd-test-2024-watch-video-6252609.html",
        "keywords": null,
        "description": "The tall fielder dived to his left and ensured he took a clean catch which helped England end Kamindu Mendis' 39-run knock. England, with a 2-0 lead in the series, will be keen on clinching a whitewash but Sri Lanka are favourites to win the third Test, having started well in their 219-run chase.",
        "pubDate": "2024-09-09 14:18:06",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.5854905843734741
    },
    {
        "title": "ENG Vs SL, 3rd Test: Pathum Nissanka Guides Sri Lanka To Fourth Win In England - In Pics",
        "link": "https://www.outlookindia.com/sports/eng-vs-sl-3rd-test-day-4-centurion-pathum-nissanka-guides-sri-lanka-to-fourth-win-in-england-in-pics",
        "keywords": [
            " 3rd test",
            " eng vs sl test match",
            " britain england sri lanka cricket",
            " sl vs eng test match",
            " eng vs sl",
            " joe root",
            " sri lanka vs england test match",
            " sri lanka tour of england",
            " england vs sri lanka test match",
            "pathum nissanka"
        ],
        "description": null,
        "pubDate": "2024-09-09 14:18:00",
        "source_priority": 1033,
        "source_name": "Outlook",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Top Ex US Military Officials Back Harris, Call Trump \"Danger To Democracy\"",
        "link": "https://www.ndtv.com/world-news/top-ex-us-military-officials-back-kamala-harris-call-trump-danger-to-democracy-6526833",
        "keywords": null,
        "description": "A group of 10 retired top US military officials endorsed US Vice President Kamala Harris in a letter made public on Monday, saying she is the only presidential candidate fit to serve as the nation's commander in chief.",
        "pubDate": "2024-09-09 14:17:49",
        "source_priority": 1204,
        "source_name": "Ndtv",
        "category": [
            "world"
        ],
        "sentiment": "positive",
        "score": 0.6354097127914429
    },
    {
        "title": "Harrasment claim false, hotel wasn't open in 2012, says director Ranjith's lawyer",
        "link": "https://english.mathrubhumi.com/movies-music/news/ranjith-harassment-case-lawyer-denies-allegations-1.9886733",
        "keywords": null,
        "description": "Kozhikode: Filmmaker Ranjith's lawyer has claimed that the harassment complaint lodged by a young man from Kozhikode is false. The complaint alleges that ...",
        "pubDate": "2024-09-09 14:17:45",
        "source_priority": 29098,
        "source_name": "Mathrubhumi English",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "score": 0.6981663107872009
    },
    {
        "title": "Rashmika Mandanna gorges on 'laddoos' during 'accidental break' - Greatandhra",
        "link": "https://news.google.com/rss/articles/CBMingFBVV95cUxOSUh3M0J0NVhWTERTYndRamIwWUNITEUxQXl0QmUzMldaWHZRTFdkdkhoVkR4QXNjeDZGWHp3SWRTcTZPQ1F0Wl9MdjBRbkczSC1jdFVCN3g3bDNhcy1PNm1PNEJkVUJtWFNsWlNlT2c4djdycWkyY1pFUGZ6VGVvWkZvNEpVc0NmakltN0JTV2dQWWxDNnVMcFNrWVQtQQ?oc=5",
        "keywords": null,
        "description": "Rashmika Mandanna gorges on 'laddoos' during 'accidental break' GreatandhraRashmika Mandanna reveals why she was away from social media, says she suffered a ‘minor accident’: I am better now Hindustan TimesAfter Salman Khan, Sikander Co-Star Rashmika Mandanna Has A 'Minor Accident': 'I Was Told By Doctors...' News18Rashmika Mandanna reveals she had a minor accident: ‘I am better now’ TOI Etimes'Life is short': Rashmika Mandanna informs fans about recovery from accident, says 'don’t know if...' DNA India",
        "pubDate": "2024-09-09 14:17:41",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "entertainment"
        ],
        "sentiment": "neutral",
        "score": 0.7678963541984558
    },
    {
        "title": "Turkish outfit now in ‘pole position’ to provide £200k p/w United wantaway an exit route before transfer deadline - Stretty News",
        "link": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxQYUxlR3dON29ISlFrZmJUT1djRUlBVGdjcjUxQmZLNW5vRC1kVHo2dzVBVnVscXk1czVXMTJ6bmdMQnNTc1REVG9vWkpQOEhSaGJ1VC1CVEcxQjAyanlrMzF0WjJ4Mzc4RVFsTXl6TGp6U2lmYWxLWDFCN0JVOTRmZ3JPTHVUQ19WNmtaZGtuWXpFdnNqR2FrcXplaFYyVzVqRUYydjJsSkx3VU5KS1FfUkt3bXNwamhkUl9iakxPY0xkYnQzVmtLSk0yd3ZoWENiZGZEeWlqcmtTcEpUMUFJ0gHkAUFVX3lxTE01WHlHcEZ0RElpT1lhSEFYS2pTUWVJSmQzdngzRkd5LXNScEJjV1ZFR1l6VGcza1VPYzB2b2xURjUtWjZBcDdWVjVLbXByUVdnbkQ4STQtenNQNlRNOTE2ZjJxb2o4RWRfTk94WnZwVUxnZG44all1V1UwWFZQRGVUNmZ6NWdlVWRVMktKVG9jc0JFSWNLNHB0Tnc2NnRVTkRFVE5xdFNtWFhsTDZBS25MSU1NU1hGTmkySGxhal9GRXRnZ0RxdzhMMFhkR1VzN0RBVkRBNEpnS1pnVG00aXdzQ01SeQ?oc=5",
        "keywords": null,
        "description": "Turkish outfit now in ‘pole position’ to provide £200k p/w United wantaway an exit route before transfer deadline Stretty NewsMan Utd looking to offload Antony with £86m flop keen on exit after losing place in team... The SunMan Utd man 'pushing' for September transfer with Euro giants in 'pole' amid Newcastle interest Football365Antony decides to quit Man United this week – report Football InsiderAntony 'closes in on loan move to Jose Mourinho's Fenerbahce' as Man United finally get set to offload £86m fl Daily Mail",
        "pubDate": "2024-09-09 14:17:25",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "sports"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Bruce Springsteen's wife Patti Scialfa reveals shocking blood cancer diagnosis",
        "link": "https://www.hindustantimes.com/entertainment/music/bruce-springsteens-wife-patti-scialfa-reveals-shocking-blood-cancer-diagnosis-101725888801159.html",
        "keywords": [
            "latest"
        ],
        "description": "The Rock and Roll Hall of Famer opened up on her 2018 blood cancer diagnosis at the Toronto International Film Festival on Sunday.",
        "pubDate": "2024-09-09 14:17:15",
        "source_priority": 933,
        "source_name": "Hindustan Times",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.9198099374771118
    },
    {
        "title": "Watch: Comedian heckles Nany Pelosi, asks which stocks to buy",
        "link": "https://timesofindia.indiatimes.com/world/us/watch-comedian-heckles-nany-pelosi-asks-which-stocks-to-buy/articleshow/113199431.cms",
        "keywords": null,
        "description": "Nancy Pelosi was unperturbed as a comedian approached her at a book signing event posing as a Democrat supporters and then ranted against Donald Trump before asking her advice on which stocks to buy. The comedian called Nancy Pelosi the greatest options traders of all times when he was restrained by Nancy's security details and was shows the door.",
        "pubDate": "2024-09-09 14:17:13",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.6766432523727417
    },
    {
        "title": "Tecno Spark 30C is official with Helio G81 chipset, 120 Hz screen",
        "link": "https://www.gsmarena.com/tecno_spark_30c_is_official_with_helio_g81_chipset_120_hz_screen-news-64454.php",
        "keywords": [
            "news"
        ],
        "description": "Tecno has unveiled the Spark 30C today. This phone seems to be tailor-made to compete with the Redmi 14C that launched last month, as the specs are quite similar.The Spark 30C comes with a 6.67-inch 720x1600 LCD screen with 120 Hz refresh rate, a 50 MP rear camera, an 8 MP selfie camera, and a 5,000 mAh battery with support for 18W wired charging.Tecno Spark 30C in Orbit Black (left), Orbit White (center), Magic Skin 3.0 (right)The phone is powered by MediaTek's Helio G81 SoC, and it's going to be offered in four RAM/storage combos: 4/128GB, 6/128GB, 4/256GB, and 8/256GB....",
        "pubDate": "2024-09-09 14:17:02",
        "source_priority": 1423,
        "source_name": "Gsm Arena",
        "category": [
            "technology"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Bandhan Bank launches GST collection services",
        "link": "https://theprint.in/economy/bandhan-bank-launches-gst-collection-services/2259809/",
        "keywords": [
            "pti wire",
            "economy"
        ],
        "description": "Kolkata, Sep 9 (PTI) Bandhan Bank on Monday announced the launch of a new service that allows its customers and non-customers to pay Goods and Services Tax (GST) through online and offline modes. “The initiation of GST revenue collections marks another significant milestone in our efforts to bring government services closer to our customers,” said [...]",
        "pubDate": "2024-09-09 14:16:53",
        "source_priority": 14094,
        "source_name": "Theprint",
        "category": [
            "business"
        ],
        "sentiment": "positive",
        "score": 0.5723419189453125
    },
    {
        "title": "Marvel's Spider-Man 2: Sony Reportedly Initiates Legal Action Against Unauthorised Version of the Game, Likely for PC Port Launch",
        "link": "https://in.ign.com/marvels-spider-man-2/214770/news/marvels-spider-man-2-sony-reportedly-initiates-legal-action-against-unauthorised-version-of-the-game",
        "keywords": [
            "igndia",
            "news",
            "marvel's spider-man 2"
        ],
        "description": "Sony’s legal moves could be a hint at a big reveal.Sony Interactive Entertainment is reportedly preparing to take legal action against individuals who distributed an unofficial PC port of Marvel’s Spider-Man 2 online using the game's leaked build. This news was shared by @PlayStationCDS, a PlayStation-focused account on X/Twitter. XboxEra co-founder @Shpeshal_Nick suggested that this crackdown could ...",
        "pubDate": "2024-09-09 14:16:44",
        "source_priority": 149,
        "source_name": "In Ign",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.869713544845581
    },
    {
        "title": "Kishan Reddy seeks CM’s cooperation to widen roads to Secunderabad Station, Cherlapally terminal",
        "link": "https://telanganatoday.com/kishan-reddy-seeks-cms-cooperation-to-widen-roads-to-secunderabad-station-cherlapally-terminal",
        "keywords": [
            "g kishan reddy",
            "a revanth reddy",
            "hyderabad",
            "news",
            "secunderabad railway station"
        ],
        "description": "Union Minister G Kishan Reddy has sought cooperation from CM Revanth Reddy in widening works of roads leading to Secunderabad Railway Station and Cherlapally Railway Terminal",
        "pubDate": "2024-09-09 14:16:40",
        "source_priority": 63887,
        "source_name": "Telangana Today",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8581246733665466
    },
    {
        "title": "Poor drainage, woeful facilities in Greater Noida mar day 1 of Afghanistan vs New Zealand Test",
        "link": "https://theprint.in/sport/poor-drainage-woeful-facilities-in-greater-noida-mar-day-1-of-afghanistan-vs-new-zealand-test/2259807/",
        "keywords": [
            "sport",
            "pti wire"
        ],
        "description": "Greater Noida, Sep 9 (PTI) Deplorable conditions at the Shaheed Vijay Singh Pathik Sports Complex, subpar drainage, a sodden outfield and woeful facilities played spoilsport as the opening day of the historic one-off Test between Afghanistan and New Zealand was called off on Monday without a ball being bowled. Rain had affected the buildup to [...]",
        "pubDate": "2024-09-09 14:16:38",
        "source_priority": 14094,
        "source_name": "Theprint",
        "category": [
            "sports"
        ],
        "sentiment": "negative",
        "score": 0.8149096369743347
    },
    {
        "title": "Soccer-De Ligt gets Dutch coach’s vote of confidence for Germany clash",
        "link": "https://theprint.in/sport/soccer-de-ligt-gets-dutch-coachs-vote-of-confidence-for-germany-clash/2259806/",
        "keywords": [
            "sport",
            "reuters wire"
        ],
        "description": "AMSTERDAM, Netherlands (Reuters) - Netherlands defender Matthijs de Ligt will get another chance to play in Tuesday’s Nations League clash against Germany in Amsterdam despite a mistake that led to a",
        "pubDate": "2024-09-09 14:16:37",
        "source_priority": 14094,
        "source_name": "Theprint",
        "category": [
            "sports"
        ],
        "sentiment": "neutral",
        "score": 0.8301277160644531
    },
    {
        "title": "Sports News | Poor Drainage, Woeful Facilities in Greater Noida Mar Day 1 of Afghanistan Vs New Zealand Test",
        "link": "https://www.latestly.com/agency-news/sports-news-poor-drainage-woeful-facilities-in-greater-noida-mar-day-1-of-afghanistan-vs-new-zealand-test-6253324.html",
        "keywords": null,
        "description": "Get latest articles and stories on Sports at LatestLY. Deplorable conditions at the Shaheed Vijay Singh Pathik Sports Complex, subpar drainage, a sodden outfield and woeful facilities played spoilsport as the opening day of the historic one-off Test between Afghanistan and New Zealand was called off on Monday without a ball being bowled.",
        "pubDate": "2024-09-09 14:16:37",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "score": 0.7280358076095581
    },
    {
        "title": "Over 19,000 people to participate to form human chain in Chamarajanagar on Intl. Day of Democracy",
        "link": "https://www.thehindu.com/news/national/karnataka/over-19000-people-to-participate-to-form-human-chain-in-chamarajanagar-on-intl-day-of-democracy/article68622475.ece",
        "keywords": [
            "karnataka"
        ],
        "description": null,
        "pubDate": "2024-09-09 14:16:34",
        "source_priority": 2972,
        "source_name": "The Hindu",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Hyderabad: Man beaten to death in Langer Houz; probe on",
        "link": "https://www.siasat.com/hyderabad-man-beaten-to-death-in-langer-houz-probe-on-3093105/",
        "keywords": [
            "murders",
            "hyderabad",
            "langer houz",
            "crime in hyderabad"
        ],
        "description": "Hyderabad: A 35-year-old man was beaten to death by unidentified assailants at Langer Houz in the early hours of Monday, September 9. The victim has been identified as Mukhtar Ahmed, a resident of Dream Welfare Colony. According to reports, police suspect that the victim and the accused went to a secluded spot in Langer Houz ...Get the latest updates in Hyderabad City News, Technology, Entertainment, Sports, Politics and Top Stories on WhatsApp & Telegram by subscribing to our channels. You can also download our app for Android and iOS.",
        "pubDate": "2024-09-09 14:16:29",
        "source_priority": 30879,
        "source_name": "Siasat.com",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "India News | Hearing on POCSO Case Against Yediyurappa Adjourned to Sept 19",
        "link": "https://www.latestly.com/agency-news/india-news-hearing-on-pocso-case-against-yediyurappa-adjourned-to-sept-19-6253323.html",
        "keywords": null,
        "description": "Get latest articles and stories on India at LatestLY. The Karnataka High Court on Monday adjourned to September 19 the hearing on a petition filed by former Chief Minister B S Yediyurappa seeking quashing of a POCSO case against him.",
        "pubDate": "2024-09-09 14:16:25",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.9032495617866516
    },
    {
        "title": "Apple’s iPhone 16 to put AI features in focus, Huawei’s new phone racks up pre-orders",
        "link": "https://theprint.in/tech/apples-iphone-16-to-put-ai-features-in-focus-huaweis-new-phone-racks-up-pre-orders/2259803/",
        "keywords": [
            "reuters wire",
            "tech"
        ],
        "description": "By Kenrick Cai SAN FRANCISCO (Reuters) -Apple on Monday is set to unveil its iPhone 16, focusing on how its flagship device's features are infused with artificial intelligence, but it could be",
        "pubDate": "2024-09-09 14:16:18",
        "source_priority": 14094,
        "source_name": "Theprint",
        "category": [
            "technology"
        ],
        "sentiment": "positive",
        "score": 0.5474916696548462
    },
    {
        "title": "Kangana Ranaut Sells Her Mumbai's Bandra Bungalow For ₹32 Crore Amid Emergency Row",
        "link": "https://www.freepressjournal.in/entertainment/mumbai-kangana-ranaut-sells-her-bandras-bungalow-for-32-crore-amid-emergency-row",
        "keywords": [
            "bollywood",
            "topnews",
            "entertainment",
            "fpj shorts"
        ],
        "description": null,
        "pubDate": "2024-09-09 14:16:13",
        "source_priority": 83130,
        "source_name": "The Free Press Journal",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "India’s First Mpox Case: Isolated Patient, Who Travelled Abroad, Tests Positive - News18",
        "link": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQaXNpaWlYbGlpUUtSTGlQM0lZWHZVaGRfMzRxOEhET1lKNk9rbndhang2QlpNNUVHbW1jR0dzcWNtTk1IZnR2Y1NoREdKck0tTjBrQ3VBdWM4aFhjXzlFcF8xVU9KdWp6eWhoZXotYUJKNXNFNmxDcWlzRF9zaHFmajhZTjVYRnJnSEVsOU0tME1rYjhLVGJtTG1NbXpnLV91VlB0elNuMDJQUQ?oc=5",
        "keywords": null,
        "description": "India’s First Mpox Case: Isolated Patient, Who Travelled Abroad, Tests Positive News18Mpox in India: Centre issues advisory following first suspected case The Times of IndiaMpox in India: Health Ministry issues advisory to states, UTs. Screening, contact tracing to be intensified Business TodayCentre Issues Directive Over Mpox Outbreak: What Are The Symptoms NDTVNew mpox case detected in India, government says viral strain not present India Today",
        "pubDate": "2024-09-09 14:16:10",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "health"
        ],
        "sentiment": "neutral",
        "score": 0.881493330001831
    },
    {
        "title": "Latest News | Rajasthan Police Blocks 2.36 Lakh Suspicious SIMs, 2.29 Lakh Mobile Phones to Curb Cyber Crime",
        "link": "https://www.latestly.com/agency-news/latest-news-rajasthan-police-blocks-2-36-lakh-suspicious-sims-2-29-lakh-mobile-phones-to-curb-cyber-crime-6253322.html",
        "keywords": null,
        "description": "Get latest articles and stories on Latest News at LatestLY. In a bid to curb cyber crimes in Mewat region, Rajasthan Police has blocked 2.36 lakh suspicious SIMs and 2.29 lakh mobile handsets, officials said on Monday.",
        "pubDate": "2024-09-09 14:16:09",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8766900897026062
    },
    {
        "title": "Dharmendra Pradhan accuses Stalin of pitting states against each other over National Education Policy, details here",
        "link": "https://www.hindustantimes.com/education/news/dharmendra-pradhan-accuses-stalin-of-pitting-states-against-each-other-over-national-education-policy-details-here-101725890254113.html",
        "keywords": [
            "latest"
        ],
        "description": "Pitting states against each other to make a point goes against the spirit of the Constitution and the value of a unified India, wrote Pradhan on X.",
        "pubDate": "2024-09-09 14:16:00",
        "source_priority": 933,
        "source_name": "Hindustan Times",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.5227166414260864
    },
    {
        "title": "Will Russia partner with India & China for a nuclear power plant? News9 Plus Decodes",
        "link": "https://www.news9live.com/world/will-russia-partner-with-india-china-for-a-nuclear-power-plant-news9-plus-decodes-2687883",
        "keywords": [
            "world"
        ],
        "description": "India wants to set up a lunar base by 2050. It perceives this collaboration as an opportunity to further its own space goals.",
        "pubDate": "2024-09-09 14:16:00",
        "source_priority": 193096,
        "source_name": "News9live",
        "category": [
            "world"
        ],
        "sentiment": "positive",
        "score": 0.6913006901741028
    },
    {
        "title": "41 Schools shut due to Maoist violence, re-open in Bastar",
        "link": "https://timesofindia.indiatimes.com/city/raipur/41-schools-shut-due-to-maoist-violence-re-open-in-bastar/articleshow/113199581.cms",
        "keywords": null,
        "description": "In Bastar, 41 schools that were closed due to Naxal violence have reopened as primary schools. The new curriculum follows the National Education Policy 2020, aiming to engage children in studies and activities to deter them from joining Naxalism. The initiative includes interest-free loans for higher education in affected regions.",
        "pubDate": "2024-09-09 14:15:50",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8113806247711182
    },
    {
        "title": "10 Judicial Officers Appointed Special Judges Anti-Corruption",
        "link": "https://www.dailyexcelsior.com/10-judicial-officers-appointed-special-judges-anti-corruption/",
        "keywords": [
            "j&k govt orders",
            "latest news"
        ],
        "description": "JAMMU, Sept 9: The Department of Law, Justice and Parliamentary Affairs of Jammu and Kashmir Government has appointed 10 Judicial Officers as the Special Judges of Anti-Corruption for trial of offences specified in section 4 of the Act. See Order Copy Click Here......The post 10 Judicial Officers Appointed Special Judges Anti-Corruption appeared first on Daily Excelsior.",
        "pubDate": "2024-09-09 14:15:41",
        "source_priority": 693953,
        "source_name": "Daily Excelsior",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.9417507648468018
    },
    {
        "title": "Kerala Government’s Rs 80 lakh monthly helicopter rent sparks controversy amid financial crisis",
        "link": "https://organiser.org/2024/09/09/255617/bharat/kerala-governments-rs-80-lakh-monthly-helicopter-rent-sparks-controversy-amid-financial-crisis/",
        "keywords": [
            "kerala",
            "helicopter",
            "bharat",
            "kerala government",
            "main",
            "helicopter rent",
            "covid-19 pandemic"
        ],
        "description": "The Kerala government’s decision to rent a helicopter for Rs 80 lakhs per month has come under scrutiny, as the intended purpose for its use has shifted significantly. Initially, the helicopter was rented for monitoring Maoist movements and conducting relief activities during disasters. However, it is now primarily being used for the chief minister’s travels. While Kerala Thunderbolt soldiers continue to monitor Maoist activities on foot in the forest areas, the helicopter was notably absent during recent relief efforts following the devastating landslides in Wayanad. Instead, it was used solely for the chief minister’s travel to address government officials, raising concerns about its cost-effectiveness and actual utility. The helicopter, rented by the Kerala government from Delhi-based Chipsan Aviation in September 2023, can be used for up to 25 hours per month at a cost of Rs 80 lakhs. For any additional flying hours beyond this limit, an extra charge of Rs 90,000 per hour is applicable. The Kerala government has incurred Rs 9.60 crore in helicopter rent so far, with the contract set for three years, projecting a total liability of Rs 28.80 crore. Critics argue that the state could have purchased its own helicopter for a much lower cost, estimated between Rs 5 crore and Rs 20 crore. The decision to rent a helicopter in 2020, during the height of the COVID-19 pandemic, sparked public outrage. That chopper, rented from Pawan Hans Company at a cost of Rs 22.21 crore, was considered unnecessary and largely unused, leading to the contract’s termination after one year. Despite this, the government made the contentious decision to rent another helicopter in 2023. Allegations have surfaced that the government is funneling money to a private company under the guise of a helicopter rental contract. This luxury comes at a time when the state is grappling with severe financial crises. This publication has previously reported on the state’s dire fiscal situation, where the government struggles to even secure loans to cover welfare pension payments for the elderly. Salaries and pensions for Kerala State Road Transport Corporation (KSRTC) employees remain uncertain, and there is a lack of funds for developmental projects and infrastructure improvements. The Kerala State Civil Supplies Corporation, established to offer essential goods at affordable prices, now sees few customers due to frequent shortages. New projects are stalled, and existing ones are barely progressing due to insufficient funds. Despite these financial woes, extravagances continue, with numerous high-paying appointments marred by widespread nepotism, leaving the public frustrated.",
        "pubDate": "2024-09-09 14:15:33",
        "source_priority": 216805,
        "source_name": "Organiser Weekly",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "After Ganesha, ADGP-RSS meet is Speaker Shamseer's new myth",
        "link": "https://www.onmanorama.com/news/kerala/2024/09/09/speaker-shamseer-downplays-adgp-rss-meeting.html",
        "keywords": null,
        "description": "His remarks could cause ideologically driven comrades to squirm.",
        "pubDate": "2024-09-09 14:15:14",
        "source_priority": 16247,
        "source_name": "Onmanorama",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "score": 0.8669955730438232
    },
    {
        "title": "AAP to protest against privatisation of BDA complexes on September 12",
        "link": "https://www.thehindu.com/news/national/karnataka/aap-to-protest-against-privatisation-of-bda-complexes-on-september-12/article68622559.ece",
        "keywords": [
            "karnataka"
        ],
        "description": null,
        "pubDate": "2024-09-09 14:15:13",
        "source_priority": 2972,
        "source_name": "The Hindu",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "IIT Kanpur Launches Online Platform To Help Students In CUET Preparation",
        "link": "https://www.ndtv.com/education/iit-kanpur-launches-sathee-cuet-for-exam-preparation-details-here-6526765",
        "keywords": null,
        "description": "IIT Kanpur 'SATHEE CUET': The platform also features a comprehensive test series to help students benchmark their performance against national standards.",
        "pubDate": "2024-09-09 14:15:10",
        "source_priority": 1204,
        "source_name": "Ndtv",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.6335881352424622
    },
    {
        "title": "PM Modi asks public for more nominations for Padma Awards as deadline nears",
        "link": "https://www.business-standard.com/india-news/pm-modi-asks-public-for-more-nominations-for-padma-awards-as-deadline-nears-124090900966_1.html",
        "keywords": null,
        "description": "PM Modi said that the central government has brought in the initiative of public nomination in a bid to make the system more transparent and participative",
        "pubDate": "2024-09-09 14:15:05",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.5197167992591858
    },
    {
        "title": "Janhvi Kapoor, Saif Ali Khan & Jr NTR Promote 'Devara' In Style On The Sets Of Kapil Sharma Show",
        "link": "https://www.news18.com/videos/movies/janhvi-kapoor-saif-ali-khan-jr-ntr-promote-devara-in-style-on-the-sets-of-kapil-sharma-show-9044949.html",
        "keywords": [
            "movies"
        ],
        "description": "Janhvi Kapoor, Saif Ali Khan, and Jr NTR were spotted promoting their upcoming movie 'Devara' on the sets of 'The Kapil Sharma Show' on Monday. Watch this video to see what they picked for the occasion.",
        "pubDate": "2024-09-09 14:15:05",
        "source_priority": 6644,
        "source_name": "News 18",
        "category": [
            "entertainment"
        ],
        "sentiment": "neutral",
        "score": 0.7582385540008545
    },
    {
        "title": "Yash and Fame Game Cycle: From schoolgoers’ ‘Rinku Singh’ taunts in-front of home to Test call-up",
        "link": "https://theprint.in/sport/yash-and-fame-game-cycle-from-schoolgoers-rinku-singh-taunts-in-front-of-home-to-test-call-up/2259786/",
        "keywords": [
            "sport",
            "pti wire"
        ],
        "description": "Kolkata, Sep 9 (PTI) For nearly one year, Chanderpal Dayal would avoid venturing out of his residence near Allahabad’s Karbala Masjid in the afternoon. The reason was both weird and hurtful. There would be school buses that would pass through his locality and children peeking out of the window would start hooting “Riinnnkuuuu Siiiinghhhhh, Riiiinnnkuuuuu [...]",
        "pubDate": "2024-09-09 14:15:03",
        "source_priority": 14094,
        "source_name": "Theprint",
        "category": [
            "sports"
        ],
        "sentiment": "negative",
        "score": 0.5722436904907227
    },
    {
        "title": "Dasara Food Mela – 2024: Vendors seek lower stall rentals, better locations",
        "link": "https://starofmysore.com/dasara-food-mela-2024-vendors-seek-lower-stall-rentals-better-locations/",
        "keywords": [
            "news",
            "mysuru dasara 2024",
            "dasara food mela",
            "mysuru dasara food mela vendors association",
            "dasara 2024"
        ],
        "description": "Mysuru: With less than a month left for this year’s Dasara festival (Oct. 3 to Oct. 12), the Mysuru Dasara Food Mela Vendors Association has urged the State Government to set stall rentals at Rs. 25,000 for vegetarian stalls and Rs. 30,000 for non-vegetarian stalls. Association President Nagaraju S. Siddaramanahundi, who addressed a press meet...The post Dasara Food Mela – 2024: Vendors seek lower stall rentals, better locations appeared first on Star of Mysore.",
        "pubDate": "2024-09-09 14:15:00",
        "source_priority": 409045,
        "source_name": "Star Of Mysore",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8645232319831848
    },
    {
        "title": "'Why Are They Pushing?': Janhvi Kapoor Loses Cool As Paps Cause Chaos During Devara Promotions",
        "link": "https://www.freepressjournal.in/entertainment/why-are-they-pushing-janhvi-kapoor-loses-cool-as-paps-cause-chaos-during-devara-promotions",
        "keywords": [
            "bollywood",
            "topnews",
            "fpj shorts",
            "entertainment"
        ],
        "description": null,
        "pubDate": "2024-09-09 14:14:54",
        "source_priority": 83130,
        "source_name": "The Free Press Journal",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Built in 2015, government hospital in Bihar’s Muzaffarpur has treated no patient",
        "link": "https://www.thehindu.com/news/national/bihar/built-in-2015-government-hospital-in-bihars-muzaffarpur-has-treated-no-patient/article68621911.ece",
        "keywords": [
            "bihar"
        ],
        "description": "The 30-bed hospital was built on a different plot of land following which the Health Department refused to take possession. Villagers say the hospital is now frequented by antisocial elements",
        "pubDate": "2024-09-09 14:14:34",
        "source_priority": 2972,
        "source_name": "The Hindu",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "score": 0.7256110310554504
    },
    {
        "title": "India Rich List 2024: Here are the wealthiest individuals in Gurgaon",
        "link": "https://newsblare.com/richest/india-rich-list-2024-here-are-the-wealthiest-individuals-in-gurgaon/",
        "keywords": [
            "richest"
        ],
        "description": "Here are the richest Indians residing in Gurgaon, according to the latest Hurun India Rich List 2024. Zomato CEO Deepinder Goyal leads the charts. Goyal is amongst only 23 wealthiest individuals in Gurgaon to hold more than ₹1,000 crore of assets, with a net worth of ₹9,300 crore. Despite his formidable fortune, Goyal is not [...]The post India Rich List 2024: Here are the wealthiest individuals in Gurgaon appeared first on Newsblare.",
        "pubDate": "2024-09-09 14:14:19",
        "source_priority": 1026586,
        "source_name": "News Blare",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.5417121052742004
    },
    {
        "title": "Meet Indian man with Rs 954520 crore net worth, who is likely to become a trillionaire after...",
        "link": "https://www.dnaindia.com/business/report-meet-indian-man-mukesh-ambani-with-rs-954520-crore-net-worth-who-is-likely-to-become-a-trillionaire-after-3106744",
        "keywords": [
            "business"
        ],
        "description": "He is one of the richest men in the world and runs Rs 19.80 lakh crore company in India.",
        "pubDate": "2024-09-09 14:14:08",
        "source_priority": 18388,
        "source_name": "Dna",
        "category": [
            "business"
        ],
        "sentiment": "positive",
        "score": 0.7657912969589233
    },
    {
        "title": "How to Identify Fake Saffron? 6 ways to spot adulteration",
        "link": "https://newsable.asianetnews.com/webstories/lifestyle/how-to-identify-fake-saffron-6-ways-to-spot-adulteration-atg-sjju7d",
        "keywords": null,
        "description": null,
        "pubDate": "2024-09-09 14:14:01",
        "source_priority": 7749,
        "source_name": "Asianet Newsable",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Former MUDA Chairman misused powers to release 848 sites: MLA",
        "link": "https://starofmysore.com/former-muda-chairman-misused-powers-to-release-848-sites-mla/",
        "keywords": [
            "news",
            "h.v. rajeev",
            "t.s. srivatsa",
            "top stories",
            "dr. d.b. natesh",
            "muda scam",
            "muda"
        ],
        "description": "Krishnaraja MLA T.S. Srivatsa alleges former MUDA Chairman H.V. Rajeev joined Congress from BJP to cover-up his illegal deals Mysuru: Krishnaraja MLA T.S. Srivatsa has levelled serious allegations against former Mysuru Urban Development Authority (MUDA) Chairman and Jnanaganga House Building Cooperative Society President, H.V. Rajeev, accusing him of disregarding Government orders to release 848 sites,...The post Former MUDA Chairman misused powers to release 848 sites: MLA appeared first on Star of Mysore.",
        "pubDate": "2024-09-09 14:14:00",
        "source_priority": 409045,
        "source_name": "Star Of Mysore",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Jaishankar says India supports Israel-Palestine ceasefire ‘as soon as possible’",
        "link": "https://munsifdaily.com/jaishankar-says-india-supports-israel-palestine-ceasefire-as-soon-as-possible/",
        "keywords": [
            "external affairs minister jai shankar",
            "breaking news",
            "s jaishankar",
            "muslim world",
            "pan india",
            "india supports",
            "israel-palestine",
            "india-gulf cooperation",
            "israel and hamas"
        ],
        "description": "Describing the current situation in Gaza as India's \"foremost concern\", External Affairs Minister S Jaishankar on Monday said that New Delhi supports a ceasefire \"as soon as possible\" in the region, where Israel and Hamas are engaged in conflict since last 11 months.",
        "pubDate": "2024-09-09 14:13:49",
        "source_priority": 1196600,
        "source_name": "The Munsif Daily",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8971611261367798
    },
    {
        "title": "India fine tuning FTAs with countries to suit domestic industry: Prasada",
        "link": "https://www.business-standard.com/economy/news/india-fine-tuning-ftas-with-countries-to-suit-domestic-industry-prasada-124090900792_1.html",
        "keywords": null,
        "description": "India is revising FTAs with South Korea, Malaysia and various other ASEAN countries to benefit the domestic industries, Union Minister of State for Ministry of Commerce and Industry Jitin Prasada said on Monday.At the 64th annual session of ACMA (Automotive Component Manufacturers Association) here, he noted that the free trade agreements (FTAs) with the UK and the European Union are being spearheaded by Prime Minister Narendra Modi.\"It will play a great role for the auto components industry,\" the minister said.He further said: \"We are also revising and reworking our FTAs with Korea, with Malaysia, with ASEAN countries, which will be fine-tuned to the demands of our industry.\"Prasada also urged the auto components industry to increase investment in R&D activities.\"We are not investing enough in R&D, I believe this is 1 per cent of the revenue that is being invested so this is very crucial,\" he noted.He also emphasised the importance of boosting exports, reducing import ..",
        "pubDate": "2024-09-09 14:13:48",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "business"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Ganguly believes Pant will become one of all-time greats in Test cricket",
        "link": "https://www.business-standard.com/cricket/news/ganguly-believes-pant-will-become-one-of-all-time-greats-in-test-cricket-124090900528_1.html",
        "keywords": null,
        "description": "Former India captain Sourav Ganguly believes Rishabh Pant is on course to become an all-time great in Test cricket but at the same time, the southpaw needs to raise his game in the shorter formats.Pant on Sunday returned to the Test side for the first time since his life-threatening car accident in December 2022. He is expected to the start the first Test against Bangladesh beginning in Chennai on September 19.Since his return earlier this year following the accident, Pant has played T20s and ODIs and has done well.\"I consider Rishabh Pant one of India's best Test batsmen. I'm not surprised that he's back in the side, and he will continue to play for India in Tests,\" Ganguly said at a promotional event here.\"He will be an all-time great in Tests if he keeps performing like this. For me, he needs to get better in the shorter formats. With the talent he has, I'm sure with time, he will become one of the best.\"Indian selectors have opted to give Mohammed Shami more time to recov",
        "pubDate": "2024-09-09 14:13:46",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "sports"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Bhavish Aggarwal Agrees With Nitin Gadkari on EVs Costs To Come Down Same As Petrol, Diesel Cars, Says ‘End ICE Age’ Coming Near",
        "link": "https://www.latestly.com/socially/auto/bhavish-aggarwal-agrees-with-nitin-gadkari-on-evs-costs-to-come-down-same-as-petrol-diesel-cars-says-end-ice-age-coming-near-6253273.html",
        "keywords": null,
        "description": "Ola CEO Bhavish Aggarwal said that he agreed to India's Road and Transport Minister Nitin Gadkari over prices of EVs coming down as ICE (petrol and diesel) models in next two years.",
        "pubDate": "2024-09-09 14:13:28",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "technology"
        ],
        "sentiment": "neutral",
        "score": 0.8452600240707397
    },
    {
        "title": "Debattama Saha shares a throwback video with a heartfelt note when she lost her voice, writes 'I used to shut myself up most of the time and cry'",
        "link": "https://timesofindia.indiatimes.com/tv/news/hindi/debattama-saha-shares-a-throwback-video-with-a-heartfelt-note-when-she-lost-her-voice-writes-i-used-to-shut-myself-up-most-of-the-time-and-cry/articleshow/113199426.cms",
        "keywords": null,
        "description": "Debattama Saha, known for TV shows like Ishaaron Isharoon Mein and Shaurya Aur Anokhi Kahani, recently shared a personal story about losing her voice for three months. She posted a video of herself singing Iktara on Instagram, expressing gratitude for her recovery. Fans responded with love and encouragement.",
        "pubDate": "2024-09-09 14:13:16",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.7882016897201538
    },
    {
        "title": "Challenge is to develop new-age tech affordably: Maruti MD Takeuchi",
        "link": "https://www.business-standard.com/companies/news/challenge-is-to-develop-new-age-tech-affordably-maruti-md-takeuchi-124090901105_1.html",
        "keywords": [
            "companies"
        ],
        "description": "The average car price in India has increased rapidly in the last 5-6 years due to new emission regulations and the demand for more spacious and comfortable cars loaded with advanced technology",
        "pubDate": "2024-09-09 14:13:02",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.636287271976471
    },
    {
        "title": "Parliament security breach case: Charge sheet says Manoranjan of Mysuru key conspirator who instigated others",
        "link": "https://starofmysore.com/parliament-security-breach-case-charge-sheet-says-manoranjan-of-mysuru-key-conspirator-who-instigated-others/",
        "keywords": [
            "parliament security breach",
            "uapa",
            "patiala house court",
            "d. manoranjan",
            "news",
            "top stories"
        ],
        "description": "New Delhi: The Patiala House Court in New Delhi has taken cognisance of the charge sheet filed by the Delhi Police in the Parliament security breach case where all six arrested have been charged under the provisions of stringent Unlawful Activities (Prevention) Act (UAPA). The nearly 1,000-page chargsheet, submitted to Additional Sessions Judge Hardeep Kaur,...The post Parliament security breach case: Charge sheet says Manoranjan of Mysuru key conspirator who instigated others appeared first on Star of Mysore.",
        "pubDate": "2024-09-09 14:13:00",
        "source_priority": 409045,
        "source_name": "Star Of Mysore",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Man detained for sex assault on minor daughters",
        "link": "https://timesofindia.indiatimes.com/city/mumbai/father-detained-for-sexually-assaulting-minor-daughters/articleshow/113199561.cms",
        "keywords": null,
        "description": null,
        "pubDate": "2024-09-09 14:12:58",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "entertainment"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "NEET UG counselling 2024: MCC adds 600 new medical seats in Telangana",
        "link": "https://www.siasat.com/neet-ug-counselling-2024-mcc-adds-600-new-medical-seats-in-telangana-3093150/",
        "keywords": [
            "mcc",
            "hyderabad",
            "top stories",
            "counselling",
            "medical seats",
            "education and career",
            "telangana",
            "neet ug"
        ],
        "description": "Hyderabad: The Medical Counselling Committee (MCC) has announced a significant increase in medical seats for the second round of NEET UG Counselling 2024, with Telangana receiving 600 new seats across eight medical colleges in the state. According to reports, 50 percent of these seats have been reportedly reserved exclusively for female candidates. The institutes that ...Get the latest updates in Hyderabad City News, Technology, Entertainment, Sports, Politics and Top Stories on WhatsApp & Telegram by subscribing to our channels. You can also download our app for Android and iOS.",
        "pubDate": "2024-09-09 14:12:57",
        "source_priority": 30879,
        "source_name": "Siasat.com",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "World News | Mario Draghi Has Solutions for Europe's Sluggish Economy. Will EU Governments Listen?",
        "link": "https://www.latestly.com/agency-news/world-news-mario-draghi-has-solutions-for-europes-sluggish-economy-will-eu-governments-listen-6253317.html",
        "keywords": null,
        "description": "Get latest articles and stories on World at LatestLY. A long-awaited report on how to rescue Europe's economy from weak growth and red tape is in. The question is, how many of its recommendations will actually be enacted by the drawn-out decision-making process of the European Union?",
        "pubDate": "2024-09-09 14:12:52",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8280268311500549
    },
    {
        "title": "India News | National Centre for Good Governance Begins Training Program for 34 Maldivian Civil Servants",
        "link": "https://www.latestly.com/agency-news/india-news-national-centre-for-good-governance-begins-training-program-for-34-maldivian-civil-servants-6253316.html",
        "keywords": null,
        "description": "Get latest articles and stories on India at LatestLY. The National Centre for Good Governance on Monday commenced a capacity-building programme for 34 civil servants of Maldives, according to an official statement.",
        "pubDate": "2024-09-09 14:12:37",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8412832617759705
    },
    {
        "title": "Science council announces funds for college students’ projects",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/science-council-announces-funds-for-college-students-projects/article68618733.ece",
        "keywords": [
            "tamil nadu"
        ],
        "description": "Students will get Rs. 10,000 to complete their projects of value to society",
        "pubDate": "2024-09-09 14:12:31",
        "source_priority": 2972,
        "source_name": "The Hindu",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "score": 0.5018776655197144
    },
    {
        "title": "India News | ISIS Radicals Behind Rameshwaram Cafe Blast: NIA Chargesheet",
        "link": "https://www.latestly.com/agency-news/india-news-isis-radicals-behind-rameshwaram-cafe-blast-nia-chargesheet-6253315.html",
        "keywords": null,
        "description": "Get latest articles and stories on India at LatestLY. Two of the key accused involved in the high-profile Bengaluru Rameshwaram Cafe blast case were ISIS radicals, and they had earlier conspired to do 'Hijrah' to ISIS territories in Syria, National Investigation Agency (NIA) mentions in a chargesheet.",
        "pubDate": "2024-09-09 14:12:29",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.7915716171264648
    },
    {
        "title": "J&K Govt Appoints New Judges For Family Courts",
        "link": "https://www.dailyexcelsior.com/jk-govt-appoints-new-judges-for-family-courts/",
        "keywords": [
            "j&k govt orders",
            "latest news"
        ],
        "description": "JAMMU, Sept 9: The Government of Jammu and Kashmir has appointed Renu Dogra and Prem Sagar as the Principal Judge of the Family Court in Srinagar and the Additional Judge of the Family Court in Jammu, respectively. See Order Copy Click Here......The post J&K Govt Appoints New Judges For Family Courts appeared first on Daily Excelsior.",
        "pubDate": "2024-09-09 14:12:29",
        "source_priority": 693953,
        "source_name": "Daily Excelsior",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.9440791606903076
    },
    {
        "title": "Bees At Work at Indo-Bangladesh Border: BSF Trains Men In Beekeeping To Avert Intrusion Bids - News18",
        "link": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQMUNiR1NldHZiWVV3NU81QUVBNDY1ZnQ3eDQ5Z1Z4Qk5tbnhFV05VRUIwc3FHSG1GQ2IwdV9DLUZsMkZOSEJZaFpaSUlQaW11QXhQcVVIXzZaZ0hIbW11RjZTcXFhV2dJMTg2RXdBeTNzU2h2eHF6VTZ2NWFuMXNKaWRpZ2ZLNXA4V3dGT2I4ckJFeC04UHIxczdidzJkQk1CYkc4Y1J1bWx4MmUtN2FLaDh3Y29BcFYwR05TZXlqWFZsWjVXU1JvOTI1U3F6Z9IB0wFBVV95cUxQWmFhQmRYZ25iSkdJZWNtQUhOUGZGRVdEaGtpTlFBY1ZJSUx1RWI3ellmMjE3YncyQlM1NjZfWWV6TF9XckFiNFRkWUpfbGdNbjlpVV90RUFBVWE1MmFkWVBYanQ0UzM5VDRyRDFRT1JURWVoUDBqT19ka1pRTWF1Z2hESWxiczJwZjVrcFphbTNpMTVGcjFfRGpYWFlYZDlMbWdoSW1qR0JrQzR0NXdOaldxajA1bE9vaFd3Uy1fYzJINkQ2WkVjdjZ1QklBaE51UVVn?oc=5",
        "keywords": null,
        "description": "Bees At Work at Indo-Bangladesh Border: BSF Trains Men In Beekeeping To Avert Intrusion Bids News18",
        "pubDate": "2024-09-09 14:12:21",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8261643052101135
    },
    {
        "title": "India News | Intended to Demean India on Global Stage: Union Minister Naidu on Rahul's Skill Comment in US",
        "link": "https://www.latestly.com/agency-news/india-news-intended-to-demean-india-on-global-stage-union-minister-naidu-on-rahuls-skill-comment-in-us-6253313.html",
        "keywords": null,
        "description": "Get latest articles and stories on India at LatestLY. TDP leader and Union Minister Kinjarapu Ram Mohan Naidu said Congress leader Rahul Gandhi's comment in the US that \"people with skills are being sidelined in India\" was intended to \"demean\" the nation on a global stage.",
        "pubDate": "2024-09-09 14:12:16",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.6964825391769409
    },
    {
        "title": "Mollywood MeToo: Ranjini Haridas reveals famous actor asked for nude photo",
        "link": "https://www.newsbytesapp.com/news/entertainment/actor-ranjini-haridas-shares-horrific-nude-picture-incident/story",
        "keywords": null,
        "description": "In a recent media interaction, television presenter, actor, model, and YouTuber Ranjini Haridas disclosed a disturbing incident. She revealed that a renowned actor had sent her an unsolicited nude photograph.",
        "pubDate": "2024-09-09 14:12:10",
        "source_priority": 309848,
        "source_name": "Newsbytes",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "score": 0.6985076665878296
    },
    {
        "title": "Why Sohum Shah said 'Tumbbad' was 'wronged' when it was first released",
        "link": "https://www.newsbytesapp.com/news/entertainment/sohum-shah-feels-tumbbad-was-not-treated-fairly-upon-release/story",
        "keywords": null,
        "description": "Actor Sohum Shah recently expressed his excitement over the re-release of his 2018 folk horror drama, Tumbbad, in theaters on Friday, September 13.",
        "pubDate": "2024-09-09 14:12:09",
        "source_priority": 309848,
        "source_name": "Newsbytes",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "score": 0.9447104930877686
    },
    {
        "title": "Selena Gomez, Viola Davis, and other stars to present at Emmys: Full lineup",
        "link": "https://www.newsbytesapp.com/news/entertainment/emmys-2024-selena-gomez-and-kristen-wiig-among-presenters/story",
        "keywords": null,
        "description": "The 76th Emmy Awards, set to take place on Sunday (September 15), has announced its list of presenters.",
        "pubDate": "2024-09-09 14:12:09",
        "source_priority": 309848,
        "source_name": "Newsbytes",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8363430500030518
    },
    {
        "title": "Emotional Selena Gomez reveals she can't carry her own children",
        "link": "https://www.newsbytesapp.com/news/entertainment/selena-reveals-she-can-t-have-children-due-to-medical-issues/story",
        "keywords": null,
        "description": "American singer and actor Selena Gomez recently opened up about her struggles with fertility, revealing that she \"can't carry [her] own children\" due to various health issues.",
        "pubDate": "2024-09-09 14:12:09",
        "source_priority": 309848,
        "source_name": "Newsbytes",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "score": 0.6179623007774353
    },
    {
        "title": "Bleach Rebirth of Souls - Official Rangiku Matsumoto Character Trailer",
        "link": "https://in.ign.com/bleach-rebirth-of-souls/214776/video/bleach-rebirth-of-souls-official-rangiku-matsumoto-character-trailer",
        "keywords": [
            "bleach rebirth of souls",
            "video"
        ],
        "description": "Watch the new Bleach Rebirth of Souls character trailer for a look at Rangiku Matsumoto from Squad 10. Meet the charming Lieutenant and see her Shakkaho signature move, pressure moves, and more in this new Bleach Rebirth of Souls from the upcoming action-fighting game. Rangiku is strong at medium ranges uses straightforward Hado with counter-attacks to create opportunities to strike her opponents. Bleach Rebirth of Souls will be released on PS5 (PlayStation 5), Xbox Series X/S, and PC via Steam.",
        "pubDate": "2024-09-09 14:12:07",
        "source_priority": 149,
        "source_name": "In Ign",
        "category": [
            "technology",
            "entertainment"
        ],
        "sentiment": "neutral",
        "score": 0.6171199679374695
    },
    {
        "title": "SL beat England in 3rd Test: A look at WTC standings",
        "link": "https://www.newsbytesapp.com/news/sports/sl-beat-england-in-3rd-test-wtc-standings/story",
        "keywords": null,
        "description": "Sri Lanka beat England in the third and final Test at the Kennington Oval in London on September 9.",
        "pubDate": "2024-09-09 14:12:06",
        "source_priority": 309848,
        "source_name": "Newsbytes",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.9233176112174988
    },
    {
        "title": "‘Rahul promotes China, undermines India’: Himanta Biswa Sarma on Lok Sabha leader of opposition's remarks in US",
        "link": "https://www.hindustantimes.com/india-news/rahul-promotes-china-undermines-india-himanta-biswa-sarma-on-leader-of-oppositions-remarks-in-us-101725890232065.html",
        "keywords": [
            "latest"
        ],
        "description": "Rahul Gandhi said India, the US and other countries in the West are facing the problem of unemployment while China isn't as it dominates global production",
        "pubDate": "2024-09-09 14:12:04",
        "source_priority": 933,
        "source_name": "Hindustan Times",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.7788175940513611
    },
    {
        "title": "Trump Vs Kamala Debate: Who Stands Where On Crucial Issues That Could Swing US Elections | Watch",
        "link": "https://www.hindustantimes.com/videos/trump-vs-kamala-debate-who-stands-where-on-crucial-issues-that-could-swing-us-elections-watch-101725891031208.html",
        "keywords": [
            "latest"
        ],
        "description": "The 2024 campaign season's second general election debate and the first showdown between former President Donald Trump and US Vice President Kamala Harris will be a clash of contrasts. This comes months after the June debate between Trump and incumbent President Joe Biden, who later announced an end to his reelection bid and endorsed Harris after facing immense backlash over his lackluster performance and concerns around his age and fitness. Trump has attacked Harris multiple times since her abrupt rise to prominence, primarily on a personal level. Trump is most likely to target Harris on issues, ranging from questioning her race to her views on immigration, taxes, foreign policy, election involvement, etc. Watch this video to know where the two presidential candidates stand on key issues.",
        "pubDate": "2024-09-09 14:12:04",
        "source_priority": 933,
        "source_name": "Hindustan Times",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "‘Rahul promotes China, undermines India’: Himanta Biswa Sarma on Lok Sabha leader of opposition's remarks in US - Hindustan Times",
        "link": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxObi1YSXZXMHFZbzNVeTdkUm5fOEpxYVFJbmhkX0lCY2V3UEZmZXFfaHJ3aVVnTDNzRmZIa2R1U05SXzhpTXEzSjUzcl9YYjNzOGh1ckJOWHM3djYtX0RMTmlnUkkzaWZGU1JZS05udlVRRVVzRkhOS3Rfck5wUnBhNXRXcVdUeXZXQ1R1QllKVk9BQ3lTcGV5TlQzVWxJeW9peW1mcHQzdERXNHczWGRlWVZqRGVzY19MV0hQdlRQNHFsdDhLNnotX0ZWNnFHYlkxZDdmLW5KNnpsSFlpNHdvbEFrTHYzX1pUWXBZYXhoWkPSAfYBQVVfeXFMT01XcDVHNmVfT2ZJTm1tMFJWMXNjNDB6cTZOUEtqN3c4b3ZPaTlnb2EzNTdCaXY0cUNYeUdIUFp6SDB0S2psdGU3dmVxV3pGanRHd0JFY0hYVTA5SG05S2xCMGhwWTBITzIxM2NUdE5SX1FjT1dPZ0VoOFBPeUczZ2ZZOTRma3ltdlpzSjY3Um1hZVpTdFh6WDhjSGhmVGt2bDUzUUwtNjB3eTFEZzlQYUdWNEtnOFgzMHJ5eENiZ1dZOURtNWFKbmpfRmFNaFZxdUlKbkVEcUhNcHJia1ROMEZ3LTg0WENHLUI2S2lOSWc4dVM0cDlB?oc=5",
        "keywords": null,
        "description": "‘Rahul promotes China, undermines India’: Himanta Biswa Sarma on Lok Sabha leader of opposition's remarks in US Hindustan Times'Rahul Gandhi always promotes China': BJP leaders lash out at LoP over his remarks in US The Times of India'AI Not Going To Take Jobs Away, Will Be Game-Changer': Techie NDTVRahul Gandhi in U.S.: Love, respect & humility missing in Indian politics The HinduHow Rahul Gandhi Plans to Cultivate ‘Tough Leader’ Image With Hostility Towards RSS News18",
        "pubDate": "2024-09-09 14:12:04",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "score": 0.524627685546875
    },
    {
        "title": "New Bill targets social media, digital news, content creators",
        "link": "https://starofmysore.com/new-bill-targets-social-media-digital-news-content-creators/",
        "keywords": [
            "kalpa kshetra auditorium",
            "alok prasanna kumar",
            "news",
            "mysore open forum"
        ],
        "description": "Alok Prasanna Kumar of Vidhi Centre for Legal Policy warns of expanding regulations Mysuru: Alok Prasanna Kumar from the Vidhi Centre for Legal Policy, Bengaluru, delivered a talk titled ‘An Ice Age for Free Speech’ at a programme organised by the Mysore Open Forum (MOF) at Kalpa Kshetra Auditorium in Vijayanagar Fourth Stage yesterday. Highlighting...The post New Bill targets social media, digital news, content creators appeared first on Star of Mysore.",
        "pubDate": "2024-09-09 14:12:00",
        "source_priority": 409045,
        "source_name": "Star Of Mysore",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.9160236120223999
    },
    {
        "title": "Bengaluru Cafe Blast Case: NIA Chargesheet Reveals Accused Plan To Target Karnataka BJP HQ on Ayodhya Ram Mandir Inauguration Day",
        "link": "https://www.latestly.com/india/news/bengaluru-cafe-blast-case-nia-chargesheet-reveals-accused-plan-to-target-karnataka-bjp-hq-on-ayodhya-ram-mandir-inauguration-day-6253278.html",
        "keywords": null,
        "description": "The National Investigation Agency (NIA) on Monday filed a chargesheet against four accused in connection with the blast at the Rameshwaram Cafe here on March 1.",
        "pubDate": "2024-09-09 14:11:57",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.814993679523468
    },
    {
        "title": "7-9-13 on 7-9-24! Sachin Tendulkar hails para-athletes after best-ever Paralympics campaign",
        "link": "https://timesofindia.indiatimes.com/sports/paris-paralympics/7-9-13-on-7-9-24-sachin-tendulkar-hails-para-athletes-after-best-ever-paralympics-campaign/articleshow/113199317.cms",
        "keywords": null,
        "description": "Sachin Tendulkar commended India's para-athletes for their outstanding performance at the Paris Paralympics, where they secured a record-breaking 29 medals. The team won seven golds, nine silvers, and 13 bronzes. Key achievements include Avani Lekhara's two golds in shooting and Dharambir's Asian record in men's club throw.",
        "pubDate": "2024-09-09 14:11:51",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "score": 0.9684672951698303
    },
    {
        "title": "Man arrested for beating Python to death in Chhattisgarh's Gariaband; Viral video leads to confession",
        "link": "https://timesofindia.indiatimes.com/city/raipur/man-arrested-for-beating-python-to-death-in-chhattisgarhs-gariaband-viral-video-leads-to-confession/articleshow/113199515.cms",
        "keywords": null,
        "description": "A 47-year-old man was arrested by the Chhattisgarh Forest Department for killing a python near Koyba village. Nakul Markam initially tried to mislead officials but confessed after being shown a viral video of the incident. He was charged under the Wildlife (Conservation) Act, 1972, and brought before the Judicial Magistrate's Court.",
        "pubDate": "2024-09-09 14:11:25",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "score": 0.7002627849578857
    },
    {
        "title": "Gus Atkinson rested for Australia ODIs, Olly Stone called up",
        "link": "https://www.espncricinfo.com/ci/content/story/1450451.html?ex_cid=OTC-RSS",
        "keywords": null,
        "description": "England opt to manage Atkinson's workload after haul of 34 wickets across first six Tests",
        "pubDate": "2024-09-09 14:11:23",
        "source_priority": 1162,
        "source_name": "Espncricinfo",
        "category": [
            "sports"
        ],
        "sentiment": "neutral",
        "score": 0.8933214545249939
    },
    {
        "title": "KL Rahul To Play Ahead Of Sarfaraz Khan In 1st Test Against Bangladesh – Report",
        "link": "https://www.news18.com/cricket/kl-rahul-to-play-ahead-of-sarfaraz-khan-in-1st-test-against-bangladesh-report-9044945.html",
        "keywords": [
            "cricket"
        ],
        "description": "In his last Test match for India against England at Rajiv Gandhi International Stadium in Hyderabad, 32-year-old Rahul scored 86 runs in the first inning.",
        "pubDate": "2024-09-09 14:11:17",
        "source_priority": 6644,
        "source_name": "News 18",
        "category": [
            "sports"
        ],
        "sentiment": "neutral",
        "score": 0.8987284302711487
    },
    {
        "title": "How BJP MP's letters on RG Kar case sparked off talk of a new chief for Bengal unit - India Today",
        "link": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxONEtsUGhadUU1Y2Q5R3JhUXZ6UkQwR056dW9EbmIweF80dEJvRklpT1R6SUFOZUF6endTTkFjbjJDTERHMVk2ZG1hR0lqNmhHWTRmVjdtTkJ1UXpPTGlmUWEzZUlGZE9CakhfSWFhUF9lWnpid053c0RQc1BvRzQwSUM3X2RfSkdIMVBlT0dUVnNKdkhFelk3eEs3Ym91aENUSE5ZcGxMbEZSSlVoV0V2ckczRFkyZ0p1dmo0M3JEa0xYRmdyLUlGM25DQVdXOXFaSlhFbTJiVEhuZnVBOGtDWEVudEloVmh20gHuAUFVX3lxTE1LZWg1WHBDd1lGSk1yR3JUTDU4b2dZRVF5ZUNicUVDUmt1bThDQnYxcUJReG92WGhQWlZFWXFYVjRYbUxJOHhTNkdFZ0V4YjhnOWJna3hsUlRMM1pkR2dKS2dKTDV1RW93MmxuanktQWlEV3BlbjZEdHJmeVh4ZmNmeU9Sd1dMcGZiZUVnM2VtRjg2X2lMTGRzb2ZPck9BQ0dIU3lOWDJVRGItX0NzSzFyZUQtOW9EUkU0T09wYXFzOWpyZHAzdUxkTmdsSFZsbW45NUsyWklINW1zbkJ2dDRXQ0Flek1jdy1zcjE4cFE?oc=5",
        "keywords": null,
        "description": "How BJP MP's letters on RG Kar case sparked off talk of a new chief for Bengal unit India TodayKolkata rape-murder case live updates: Supreme Court to begin hearing shortly Hindustan TimesKolkata doctor rape-murder: R.G. Kar victim’s justice key concern, charges of unfair practices in hospitals also serious, says Lawyers The Hindu'Arrest of Mamata Banerjee is crucial': BJP MP Jyotirmay Mahato urges ED to investigate Bengal CM over Ko The Times of IndiaMamata's dirty face exposed in Supreme Court: BJP on Kolkata rape-murder case The Economic Times",
        "pubDate": "2024-09-09 14:11:09",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Sikhs have contributed much for the country: MP",
        "link": "https://starofmysore.com/sikhs-have-contributed-much-for-the-country-mp/",
        "keywords": [
            "guru granth sahib prakash utsav",
            "sikh community",
            "news",
            "yaduveer krishnadatta chamaraja wadiyar",
            "gurudwara sri gurusingh sabha"
        ],
        "description": "Mysuru: MP Yaduveer Krishnadatta Chamaraja Wadiyar said that Sikhs have contributed very much for the growth of the country. He was speaking at the ‘Guru Granth Sahib Prakash Utsav’ organised by the Sikh Community at Gurudwara Sri Gurusingh Sabha off KRS Road in Brindavan Extension here yesterday. Observing that this programme is a perfect example...The post Sikhs have contributed much for the country: MP appeared first on Star of Mysore.",
        "pubDate": "2024-09-09 14:11:00",
        "source_priority": 409045,
        "source_name": "Star Of Mysore",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "score": 0.865537703037262
    },
    {
        "title": "Monkeypox Enters India: Government Confirms First Mpox Case; No Immediate Risk To Public, Says Centre",
        "link": "https://www.thehealthsite.com/news/monkeypox-enters-india-government-confirms-first-mpox-case-no-immediate-risk-to-public-says-centre-1124557/",
        "keywords": [
            "health news",
            "monkeypox cases in india",
            "mpox in india",
            "mpox",
            "mpox symptoms"
        ],
        "description": "India's first monkeypox case 2024: According to the reports, a young male patient, who recently returned to India from a country with active Mpox transmission, had been identified as the first case of the virus.",
        "pubDate": "2024-09-09 14:11:00",
        "source_priority": 13386,
        "source_name": "Thehealthsite",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.588138997554779
    },
    {
        "title": "For Pratham Singh, Duleep Trophy inclusion a ‘validation’ of run of scores he has had",
        "link": "https://sportstar.thehindu.com/cricket/duleep-trophy-pratham-singh-included-india-a-squad/article68622567.ece",
        "keywords": [
            "cricket"
        ],
        "description": "He scored 130 and 143 against Gujarat and TNCA President’s XI in the Buchi Babu tournament, while he was the top run-getter for Railways with 530 runs from 12 innings at an average of 48.18 in the 2023-24 Ranji Trophy.",
        "pubDate": "2024-09-09 14:10:53",
        "source_priority": 2972,
        "source_name": "Sport Star The Hindu",
        "category": [
            "sports"
        ],
        "sentiment": "neutral",
        "score": 0.645343542098999
    },
    {
        "title": "Germany to put temporary controls on all land borders, source says",
        "link": "https://timesofindia.indiatimes.com/world/europe/germany-to-put-temporary-controls-on-all-land-borders-source-says/articleshow/113199509.cms",
        "keywords": null,
        "description": "German Interior Minister Nancy Faeser is set to announce temporary border controls at all land borders to address irregular migration and Islamist extremism. This measure follows public concern after a deadly knife attack by a Syrian asylum seeker. The announcement precedes state elections in Brandenburg, where the Social Democrats govern in coalition with other parties.",
        "pubDate": "2024-09-09 14:10:49",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.7678284645080566
    },
    {
        "title": "WCC proposes Cinema Code of Conduct",
        "link": "https://www.thehindu.com/news/national/kerala/wcc-proposes-cinema-code-of-conduct/article68622402.ece",
        "keywords": [
            "kerala"
        ],
        "description": "As per the code, there should be employment contracts for film employees at all levels, specifying the film title, employer and employee details",
        "pubDate": "2024-09-09 14:10:45",
        "source_priority": 2972,
        "source_name": "The Hindu",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8542653322219849
    },
    {
        "title": "J&K Govt Orders Deputation, Repatriation Of 5 Judicial Officers",
        "link": "https://www.dailyexcelsior.com/jk-govt-orders-deputation-repatriation-of-5-judicial-officers/",
        "keywords": [
            "j&k govt orders",
            "latest news"
        ],
        "description": "JAMMU, Sept 9: The Department of Law, Justice and Parliamentary Affairs of Jammu and Kashmir Government has ordered the deputation and repatriation of 5 Judicial Officers. See Order Copy Click Here......The post J&K Govt Orders Deputation, Repatriation Of 5 Judicial Officers appeared first on Daily Excelsior.",
        "pubDate": "2024-09-09 14:10:36",
        "source_priority": 693953,
        "source_name": "Daily Excelsior",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.9358350038528442
    },
    {
        "title": "Rashmika Mandanna reveals she had a minor accident: ‘I am better now’",
        "link": "https://timesofindia.indiatimes.com/entertainment/telugu/movies/news/rashmika-mandanna-reveals-she-had-a-minor-accident-i-am-better-now/articleshow/113199487.cms",
        "keywords": null,
        "description": "Rashmika Mandanna disclosed the reason for her recent absence from public view and social media, citing recovery from a minor accident. In an Instagram note, she updated fans on her improved health and stressed the importance of self-care. She also shared that she is now in an active phase again.",
        "pubDate": "2024-09-09 14:10:32",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.7193172574043274
    },
    {
        "title": "Gold stabilizes back inside its range after US Jobs' data - FXStreet",
        "link": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNUFpYREJhQjJtSUZ3S21rdWVFSHNZc2VCQXVnNi05UHhYS3lULUZlY0hBaXNGLXJ0aDZnbElCQUg1eVRrVmFZYzZua3JhRDNxY3VQMWp0UGhXN3BxUVZfQkdhU0g3Y1BuV0sxcVE2UDA0Nnlhajk3ZExPY2JuYTB4WEZCdjYzZmgtelM5dFNwTUVFaDZmSGl2cEJweDB6ODMyZU4wMEoyN3jSAa4BQVVfeXFMUHNEOFB3aGFhd2pZNjhRak5MbkI0OThRNERZak1zbDFjeUREeUUtUFdzdkp4OVliZWFkeElkU1NlS0htSWFtYS1yMTFWZXVWbGVLZmozM3dqVkZZSU1rY0VnRWxoLVQ3X0diSU40RnMzcDJuTXZuQnEwcDFWeGM0Nzg3VGttY1FrYXZGUVlZSndUdXR1U2M5ZmtSZWdjejV1cGRPbFVkXzlpaGlidWlR?oc=5",
        "keywords": null,
        "description": "Gold stabilizes back inside its range after US Jobs' data FXStreetGold price today: Rates rise as focus shifts to US inflation prints; experts reveal key levels for MCX Gold MintGold prices steady with spotlight on US inflation data ThePrintGold Price Forecast – Gold Continues to See Buyers FX EmpireGold price hangs near daily low amid modest USD strength, cautious market mood lends support FXStreet",
        "pubDate": "2024-09-09 14:10:32",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "business"
        ],
        "sentiment": "neutral",
        "score": 0.7545088529586792
    },
    {
        "title": "India News | Punjab Police's 'OPS Seal-VIII' Leads to Arrests and Seizures in Anti-smuggling Operation",
        "link": "https://www.latestly.com/agency-news/india-news-punjab-polices-ops-seal-viii-leads-to-arrests-and-seizures-in-anti-smuggling-operation-6253309.html",
        "keywords": null,
        "description": "Get latest articles and stories on India at LatestLY. Punjab Police on Monday carried out a special operation, 'OPS Seal-VIII,' to check vehicles entering or exiting the state border to keep tabs on drug trafficking and liquor smuggling.",
        "pubDate": "2024-09-09 14:10:28",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.9246524572372437
    },
    {
        "title": "India News | Accused in Custody in One Case Can Seek Anticipatory Bail in Another: SC",
        "link": "https://www.latestly.com/agency-news/india-news-accused-in-custody-in-one-case-can-seek-anticipatory-bail-in-another-sc-6253308.html",
        "keywords": null,
        "description": "Get latest articles and stories on India at LatestLY. The Supreme Court on Monday held that an accused, who is lodged in custody in a case, is entitled to seek anticipatory bail in another matter as long as he is not arrested in relation to that alleged offence.",
        "pubDate": "2024-09-09 14:10:24",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.9194467067718506
    },
    {
        "title": "After Elon Musk, THIS Indian likely to become 2nd Trillionaire!",
        "link": "https://odishatv.in/news/trending/after-elon-musk-not-mukesh-ambani-this-indian-gautam-adani-likely-to-become-2nd-trillionaire-243787",
        "keywords": [
            "trending"
        ],
        "description": "Elon Musk holds the title of the World's Richest Person with a net worth of $251 billion, as reported by the Bloomberg's Billionaires Index. Connect Academy predicts that if his wealth continues to soar at an average annual rate of 110 per cent, Musk could achieve Trillionaire status by 2027. According to the same report, an Indian could become the second Trillionaire if his wealth continues to increase at its current annual rate of 123 per cent. But, wait, he is not Reliance Industries Ltd (RIL)'s Chairman and Managing Director Mukesh Ambani.",
        "pubDate": "2024-09-09 14:10:09",
        "source_priority": 62016,
        "source_name": "Odisha Tv",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Latest News | Delhi's Madrasi Camp Residents Refuse to Budge Without Alternative Place as PWD Serves Eviction Notice",
        "link": "https://www.latestly.com/agency-news/latest-news-delhis-madrasi-camp-residents-refuse-to-budge-without-alternative-place-as-pwd-serves-eviction-notice-6253306.html",
        "keywords": null,
        "description": "Get latest articles and stories on Latest News at LatestLY. Faced with eviction to make way for the construction of a new flyover, residents of the Madrasi Camp are refusing to move from the Old Barapullah Bridge area, their home for over 40 years, unless they are given an alternative site.",
        "pubDate": "2024-09-09 14:10:07",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.7365988492965698
    },
    {
        "title": "Is Sheikh Hasina returning to Bangladesh? War crimes tribunal gears up to seek extradition from India",
        "link": "https://www.livemint.com/news/world/is-sheikh-hasina-returning-to-bangladesh-war-crimes-tribunal-gears-up-to-seek-extradition-from-india-11725888174653.html",
        "keywords": null,
        "description": "Sheikh Hasina resigned as prime minister and fled to India last month amidst unprecedented anti-government protests that peaked on August 5.",
        "pubDate": "2024-09-09 14:10:03",
        "source_priority": 7134,
        "source_name": "Mint",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "score": 0.6988924145698547
    },
    {
        "title": "Boeing Starliner returned to Earth without its crew. A former astronaut details what that means for NASA, Boeing and astronauts still up in space",
        "link": "https://www.newindianexpress.com/world/2024/Sep/09/boeing-starliner-returned-to-earth-without-its-crew-a-former-astronaut-details-what-that-means-for-nasa-boeing-and-astronauts-still-up-in-space",
        "keywords": [
            "world"
        ],
        "description": null,
        "pubDate": "2024-09-09 14:10:00",
        "source_priority": 15406,
        "source_name": "The New Indian Express",
        "category": [
            "world"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "City sculptor carves Ganesha idol for Maharashtra temple",
        "link": "https://starofmysore.com/city-sculptor-carves-ganesha-idol-for-maharashtra-temple/",
        "keywords": [
            "paramesh acharya",
            "lord ganesha",
            "news"
        ],
        "description": "Mysuru: A 3-feet tall idol of Lord Ganesha, carved by a city-based sculptor, is set to be consecrated at a temple in a village in Nashik district, Maharashtra. Shilpashree Award-winning sculptor Paramesh Acharya, a resident of J.P. Nagar, Mysuru, along with his sons Sandesh Acharya and Santosh Acharya, crafted the idol from Krishna Shile (black...The post City sculptor carves Ganesha idol for Maharashtra temple appeared first on Star of Mysore.",
        "pubDate": "2024-09-09 14:10:00",
        "source_priority": 409045,
        "source_name": "Star Of Mysore",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.832234799861908
    },
    {
        "title": "Rameshwaram Cafe blast: NIA chargesheets 4, says BJP office first target",
        "link": "https://www.business-standard.com/india-news/rameshwaram-cafe-blast-nia-chargesheets-4-says-bjp-office-first-target-124090900997_1.html",
        "keywords": null,
        "description": "The NIA on Monday chargesheeted four men in the Rameshwaram Cafe blast case and said the accused were involved in a \"failed IED attack\" at the Bengaluru BJP office on the day of the consecration ceremony at the Ram temple in Ayodhya.It said two of the key accused were ISIS (banned terrorist organisation Islamic State of Iraq and Syria) radicals who used fraudulently obtained \"Indian SIM cards and Indian bank accounts\" besides \"various Indian and Bangladeshi Identity documents downloaded from the dark web (which is accessible only through specialised browsers) in carrying out their nefarious activities.In a charge sheet filed before a court in Bengaluru, the National Investigation Agency (NIA) named Mussavir Hussain Shazib, Abdul Matheen Ahmed Taaha, Maaz Muneer Ahmed and Muzammil Shareef, as accused.All of them were arrested earlier and are currently in judicial custody in the case, a statement issued by the NIA said.Taaha and Shazib were funded by their handler through ...",
        "pubDate": "2024-09-09 14:09:37",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Sebi levels playing field: FVCIs subject to same governance norms as FPIs",
        "link": "https://www.business-standard.com/markets/news/sebi-levels-playing-field-fvcis-subject-to-same-governance-norms-as-fpis-124090901099_1.html",
        "keywords": [
            "markets"
        ],
        "description": "Mandates disclosure of beneficial ownership, allocates registration and monitoring responsibility to DDPs",
        "pubDate": "2024-09-09 14:09:37",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8694394826889038
    },
    {
        "title": "‘Vettaiyan’ Song ‘Manasilaayo’ Review: Rajinikanth and Manju Warrier Raise a Storm in This Electrifying Anirudh Ravichander Dance Number (Watch Lyric Video)",
        "link": "https://www.latestly.com/entertainment/south/vettaiyan-song-manasilaayo-review-rajinikanth-and-manju-warrier-raise-a-storm-in-this-electrifying-anirudh-ravichander-dance-number-watch-lyric-video-6253236.html",
        "keywords": null,
        "description": "'Vettaiyan' is directed by TJ Gnanavel of 'Jai Bhim' fame. The movie also stars Amitabh Bachchan, Fahadh Faasil, Rana Daggubati, Manju Warrier, Kishore, Ritika Singh, and Dushara Vijayan. It will release in theatres on October 10.",
        "pubDate": "2024-09-09 14:09:36",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "entertainment"
        ],
        "sentiment": "neutral",
        "score": 0.8357795476913452
    },
    {
        "title": "India vs Syria LIVE Score, Intercontinental Cup 2024: Intercontinental Cup LIVE: Horrible Start For India As Syria Score Opener - NDTV Sports",
        "link": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPbkplQVFXWFA0aTRiOWM1ZFNjMThRTGNWWTh4SEphclgyOVJhQ0s4R3kzZlNyRUY5YTVpTWhrMmlnd3pFTDl5ckZZeUJ6Ymw4SjlhUUxKLUJzZlcyZDlEVzFpamtTaHR0b2ZvNGZRbFRLSjR4OFJCUDdhRUJtaHBTbTF6X1ZySjZZbVVVM0RDYUVxaHIwMG9RVldR0gGiAUFVX3lxTE1uQ2RsTzJ6d1ZLZDVNZF9HWV9YTWFYUDkyVGF4ZUxITmpPNXZpUlJXSlN1S1F5bDg3Z2ZEbW9XaC1fTEQ3RGNYQy1SVGdIRXJ0WUpuSTg3aklzUXprTExIWnZuYnlya2RTaEx4NTJITmlPLWNHazYwV2pTVm9PYUFNV0FqWExuNFpxYmNscnB5d0RvZVluVWh4OGNRT2JOekhBUQ?oc=5",
        "keywords": null,
        "description": "India vs Syria LIVE Score, Intercontinental Cup 2024: Intercontinental Cup LIVE: Horrible Start For India As Syria Score Opener NDTV SportsRahul Bheke guarding goals with an ultimate goal in mind AIFFIntercontinental Cup: India face Syria in must-win game The Times of IndiaIndia vs Syria, Intercontinental Cup 2024 Live Score: Manolo Makes Changes | IND 0-0 SYR News18Intercontinental Cup: What happened when India last played Syria? Sportstar",
        "pubDate": "2024-09-09 14:09:35",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "sports"
        ],
        "sentiment": "negative",
        "score": 0.5131552219390869
    },
    {
        "title": "ED files FIR against Religare's Rashmi Saluja, two others in false allegations case against Burmans of Dabur group",
        "link": "https://www.livemint.com/news/india/ed-files-fir-against-religares-rashmi-saluja-two-others-in-false-allegations-case-against-burmans-of-dabur-group-11725886192606.html",
        "keywords": null,
        "description": "The Enforcement Directorate's FIR names 14 people, including REL's top officials and Burman family members, in a cheating and conspiracy case. The inquiry follows Vaibhav Gawli's complaint alleging attempts to defraud Religare Enterprises shareholders.",
        "pubDate": "2024-09-09 14:09:20",
        "source_priority": 7134,
        "source_name": "Mint",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "score": 0.6539557576179504
    },
    {
        "title": "Haryana polls: JJP, ASP alliance releases second list of 12 candidates",
        "link": "https://timesofindia.indiatimes.com/india/haryana-polls-jjp-asp-alliance-releases-second-list-of-12-candidates/articleshow/113199485.cms",
        "keywords": null,
        "description": null,
        "pubDate": "2024-09-09 14:09:12",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "food"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Israel vs Italy, UEFA Nations League 2024-25 Live Streaming and Match Time in IST: How to Watch Free Live Telecast of ISR vs ITA on TV and Online Stream Details of Football Match in India?",
        "link": "https://www.latestly.com/sports/football/israel-vs-italy-uefa-nations-league-2024-25-live-streaming-and-match-time-in-ist-how-to-watch-free-live-telecast-of-isr-vs-ita-on-tv-and-online-stream-details-of-football-match-in-india-6253279.html",
        "keywords": null,
        "description": "Luciano Spalletti and his men pulled off a sensational win over France in their last match and that would give them a lot of confidence ahead of this encounter. Read below to check viewing options for Israel vs Italy match in UEFA Nations League 2024-25.",
        "pubDate": "2024-09-09 14:09:10",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "score": 0.9433873891830444
    },
    {
        "title": "Mega human chain to mark International Day of Democracy in Yadgir on Sept. 15",
        "link": "https://www.thehindu.com/news/national/karnataka/mega-human-chain-to-mark-international-day-of-democracy-in-yadgir-on-sept-15/article68622157.ece",
        "keywords": [
            "karnataka"
        ],
        "description": null,
        "pubDate": "2024-09-09 14:09:02",
        "source_priority": 2972,
        "source_name": "The Hindu",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "Bakery gutted due to short circuit",
        "link": "https://starofmysore.com/bakery-gutted-due-to-short-circuit/",
        "keywords": [
            "vijayanagar police",
            "hootagalli",
            "news"
        ],
        "description": "Mysuru: A bakery was gutted in a fire reportedly caused by short circuit in city yesterday midnight. The fire took place at Sri Lakshmi Narasimhaswamy Bakery on Hootagalli Water Tank Road and bakery items, furniture and other items worth about Rs. 15 lakh have been destroyed. Fire was noticed in the bakery belonging to Swamy...The post Bakery gutted due to short circuit appeared first on Star of Mysore.",
        "pubDate": "2024-09-09 14:09:00",
        "source_priority": 409045,
        "source_name": "Star Of Mysore",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "score": 0.7249038815498352
    },
    {
        "title": "Khammam: Transferred Mission Bhagiratha AEs want LPCs delivered",
        "link": "https://telanganatoday.com/khammam-transferred-mission-bhagiratha-aes-want-lpcs-delivered",
        "keywords": [
            "assistant engineers",
            "last pay certificates",
            "khammam",
            "telangana",
            "mission bhagiratha ae",
            "mission bhagiratha",
            "news"
        ],
        "description": "Many of them could not draw salaries due to LPCs and service registers of the respective AEs have not been dispatched to their new station of work.",
        "pubDate": "2024-09-09 14:08:55",
        "source_priority": 63887,
        "source_name": "Telangana Today",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "score": 0.7176530957221985
    },
    {
        "title": "LDF govt. comes under pressure from within ruling front, Opposition to act against Ajith Kumar",
        "link": "https://www.thehindu.com/news/national/kerala/ldf-govt-comes-under-pressure-from-within-ruling-front-opposition-to-act-against-ajith-kumar/article68622373.ece",
        "keywords": [
            "kerala"
        ],
        "description": "Ajith Kumar has reportedly sought administrative sanction and support to hold those who raised the allegedly muckraking accusations against him legally liable if the government inquiry absolves him of wrongdoing",
        "pubDate": "2024-09-09 14:08:44",
        "source_priority": 2972,
        "source_name": "The Hindu",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.5660030245780945
    },
    {
        "title": "Viral Video: Babar Azam Behaves Rudely With Fan, Pushes Away His Hand While Posing For Picture",
        "link": "https://www.freepressjournal.in/sports/viral-video-babar-azam-behaves-rudely-with-fan-pushes-away-his-hand-while-posing-for-picture",
        "keywords": [
            "topnews",
            "dailyhunt",
            "fpj shorts",
            "sports"
        ],
        "description": null,
        "pubDate": "2024-09-09 14:08:38",
        "source_priority": 83130,
        "source_name": "The Free Press Journal",
        "category": [
            "top"
        ],
        "sentiment": "ONLY AVAILABLE IN PROFESSIONAL AND CORPORATE PLANS",
        "score": ""
    },
    {
        "title": "India News | J-K: Indian Army Neutralises Infiltration Bid in Nowshera",
        "link": "https://www.latestly.com/agency-news/india-news-j-k-indian-army-neutralises-infiltration-bid-in-nowshera-6253302.html",
        "keywords": null,
        "description": "Get latest articles and stories on India at LatestLY. A significant cache of warlike stores, including two AK-47 rifles, one M-4 rifle with sight and one pistol, was recovered",
        "pubDate": "2024-09-09 14:08:28",
        "source_priority": 31923,
        "source_name": "Latestly",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.8563395738601685
    },
    {
        "title": "Broad consensus in GST Council to cut taxes on insurance premiums, decision in next meet: Sources",
        "link": "https://munsifdaily.com/broad-consensus-in-gst-council-to-cut-taxes-on-insurance-premiums-decision-in-next-meet-sources/",
        "keywords": [
            "health insurance",
            "cut taxes on insurance premiums",
            "gst",
            "life insurence",
            "18 per cen gst",
            "india",
            "reducing gst",
            "breaking news",
            "18 per cent",
            "insurance premiums",
            "state tax official",
            "business",
            "broad consensus"
        ],
        "description": "The GST Council has arrived at a broad consensus on reducing GST on health and life insurance premiums from the current 18 per cent, but a final decision would be taken in the next meeting, sources said.",
        "pubDate": "2024-09-09 14:08:19",
        "source_priority": 1196600,
        "source_name": "The Munsif Daily",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "score": 0.9029412865638733
    }
]