[
    {
        "title": "Ctrl-Alt-Yield: Startup IPOs make a scorching comeback. But there’s a catch",
        "link": "https://www.livemint.com/market/ipo/startup-ipos-ola-electric-go-digit-firstcry-awfis-demat-account-sebi-stock-market-liquidity-diis-delhivery-india-gdp-11725963109097.html",
        "keywords": null,
        "description": "Ten new age companies have made their stock market debuts in 2024 so far, including Go Digit, Awfis and Ola Electric. Their shares have maintained momentum post listing as well. But investors must draw lessons from a lethal military formation described in the Mahabharata.",
        "pubDate": "2024-09-10 13:02:49",
        "source_priority": 7134,
        "source_name": "Mint",
        "category": [
            "business"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.5173171162605286
    },
    {
        "title": "Midcap defence stock snaps four-day losing streak on govt order win, stock up 76% in one year; Buy or sell? - Mint",
        "link": "https://news.google.com/rss/articles/CBMilgJBVV95cUxQbFFGQ0E1YXNhVXVsQ2xfdFZfaFozNU43MEtGVzNCMm1iNWtJcnFOR0RtdnpDUjB2Slh1MFZNTEMtM05PRFFGMXdsSi1RVk1VMnYwdlJZSjVuRnVpVndKNWNTVWFGdFhwYTdPSHhzMHc3VS1Ubk9DdXhFaHF6MThYcVBPaUwzd1BUV0l2SmpWbWQ1R2VxWWFDVDJYV0NyZm96QWVwNVpfbU16a0kwT1lZYjVCamk5V2kxVEZicjlTZGgtUjBpTHB3a1ozRFNtQjlQQVlVWkxfeUZSQ05iQmdvY2d4THF1U051Ukt5UXZUVUtNWXEtUHFUNmZBQ1FTRUFRMWt4eWpBQWhyb3RiMW1kYjdxQjFUUQ?oc=5",
        "keywords": null,
        "description": "Midcap defence stock snaps four-day losing streak on govt order win, stock up 76% in one year; Buy or sell? MintAction Construction Equipment shares rise over 3% on securing new order from Defence Ministry UpstoxAction Construction Equipment shares gain 3% on order from defence ministry Business Standardace bags forklifts contract from defence ministry ICICI DirectMinistry of Defence buys ACE special forklifts Construction Week Online India",
        "pubDate": "2024-09-10 13:02:37",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "business"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.7455117106437683
    },
    {
        "title": "Midcap defence stock snaps four-day losing streak on govt order win, stock up 76% in one year; Buy or sell?",
        "link": "https://www.livemint.com/market/stock-market-news/action-construction-equipment-midcap-defence-stock-snaps-four-day-losing-streak-on-govt-order-win-stock-up-76-in-1-yr-11725973175519.html",
        "keywords": null,
        "description": "Action Construction Equipment Share Price Today: Shares of the midcap defence stock snapped its four-day losing streak on Tuesday after receiving orders from the defence ministry",
        "pubDate": "2024-09-10 13:02:37",
        "source_priority": 7134,
        "source_name": "Mint",
        "category": [
            "business"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.7115152478218079
    },
    {
        "title": "Midcap defence stock snaps four-day losing streak on govt order win, stock up 76% in one year; Buy or sell? | Stock Market News - Mint",
        "link": "https://news.google.com/rss/articles/CBMilgJBVV95cUxQbFFGQ0E1YXNhVXVsQ2xfdFZfaFozNU43MEtGVzNCMm1iNWtJcnFOR0RtdnpDUjB2Slh1MFZNTEMtM05PRFFGMXdsSi1RVk1VMnYwdlJZSjVuRnVpVndKNWNTVWFGdFhwYTdPSHhzMHc3VS1Ubk9DdXhFaHF6MThYcVBPaUwzd1BUV0l2SmpWbWQ1R2VxWWFDVDJYV0NyZm96QWVwNVpfbU16a0kwT1lZYjVCamk5V2kxVEZicjlTZGgtUjBpTHB3a1ozRFNtQjlQQVlVWkxfeUZSQ05iQmdvY2d4THF1U051Ukt5UXZUVUtNWXEtUHFUNmZBQ1FTRUFRMWt4eWpBQWhyb3RiMW1kYjdxQjFUUdIBmwJBVV95cUxQbTduVU5KOVNQdTdJLXVYUFRnMjEzQVhWMGR5blRocEtTVWZ3cVNTZDdpbUhIRGFqYUlwY3NYQmhCenc3UW5MbUFqZWVCNHBpdWxCcjZsN1VYYlJUa1BlU05LSW1GTFQ2TnpteHhhQllHZ1dTdjFnWGdSNndIbFJqV2xXMmk1MDVYckN6cEJUMjA4YXRmejJCYjZEQWJ1MnU1ZTlmbE13R0d1OXNxanBqQlZVM25Oa0R5VGhQN3kzYXljOHh2eU5QZGpCWFBadGVjRWpLOHlFVXdjamlnQ1NiOHliSkd1aE1fbGlSSVVUTDJTTEZvN3p6T1lwbnZ4UmV5UFNFV2xIWE5kLTRkQ0Q0WWdzRXMzZ1B0UFJB?oc=5",
        "keywords": null,
        "description": "Midcap defence stock snaps four-day losing streak on govt order win, stock up 76% in one year; Buy or sell? | Stock Market News MintAction Construction Equipment shares rise over 3% on securing new order from Defence Ministry UpstoxAction Construction Equipment shares gain 3% on order from defence ministry Business Standardace bags forklifts contract from defence ministry ICICI DirectMinistry of Defence buys ACE special forklifts Construction Week Online India",
        "pubDate": "2024-09-10 13:02:37",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "business"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.7951599359512329
    },
    {
        "title": "Jasprit Bumrah shocked when MI describe him as medium pacer, wants immediate correction in viral old video",
        "link": "https://www.hindustantimes.com/cricket/jasprit-bumrah-shocked-when-mi-describe-him-as-medium-pacer-wants-immediate-correction-in-viral-old-video-101725971620612.html",
        "keywords": [
            "latest"
        ],
        "description": "Jasprit Bumrah is set to return in action with the first Test match against Bangladesh in Chennai, on September 19.",
        "pubDate": "2024-09-10 13:02:05",
        "source_priority": 933,
        "source_name": "Hindustan Times",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.8782138228416443
    },
    {
        "title": "Centre Simplifies Approval Norms For Telecom Licences, Wireless Equipment",
        "link": "https://www.ndtv.com/india-news/centre-simplifies-approval-norms-for-telecom-licences-wireless-equipment-6534043",
        "keywords": null,
        "description": "In cases requiring inter-ministerial consultation, the DoT will seek comments within seven days of receiving a complete application.",
        "pubDate": "2024-09-10 13:02:01",
        "source_priority": 1204,
        "source_name": "Ndtv",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.9292880296707153
    },
    {
        "title": "iPhone 16 Launch Price In India: Apple Discontinues THESE 3 Popular iPhone Models After Apple Event 2024; Details Here",
        "link": "https://zeenews.india.com/technology/iphone-16-launch-price-in-india-apple-discontinues-iphone-13-iphone-15-pro-and-iphone-15-pro-max-apple-event-2024-2791228.html",
        "keywords": null,
        "description": "iPhone 16 Launch Price In India: Earlier, the tech giant also stopped selling the iPhone 14 Pro, iPhone 14 Pro Max, and iPhone 13 Plus after the launch of the iPhone 15 series.",
        "pubDate": "2024-09-10 13:02:00",
        "source_priority": 5319,
        "source_name": "Zee News",
        "category": [
            "technology"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.8265562653541565
    },
    {
        "title": "Shamiyana As Cover, Lack Of Staff: terrible Scenes At Afg's Noida Venue",
        "link": "https://sports.ndtv.com/cricket/marriage-shamiyana-as-cover-lack-of-equipment-and-trained-groundstaff-mismanagement-at-afghanistans-noida-venue-6534037",
        "keywords": null,
        "description": "The Greater Noida Authority encountered colossal failure in not being able to get second day's play underway in the one off Test between Afghanistan and New Zealand",
        "pubDate": "2024-09-10 13:01:51",
        "source_priority": 1204,
        "source_name": "Ndtv",
        "category": [
            "sports"
        ],
        "sentiment": "negative",
        "sentiment_score": 0.8172274827957153
    },
    {
        "title": "'Aap chor dijiye..', Janhvi Kapoor REACTS angrily after seeing paparazzi push each other to click her - WATCH",
        "link": "https://newsable.asianetnews.com/entertainment/aap-chor-dijiye-janhvi-kapoor-reacts-angrily-after-seeing-paparazzi-push-each-other-to-click-her-watch-atg-sjlliq",
        "keywords": null,
        "description": "The growing frenzy of paparazzi culture in Bollywood is increasingly becoming a concern for celebrities. Many stars, including Janhvi Kapoor, have expressed frustration over the constant attention they receive. Several actors have stated that they do not inform the paparazzi about their whereabouts, yet they often find photographers waiting for them at locations where they are not allowed. Janhvi Kapoor has frequently mentioned in interviews that she never invites photographers to click her outside the gym or in other casual settings, apart from airports and film promotion events. View this post on Instagram A post shared by Varinder Chawla (@vbollywood_official) Recently, Janhvi was seen during promotions for her upcoming film \"Devara,\" but the actress appeared displeased with the paparazzi’s behavior. The photographers were seen pushing each other in an attempt to capture her, which visibly left Janhvi annoyed. Although she calmly allowed the paparazzi to take pictures as she walked to her vanity van, the chaos caused by the photographers led her to express her frustration. She reportedly asked them not to push one another before entering her van without posing further. ALSO READ: 'Devara' trailer OUT: Jr NTR, Saif Ali Khan set to have an epic show in Koratala Siva's film [WATCH] Despite this, Janhvi did take a moment before heading to the vanity van to pose briefly for the paparazzi, ensuring they got their pictures. However, the situation remained chaotic due to the intense behavior of the photographers. Janhvi Kapoor is making her debut in the South Indian film industry with \"Devara,\" starring alongside Jr. NTR from \"RRR.\" Dressed in a turquoise outfit with intricate pearlwork, Janhvi looked stunning. Her beauty and popularity often make her a prime target for paparazzi eager to capture her in their lenses.",
        "pubDate": "2024-09-10 13:01:39",
        "source_priority": 7749,
        "source_name": "Asianet Newsable",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "sentiment_score": 0.6428882479667664
    },
    {
        "title": "Manipur Drone, Missile Attacks: How Did Militants Get Arms, Expert Training? Exclusive From Intel Sources",
        "link": "https://www.news18.com/india/manipur-drone-missile-attacks-how-did-militants-get-arms-expert-training-exclusive-from-intel-sources-9046046.html",
        "keywords": [
            "india"
        ],
        "description": "“The use of drones and missiles suggests that war-like stores are available to Kuki Zo militants and uninterrupted supplies are coming from the Myanmar border. These groups have got training possibly from Myanmar Kuki Chin to make these sophisticated weapons,\" said top intel sources",
        "pubDate": "2024-09-10 13:01:32",
        "source_priority": 6644,
        "source_name": "News 18",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.8417910933494568
    },
    {
        "title": "J&K: IAF Wing Commander Faces Rape Charge As Female Officer Files Complaint, Kashmir Police Launch Probe",
        "link": "https://news.abplive.com/news/india/jammu-kashmir-iaf-wing-commander-faces-rape-charge-female-officer-files-complaint-kashmir-police-launch-probe-into-fir-1716369",
        "keywords": [
            "india"
        ],
        "description": "The Jammu and Kashmir Police have registered a First Information Report (FIR) after a female Flying Officer accused a Wing Commander of the Air Force Station in Srinagar of sexual assault. The FIR has been lodged against the Wing Commander at the Budgam Police Station under Section 376(2) of the Bharatiya Nyaya Sanhita, which deals with aggravated rape by persons in positions of authority.The female Flying Officer alleged that the Wing Commander sexually assaulted her in his room during a New Year's party held at the Officers' Mess on December 31, 2023. She recounted the events of the night, stating that the assault occurred at around 2:00 AM on January 1, 2024, after Wing Commander allegedly took her to his room under the guise of giving her a gift. Once there, the Wing Commander allegedly molested her. \"I repeatedly asked him to stop and tried to resist in all ways possible. Finally, I pushed him and ran away,\" she stated.Following the incident, she said she was in shock and unsure of how to proceed, fearing further repercussions if she reported the crime. \"I was afraid and didn't know what to do as there were instances before where I was discouraged from reporting. He visited my office after the incident, behaving as if nothing happened, without any sign of remorse,\" she recounted.She confided in two other female officers, who advised her to file a formal complaint.The Flying Officer further narrated her struggles to submit a complaint and alleged mishandling of the investigation by the Internal Committee. Following her complaint, a Colonel-rank officer was assigned to investigate. She claimed that the accused Wing Commander was made to sit with her twice in January to record statements in violation of standard protocols. She said she objected to his presence, and the investigation was later closed, allegedly to \"hide mistakes of the administration.\"The Flying Officer then filed a fresh application to the internal committee, which convened two months later. \"The internal committee did not perform its duties properly, as directions had come from higher authorities to keep the results neutral. Everyone was aiding the sexual offender,\" she alleged.Despite her insistence, no medical examination was conducted until much later, the victim claimed.Her requests for interim relief, leave, or a different posting for either herself or the Wing Commander were allegedly denied. \"I am forced to socialise with these people and attend events with my abuser,\" she claimed in her complaint.The internal committee ultimately deemed the case inconclusive due to the lack of eyewitnesses and closed its investigation in May. \"Isn't it common sense that someone would not commit sexual assault in front of a witness?\" she questioned.The Flying Officer has also reported \"continuous mental harassment\" and \"social boycott,\" with her personal communications being unofficially monitored. \"The individuals I speak with are harassed by the authorities,\" she said.The female offer stated that the harassment severely affected her mental health, leading her to experience suicidal thoughts. \"I am living in constant fear, under 24/7 scrutiny, and my social life has been completely disrupted. The harassment has driven me to suicidal thoughts, and I feel utterly helpless. I am unable to carry on with my daily life, and my social interactions are closely monitored and discouraged by authorities. I have endured this torture for too long, and I am at my breaking point,\" she expressed in her complaint.She has urged the police to take immediate action and ensure that justice is served, naming several senior officers as complicit in her harassment.ALSO READ | 'Justice Hema Committee Formed As Left Is In Power': Kerala CM Responds After HC Raps 'Inaction'IAF Says Cooperating With Probe Into CaseThe Indian Air Force has acknowledged the case and confirmed its cooperation with local authorities. \"We are aware of the case. Local Police PS Budgam has approached on the subject. We are completely cooperating towards the case,\" an IAF spokesperson told ABP Live.An Inspector-rank officer from the Budgam Police Station has been assigned to oversee the investigation of this case.",
        "pubDate": "2024-09-10 13:01:25",
        "source_priority": 10959,
        "source_name": "Abp News",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.5179142951965332
    },
    {
        "title": "'Forced To Perform Oral Sex’: IAF Flying Officer Accuses Wing Commander Of Rape, Complaint Filed",
        "link": "https://www.news18.com/india/iaf-flying-officer-accuses-wing-commander-of-rape-harassment-complaint-filed-9046149.html",
        "keywords": [
            "india"
        ],
        "description": "In a statement, the IAF said the Budgam Police Station approached the concerned Air Force station for the investigation. The IAF is cooperating in the investigation.",
        "pubDate": "2024-09-10 13:01:19",
        "source_priority": 6644,
        "source_name": "News 18",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.8959732055664062
    },
    {
        "title": "More Details On iOS 18 Release Candidate",
        "link": "https://www.geeky-gadgets.com/more-details-on-ios-18-release-candidate/",
        "keywords": [
            "apple iphone",
            "apple",
            "top news"
        ],
        "description": "Apple has recently released the highly anticipated iOS 18 Release Candidate (RC) for beta testers, marking a significant milestone in the development of their latest mobile operating system. Along with iOS 18, the company has also rolled out RC builds for iPadOS 18, watchOS 11, macOS Sequoia, tvOS 18, and visionOS 2. The official launch [...]The post More Details On iOS 18 Release Candidate appeared first on Geeky Gadgets.",
        "pubDate": "2024-09-10 13:01:19",
        "source_priority": 19907,
        "source_name": "Geeky-gadgets",
        "category": [
            "technology"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.9366683959960938
    },
    {
        "title": "Is Mpox as lethal as smallpox? | Health Wealth, Ep 59 - India Today",
        "link": "https://news.google.com/rss/articles/CCAiCzBQMXlUVVhobDVrmAEB?oc=5",
        "keywords": null,
        "description": "Is Mpox as lethal as smallpox? | Health Wealth, Ep 59 India TodayView Full coverage on Google News",
        "pubDate": "2024-09-10 13:01:12",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "health"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.7842475771903992
    },
    {
        "title": "NSUI launches Campus Gate meet to address students’ woes",
        "link": "https://timesofindia.indiatimes.com/city/mangaluru/nsui-launches-campus-gate-meet-to-address-students-woes/articleshow/113231727.cms",
        "keywords": null,
        "description": null,
        "pubDate": "2024-09-10 13:00:56",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "",
        "sentiment_score": ""
    },
    {
        "title": "Round 3 of Indian Racing Festival 2024 shifts to Madras International Circuit from Coimbatore’s Kari Motor Speedway",
        "link": "https://sportstar.thehindu.com/motorsport/indian-racing-festival-returns-to-madras-international-circuit-fir-round-3-of-irl-formula-4-indian-championship/article68626244.ece",
        "keywords": [
            "motorsport"
        ],
        "description": "Following the success of the inaugural night street circuit race in Chennai, the MIC will once again host the event on September 14 and 15.",
        "pubDate": "2024-09-10 13:00:25",
        "source_priority": 2972,
        "source_name": "Sport Star The Hindu",
        "category": [
            "sports"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.7563955187797546
    },
    {
        "title": "Maximising Your Earnings: How Compounding Fixed Deposits Can Grow Your Wealth",
        "link": "https://news.abplive.com/business/personal-finance/maximising-your-earnings-how-compounding-fixed-deposits-can-grow-your-wealth-1716379",
        "keywords": [
            "personal finance"
        ],
        "description": "Fixed deposits (FDs) have long been a popular choice amongst investors for offering assured returns and safety from market volatility. Among the different types of FDs available today, compounding FDs are an attractive option that offers higher returns with the power of compound interest. Let’s understand how they work and what benefits they offer to investors looking to grow their investments.How Does a Compounding FD Work?In the case of a compounding fixed deposit, the interest earned is periodically added to the principal instead of being paid out, which is known as the compounding effect. The interest typically compounds on a quarterly or annual basis. Over time, you earn interest not only on the original principal but also on interest accumulated from the past. As a result, your investment grows faster as compared to a simple interest FD, where interest is calculated solely on the initial principal.For instance, you invest Rs 1,00,000 in a compounding FD with a 7 per cent interest rate, compounded quarterly. Interest for the first quarter will be calculated on the initial deposit of Rs 1,00,000. In the next quarter, interest will be calculated on Rs 1,01,750 (principal plus interest from the first quarter), and this process continues. With compounding, your investment can grow exponentially, especially over a longer tenure as interest is earned on both the principal and accumulated interest.Benefits of Compounding FDsHigher returns: One of key advantages of a compounding FD is the potential for higher returns due to compound interest. It allows you the chance to grow your savings faster than a simple interest FD would.Safety and stability: Fixed deposits are one of the safest investment options available. Offering guaranteed returns and zero market risk, they are ideal for conservative investors or those looking to balance their portfolio.Flexible tenures: Compounding FDs are available for a variety of tenures, allowing you to choose a tenure that aligns with your short-term or long-term financial goals.Reinvestment opportunities: At the end of your FD tenure, you can reinvest the maturity amount in another compounding FD, further boosting your wealth-building efforts.Tax ImplicationsThe interest earned on fixed deposits is considered taxable income under the Income Tax Act. It is added to your total income and taxed according to your applicable income tax slab rate. However, FDs with a 5-year lock-in period qualify for tax benefits under Section 80C of the Income Tax Act. The amount invested in such FDs is eligible for a deduction up to Rs 1.5 lakh per annum. But the interest earned on these FDs is still taxable.If you withdraw the FD before its maturity, banks usually impose a penalty, such as lowering the interest rate of the FD. The tax treatment remains the same, with TDS deducted as applicable. When filing your taxes, remember to declare the interest income from FDs under ‘Income from Other Sources.’ Also ensure that the TDS deducted by the bank is accounted for when filing your returns. If TDS has been deducted but your total taxable income falls below the taxable threshold, you can claim a refund for the excess TDS paid.Compounding FDs are a powerful investment tool that can boost your returns by leveraging the benefits of compound interest. The key lies in understanding how it works so you can choose the right FD to meet your short or long-term goals. The author is the AGM Communication at Bankbazaar.com. This article has been published as part of a special arrangement with BankBazaar.",
        "pubDate": "2024-09-10 13:00:23",
        "source_priority": 10959,
        "source_name": "Abp News",
        "category": [
            "business"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.7168973088264465
    },
    {
        "title": "Nomura Says India’s GDP In FY25 To Grow At A Lower Pace Than RBI's Projections",
        "link": "https://news.abplive.com/business/gdp-growth-rate-india-economic-estimate-fy25-rbi-nomura-rural-demand-auto-sales-1716380",
        "keywords": [
            "business"
        ],
        "description": "India’s gross domestic product (GDP) is expected to grow at 6.7 per cent in the 2024-25 fiscal year (FY25) on a year-on-year (YoY) basis, the latest report by Nomura revealed. The brokerage’s estimate places India’s economic growth 50 basis points (bps) lower than the Reserve Bank of India’s (RBI’s) expectations for the current fiscal year. The RBI earlier gave a GDP growth estimate of 7.2 per cent for FY25. The analysts at the brokerage noted that they expect a downside risk to the growth projections of 7.2 per cent for the 2025-26 financial year (FY26), reported Moneycontrol.The report tracked the growth in auto sales, including passenger vehicles (PVs), and medium and heavy commercial vehicles (MHCVs), and found that the figures for July and August both were ‘disappointing’.“Growth signals are currently mixed. Catch-up in government spending and rural demand are positives, but softness in consumer discretionary demand, industrial demand and external demand are negatives,” the report noted.Also Read : PAN Card-Based KYC: Online & Offline Methods To Required Documents; Everything You Need to Know“To gauge cyclical growth, we have found that sales of passenger vehicles (PV) and medium and heavy commercial vehicles (MHCV) are important. PVs signal discretionary consumer demand, while MHCV sales have a high beta to overall industrial activity,” the report added. The brokerage analysed the vehicle sales to oversee cyclical growth and highlighted that the statistics showed a slump. Nomura further stated that the net GDP growth is set to dampen to 6.7 per cent on a YoY basis in FY25, slipping below the RBI’s projection of 7.2 per cent. \"PV and MHCV sales both disappointed in July and August. Wholesale PV sales growth fell to -2.0 per cent YoY in July and -2.5 per cent in August, while MHCV sales growth declined to -7.1 per cent and -10.7 per cent, respectively. Inventories for PVs have risen from 55-60 days in May to 70-75 days in August, with hopes now pinned on the festive season,\" the brokerage noted.",
        "pubDate": "2024-09-10 13:00:20",
        "source_priority": 10959,
        "source_name": "Abp News",
        "category": [
            "business"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.7571566104888916
    },
    {
        "title": "Century Textiles buys Nusli Wadia's land parcel worth Rs 1,100 cr in Worli",
        "link": "https://www.business-standard.com/companies/news/century-textiles-buys-nusli-wadia-s-land-parcel-worth-rs-1-100-cr-in-worli-124091001077_1.html",
        "keywords": null,
        "description": "Birla Estates, a real estate subsidiary of Century Textiles and Industries, will develop the land",
        "pubDate": "2024-09-10 13:00:15",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.7957477569580078
    },
    {
        "title": "Honda Electric Activa To Be Launched In March 2025, Expected Price Here - Electric Vehicle Info",
        "link": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5GQmo5VU9FUWptWDBUQl9QaWc1bEpzVXhUbmJCTklZRHNUbGlabkVhZnJ6bGVma2d1NmF6YkNqakxzNDNnYlZmWWU3eFJlbF9yVlY4aGJKQ2RxYUtKMzBBd0xvVHNvV1hwSEpTdk9LUWhBejFpQzhJRzVB?oc=5",
        "keywords": null,
        "description": "Honda Electric Activa To Be Launched In March 2025, Expected Price Here Electric Vehicle InfoExclusive: Honda Activa EV Launch Date CONFIRMED, Arriving By March 2025 NDTV‘Rural market for two-wheelers not growing as expected’ BusinessLineOpinion: Where’s the Honda Activa electric? BikeWaleHonda Activa EV To Debut In Dec 2024, Deliveries Early Next Year - Report GaadiWaadi.com",
        "pubDate": "2024-09-10 13:00:07",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "business"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.9077708721160889
    },
    {
        "title": "Congress accuses PM Modi of allowing Manipur to 'go up in flames'",
        "link": "https://www.business-standard.com/politics/congress-accuses-pm-modi-of-allowing-manipur-to-go-up-in-flames-124091001040_1.html",
        "keywords": null,
        "description": "Slamming Prime Minister Narendra Modi over the situation in Manipur, Congress Tuesday alleged he allowed the state to \"go up in flames\" and said he travels all over the globe engaging in \"huglomacy\" but cannot find time to visit the violence-hit state.Congress general secretary in-charge communications Jairam Ramesh said democracy is a tall order and the rule of law itself has fallen apart in the state.\"Here is the non-biological PM telling the people of Manipur that he will do in 15 months what the Congress couldn't do in 15 years,\" Ramesh said and shared a video of the prime minister speaking at a rally.\"Indeed. Within 15 months of getting a decisive mandate from all sections of Manipur's society, he allowed the state to go up in flames,\" Ramesh said.\"It is still burning with no respite in sight. The Supreme Court has declared that there is a breakdown of the constitutional machinery in the state. Yet Mr Narendra Modi is unmoved,\" he said in a post on X.The prime minister",
        "pubDate": "2024-09-10 12:59:53",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "politics"
        ],
        "sentiment": "negative",
        "sentiment_score": 0.7089000940322876
    },
    {
        "title": "Kushwaha in favour of caste census, attacks Collegium system in judiciary as non-inclusive",
        "link": "https://www.thehindu.com/news/national/kushwaha-in-favour-of-caste-census-attacks-collegium-system-in-judiciary-as-non-inclusive/article68626004.ece",
        "keywords": [
            "india"
        ],
        "description": "‘We are a democracy but it’s an irony that one of the biggest institutions, the judiciary, does not have a democratic system for appointing judges,’ the newly sworn-in Rajya Sabha MP said",
        "pubDate": "2024-09-10 12:59:39",
        "source_priority": 2972,
        "source_name": "The Hindu",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.5002865791320801
    },
    {
        "title": "Pro Kabaddi League 2024: Full schedule, timings and live streaming (IST)",
        "link": "https://www.business-standard.com/sports/pro-kabaddi-league/pro-kabaddi-league-2024-full-schedule-timings-and-live-streaming-ist-124091000798_1.html",
        "keywords": null,
        "description": "Pro Kabaddi League (PKL) 2024 kicks off on October 18 in Hyderabad with 132 matches across three venues. Catch all the action live on Star Sports and Disney+ Hotstar",
        "pubDate": "2024-09-10 12:59:19",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "sports"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.8595686554908752
    },
    {
        "title": "Govt studies linking vehicle scrapping policy to pollution levels, not age",
        "link": "https://www.business-standard.com/industry/auto/govt-studies-linking-vehicle-scrapping-policy-to-pollution-levels-not-age-124091001083_1.html",
        "keywords": null,
        "description": "Highway Secretary Anurag Jain said that pollution certificates need to be trustworthy",
        "pubDate": "2024-09-10 12:59:18",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "business"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.883898913860321
    },
    {
        "title": "Hema Panel Report: Kerala HC Rebukes Vijayan Government For Delay",
        "link": "https://zeenews.india.com/people/hema-panel-report-kerala-hc-rebukes-vijayan-government-for-delay-2791231.html",
        "keywords": null,
        "description": "The Kerala High Court rebuked the state government for failing to act on the 2019 Justice K Hema Committee report on sexual abuse in the Malayalam film industry.",
        "pubDate": "2024-09-10 12:59:00",
        "source_priority": 5319,
        "source_name": "Zee News",
        "category": [
            "entertainment"
        ],
        "sentiment": "negative",
        "sentiment_score": 0.6866055727005005
    },
    {
        "title": "Research should find localised solutions as per Indian needs: PM Modi",
        "link": "https://www.hindustantimes.com/india-news/research-should-find-localised-solutions-as-per-indian-needs-pm-modi-101725973132799.html",
        "keywords": [
            "latest"
        ],
        "description": "Prime Minister Narendra Modi said there is a need to identify and remove obstacles in the research ecosystem of the country",
        "pubDate": "2024-09-10 12:58:52",
        "source_priority": 933,
        "source_name": "Hindustan Times",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.8098009824752808
    },
    {
        "title": "Research should find localised solutions as per Indian needs: PM Modi - Hindustan Times",
        "link": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQcFpxUExLTW42MnBkNUV1Z1l3ampsY0ZzN3lxSEZnR0RMcEcxcGVOc29NcENVSVZsN05sYmR0dUZOWlI1bEpOSmNqWk02d3ExeGZQRENNWFhIMWlaRXNKTEhONWRFM2txRTlURlVhMmlmZURRdDdDS3ZFUmo5UnI0aVRhT0dyaWpxYTRDUEZkT0NFQ2tKeDVwU2RISkpOVW5sMHI2aXFBSURCS09tTkVid3NMdDNsSlR6SGRCdlFkLURNUFM1RFRsTGVSa9IB0AFBVV95cUxPUHhhVUxlYXlwZEFUXzNyQmNyOUM1OEh4ZEdjVXJTNjZJVGh2TGlfSzVrUjZCLWstNU5GSHRFclhXN1FGRkNRZWlnX2FDak1mUHgtWm1xTUFUT1ExQ2YyLUoxMS1lWTg2WEIwQ2VyLU5DZ0pfRUZQWC0wcE5WODBiWE9ESzlXaDNLVVB1QjJkQWFNdEZyZ2lnSkVzd0JDVFJSZmFVdTR0YmJQenIzUDhVbG5xdGNKT19tWHJrd2JidDR0Z0xrVUxXZVdhNzFRSjha?oc=5",
        "keywords": null,
        "description": "Research should find localised solutions as per Indian needs: PM Modi Hindustan TimesThe Anusandhan National Research Foundation aims to make India a knowledge-driven economy The Indian ExpressGovt mulls mentorship of low-ranked varsity faculty by retired professors from top institutes The Economic Times'Ease of doing research' mechanism soon, Centre says after ANRF board meeting Deccan HeraldPM Modi emphasizes need to identify, remove obstacles in research ecosystem The Times of India",
        "pubDate": "2024-09-10 12:58:52",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.6142197847366333
    },
    {
        "title": "Kolkata rape-murder horror: Doctors defy SC's order to resume work, continue to protest",
        "link": "https://newsable.asianetnews.com/india/kolkata-rape-murder-horror-doctors-defy-suprme-court-order-to-resume-work-continue-protest-vkp-sjlldz",
        "keywords": null,
        "description": "Junior doctors in Kolkata have refused to comply with the Supreme Court's directive to resume duties by 5 PM on Tuesday, as they continue their protest demanding justice for the rape and murder of a post-graduate trainee doctor. The protest, which started on August 9, followed the discovery of the victim’s body in the seminar room of RG Kar Medical College and Hospital. Despite the Supreme Court's request for the protesting doctors to resume work by the given deadline, the junior doctors remain firm in their decision to continue the \"cease work\" protest until their demands are addressed. One of the primary demands includes the removal of senior officials, including the Kolkata Police Commissioner, the Health Secretary, the Director of Health Services, and the Director of Medical Education. Justice for RG Kar banners surface during India's heartbreaking 0-3 Intercontinental Cup loss to Syria (WATCH) One of the protesting doctors stated, \"We will not return to work until our demands are met. The state government was expected to remove the named officials by 5 PM, but no action has been taken, so the protest continues. However, we are open to dialogue.\" On Monday, the Supreme Court urged the doctors to return to their duties, ensuring that no adverse actions, such as punitive transfers, would be taken against them. This assurance came after the West Bengal government confirmed that no disciplinary action would be enforced if the doctors resumed work. The protests have drawn significant attention, as the junior doctors are determined to continue their strike until their demands are fully addressed. They seek accountability and justice for the deceased trainee doctor and have called for stronger action from the authorities. Kolkata rape-murder horror: 'CM is lying...' Victim's mother accuses Mamata of lying about compensation offer The cease-work movement, which began on August 9, has now entered a critical phase as the healthcare sector in Kolkata remains crippled, with junior doctors standing firm in their demand for change. The situation continues to evolve as discussions between the government and the protesting doctors remain on the table.",
        "pubDate": "2024-09-10 12:58:48",
        "source_priority": 7749,
        "source_name": "Asianet Newsable",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "sentiment_score": 0.6903122067451477
    },
    {
        "title": "War 2: Hrithik Roshan-Kiara Advani rumoured to shoot a romantic song in Italy’s Venice and Lake Como? Here’s what reports say",
        "link": "https://www.india.com/entertainment/war-2-hrithik-roshan-kiara-advani-rumoured-to-shoot-a-romantic-song-in-italys-venice-and-lake-como-heres-what-reports-say-7234423/",
        "keywords": [
            "entertainment",
            "hrithik roshan",
            "kiara advani",
            "war 2",
            "war 2 hrithik roshan kiara advani"
        ],
        "description": "The latest buzz surrounding War 2 starring Hrithik Roshan and Kiara Advani is set to see the duo enact a romantic scene in the breathtaking visuals of Venice and Lake Como in Italy.",
        "pubDate": "2024-09-10 12:58:41",
        "source_priority": 8067,
        "source_name": "India",
        "category": [
            "entertainment"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.5994634032249451
    },
    {
        "title": "Chief Minister’s Trophy sports events begin in southern districts",
        "link": "https://www.thehindu.com/news/cities/Madurai/chief-ministers-trophy-sports-events-begin-in-southern-districts/article68625927.ece",
        "keywords": [
            "madurai"
        ],
        "description": null,
        "pubDate": "2024-09-10 12:58:38",
        "source_priority": 2972,
        "source_name": "The Hindu",
        "category": [
            "top"
        ],
        "sentiment": "",
        "sentiment_score": ""
    },
    {
        "title": "Dr Reddy's, Pidilite, Mahindra Group clarify on engagement with Agora Advisory's Dhaval Buch - Moneycontrol",
        "link": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNQVY2cjg1aUp0RGxKYlZXTk9iVE90N2ZldmhmSzU3R1oxTTV4dndLU3ZMNEg2WTlsR1FaY3g3QlRRaHhuTnVfUURrcGc4Qk9RV0g0MXFXYU5sbFpBT1FGNHBkYktfRDdLck1DMnlqSDk5Q1VwSjZuX29PZVFEMm41dVZDTy1YR2x2WDI0VnBLZUFXN255SWRlM0N3WWZybnc?oc=5",
        "keywords": null,
        "description": "Dr Reddy's, Pidilite, Mahindra Group clarify on engagement with Agora Advisory's Dhaval Buch MoneycontrolMahindra clarifies after Congress’s ‘payments to Sebi chief’s husband’ charge India TodayDr Reddy denies Congress’ claim of conflict in payments to SEBI chief Madhabi Buch’s husband Dhaval MintDr Reddy's issues clarification after Congress alleges company benefited from Dhaval Buch connection, term The Economic TimesM&M, DRL, Pidilite, ICICI Bank: Stocks unfazed amid allegations of links with Sebi Chief’s advisory firm Business Today",
        "pubDate": "2024-09-10 12:58:34",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "business"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.8950490951538086
    },
    {
        "title": "10 Best IFB Microwave Ovens: Bake, Grill and Reheat Effortlessly",
        "link": "https://economictimes.indiatimes.com/top-trending-products/kitchen-dining/microwave/best-ifb-microwave-ovens/articleshow/113237577.cms",
        "keywords": null,
        "description": "Microwave ovens can prove to be a great investment for your kitchen, as they not only simplify the process of cooking, but also let you test your cooking skills by experimenting with different recipes and cuisines. In today's article we have curated a list of 10 best IFB microwave ovens, along with their salient features and other important information to help you choose the best one.",
        "pubDate": "2024-09-10 12:58:31",
        "source_priority": 231,
        "source_name": "The Economic Times",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.9394435286521912
    },
    {
        "title": "7 Must-Try Features Coming to Your iPhone With iOS 18",
        "link": "https://www.pcmag.com/news/best-apple-ios-18-features-to-try",
        "keywords": null,
        "description": "If you've been waiting for a way to schedule your Messages or want to give your home screen a colorful makeover, you're in luck: Apple's iOS 18 launches on Sept. 16.",
        "pubDate": "2024-09-10 12:58:20",
        "source_priority": 439,
        "source_name": "Pcmag",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.9224514365196228
    },
    {
        "title": "'Wish for Him to Score 1000 Goals': Louis Saha on Cristiano Ronaldo's Record-Breaking Run",
        "link": "https://www.news18.com/football/wish-for-him-to-score-1000-goals-louis-saha-on-cristiano-ronaldos-record-breaking-run-9046042.html",
        "keywords": [
            "football"
        ],
        "description": "Cristiano Ronaldo recently became the first man to score 900 career goals as Louis Saha feels he can score more.",
        "pubDate": "2024-09-10 12:58:15",
        "source_priority": 6644,
        "source_name": "News 18",
        "category": [
            "sports"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.7049331665039062
    },
    {
        "title": "Atishi: GST Council’s Decision Not To Tax Research Grants A Big Step Towards Development",
        "link": "https://www.businesstoday.in/bt-tv/short-video/atishi-gst-councils-decision-not-to-tax-research-grants-a-big-step-towards-development-445328-2024-09-10",
        "keywords": null,
        "description": "Atishi: GST Council’s Decision Not To Tax Research Grants A Big Step Towards Development",
        "pubDate": "2024-09-10 12:58:08",
        "source_priority": 9735,
        "source_name": "Business News India",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.7545038461685181
    },
    {
        "title": "Global Warming Impacting Antarctic? Sea Ice Falls To New Record Low For Winter, Finds Australian Scientists - Zee News",
        "link": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxQVEc3Z3JrZWM3ZVJQTUFwUnNFUlVrMWZFeTlPaXZKeGJJbnIyM3ByUmFmdmc2NFRVMHJiTTJ4dWxYaXUzOWZVQU5mYnBORjlvZkpxTEl6cUJWaVNLZVJfWWp1dTJacWNtcWhfcjY4MkhHMFEzMTlUYXZmNzVtMzNCeFREQTJVNmZnN1lIc0taZGJtWkVXWTNhem9OLXpoNUM1TWtZZWFMVVhiZW9CZ3F0bzJKU0tZaGxMbjZNcVItaGtLSmU1UkoyYW9KVnpDYzRXRHljcTg5VVNnVnMxeTlGbkxpQmzSAeoBQVVfeXFMT3AtRFIxc3dsV1BJVnN1bFpCSEZtb0t0ODdsUTEtenFvcTZwRUVRVzEwT0k5X3VqbFRveUoxNWFrRXlvYkhfUGRoWTZ2dmhBbnU1RkZoenBSS256Z1hTR0tkazB2b2QtZ3plQUFmWXp5MWlmcTNSbjVZaklxM2JyMkpqRXdmeUdnZzF0ZnNaTmU5aWlHRnZJcjVZTVo2TUJBZW1mUFJwUlZvcHFSWGQzQTZLbzZYNU5LYU5LWTV6emNmQXFNRkpST3k4dGVqek9XSHEtQkJ2ZU9QVjBkS3Z0Ukd2RHplWlRIbXRR?oc=5",
        "keywords": null,
        "description": "Global Warming Impacting Antarctic? Sea Ice Falls To New Record Low For Winter, Finds Australian Scientists Zee News‘Two incredible extreme events’: Antarctic sea ice on cusp of record winter low for second year running The GuardianAntarctic sea ice falls to new record low for winter: Australian scientists ap7am",
        "pubDate": "2024-09-10 12:57:37",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "science"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.5828972458839417
    },
    {
        "title": "Hardik Pandya Starts Preparations For T20I Series Against Bangladesh - See Pics",
        "link": "https://www.news18.com/cricket/hardik-pandya-starts-preparations-for-t20i-series-against-bangladesh-see-pics-9046139.html",
        "keywords": [
            "cricket"
        ],
        "description": "India will face Bangladesh in a three-match T20I series next month. The series opener is scheduled to take place in Gwalior on October 6, and the next two matches will be played in Delhi and Hyderabad.",
        "pubDate": "2024-09-10 12:57:25",
        "source_priority": 6644,
        "source_name": "News 18",
        "category": [
            "sports"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.9246997237205505
    },
    {
        "title": "Evening brief: Congress chief Kharge accuses PM Modi of ‘undermining’ SEBI; RG Kar's notice to doctors, and more news",
        "link": "https://www.hindustantimes.com/india-news/evening-brief-congress-chief-kharge-accuses-pm-modi-of-undermining-sebi-rg-kars-notice-to-doctors-and-more-news-101725970697198.html",
        "keywords": [
            "india-news"
        ],
        "description": "A shortlist of the biggest headlines, recommended stories, and a special collection of news items that you should check out.v",
        "pubDate": "2024-09-10 12:57:20",
        "source_priority": 933,
        "source_name": "Hindustan Times",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.7909368276596069
    },
    {
        "title": "Global Warming Impacting Antarctic? Sea Ice Falls To New Record Low For Winter, Finds Australian Scientists",
        "link": "https://zeenews.india.com/world/global-warming-impacting-antarctic-sea-ice-falls-to-new-record-low-for-winter-finds-australian-scientists-2791229.html",
        "keywords": null,
        "description": "Scientists say that the past two years have been the warmest on record for the planet, with global temperatures more than 1.5 degrees Celsius above preindustrial for extended periods. This global warmth is now reflected in the oceans around the Antarctic.",
        "pubDate": "2024-09-10 12:57:00",
        "source_priority": 5319,
        "source_name": "Zee News",
        "category": [
            "world"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.8839613795280457
    },
    {
        "title": "Kangana Ranaut sells Bandra bungalow that garnered controversy in 2020 for Rs 32 crore - Deccan Herald",
        "link": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxQZEZtMnJsbTNHdEkwbDFUclFZZEo2cDUwYjVGR2JONVo1ZWk1RDJGbEl3SFl4blRPaUhWa0ljeUpQSmd6N2Fhb3ZSSzcydFJyTldPeVNlYU1UeWxwUy1FelUxQlF6cmNxTkdhUDVzSWdwc1gwa19sYzFvZDdaUTVsaERsTzVKMVNPS25TNnZEYU53MjQwQzFMUUJpUjNpTWpFNFI2aWtHVkQ5NmYwMURuTDFoRU00Qk8wLWNSTjlVcE1xenFrYXBWLVVwSGIxdDFyc3lESERmbUk?oc=5",
        "keywords": null,
        "description": "Kangana Ranaut sells Bandra bungalow that garnered controversy in 2020 for Rs 32 crore Deccan Herald4 years since BMC razing, Kangana Ranaut sells Pali Hill house for Rs 32 crore The Times of IndiaKangana Ranaut sells Mumbai's Pali Hill bungalow for Rs 32 crore India TodayKangana Ranaut sells Bandra bungalow for Rs 32 crore The Indian ExpressKangana Ranaut sells bungalow in Mumbai’s Bandra west to Hyderabad company for Rs 32 crore The Economic Times",
        "pubDate": "2024-09-10 12:56:58",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "entertainment"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.8889574408531189
    },
    {
        "title": "These equity mutual funds receive inflows in August. Here’s the breakup",
        "link": "https://economictimes.indiatimes.com/mf/analysis/these-equity-mutual-funds-receive-inflows-in-august-heres-the-breakup/slideshow/113231772.cms",
        "keywords": null,
        "description": "Equity mutual fund inflows rose by 3% month-on-month, reaching Rs 38,239 crore in August, up from Rs 37,113 crore in July.",
        "pubDate": "2024-09-10 12:56:47",
        "source_priority": 231,
        "source_name": "The Economic Times",
        "category": [
            "business"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.8616591691970825
    },
    {
        "title": "HMSI eyes one-third of sales from EVs by 2030",
        "link": "https://economictimes.indiatimes.com/industry/renewables/honda-motorcycle-aiming-for-one-third-of-sales-from-evs-by-2030/articleshow/113231547.cms",
        "keywords": null,
        "description": null,
        "pubDate": "2024-09-10 12:56:14",
        "source_priority": 231,
        "source_name": "The Economic Times",
        "category": [
            "top"
        ],
        "sentiment": "",
        "sentiment_score": ""
    },
    {
        "title": "Haryana Politics: Congress Faces Setback As Leader Jawahar Lal Joins AAP | ABP Live",
        "link": "https://news.abplive.com/videos/news/india-haryana-politics-congress-faces-setback-as-leader-jawahar-lal-joins-aap-abp-live-1716381",
        "keywords": [
            "india"
        ],
        "description": "In Haryana, Congress has faced a significant setback as leader Jawahar Lal has joined the Aam Aadmi Party (AAP). Jawahar Lal, who had previously contested elections on a BJP ticket, represents a notable loss for Congress. Dr. Sushil Gupta, the state president of Aam Aadmi Party, welcomed Lal, marking a strategic shift in the political landscape. This move intensifies the ongoing political tensions in the region. Lal, a prominent figure from Bawal, is expected to strengthen AAP’s position in Haryana, challenging Congress's influence and impacting the dynamics of upcoming elections. This defection highlights a strategic realignment in Haryana's political arena.",
        "pubDate": "2024-09-10 12:56:12",
        "source_priority": 10959,
        "source_name": "Abp News",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.6824645400047302
    },
    {
        "title": "‘Haath jod kar maafi maang rahe the’: Tejashwi Yadav on Nitish Kumar",
        "link": "https://www.hindustantimes.com/india-news/haath-jod-kar-maafi-maang-rahe-the-tejashwi-yadav-on-nitish-kumar-101725970893720.html",
        "keywords": [
            "india-news"
        ],
        "description": "RJD leader Tejashwi Yadav ruled out all future alliances with Nitish Kumar-led Janata Dal (United)",
        "pubDate": "2024-09-10 12:55:24",
        "source_priority": 933,
        "source_name": "Hindustan Times",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.9010508060455322
    },
    {
        "title": "‘Haath jod kar maafi maang rahe the’: Tejashwi Yadav on Nitish Kumar - Hindustan Times",
        "link": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQVWJIWGc0QUZwN2QweGo3LXRaRUFpWkVVQWdqV2V6d1FTTUd4SDVMTUlCaFo0YmJ0OXAzZGZKNnhsV2xiYkNRel91aDVvenhfWUtTTzZNcHFoZWRheVVNWTdSNjZxZzNvOGRkZERJTmVWQ1VVRl92Y28zcVhHbUdyYVdRaGQyc1FodzUtQ1pzcTQ3WnZyR1V6WDVPalRVb3EwMGx0NzY5bHpZMDlMb0VtLUREMk5NS0NmRmpNTlhMd24yS3piZkVF0gHMAUFVX3lxTE45d1ZkU25oMHdEQ0pKeDNJNHlpdFdrT2Jjc2NsejJxS05ER3JXcXF5dG9uVlBueDFLazFsR2R0cDJxVDRxTmh3aVkzemZoMGtwa0Q0MkVpR2I2WWc2cTRoQ0xrWC12elotRjFrTURsOF9GTWlhUjAtXzNhazVsYVczLWpvZkc4elloZ29DOGN0X0pWbTV3Q1dIRWJDUEd3V1paSl9oRW1ycDVYS09yNEdZOWhQbGVPWUs0NzJBMzM3dDZuTU00Ul9JMTJSeg?oc=5",
        "keywords": null,
        "description": "‘Haath jod kar maafi maang rahe the’: Tejashwi Yadav on Nitish Kumar Hindustan TimesAnother Chance To Nitish Kumar? What Tejashwi Yadav Told NDTV NDTVLalu nixes Nitish’s possible return to mahagathbandhan The Hindu‘Haath jodkar maafi maang...’: Tejashwi Yadav’s sharp jibe on JDU-BJP alliance Mint'Haath jodkar maafi maang rahe the': RJD's Tejashwi Yadav rules out future alliance with Bihar CM Nitish The Times of India",
        "pubDate": "2024-09-10 12:55:24",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.8947818875312805
    },
    {
        "title": "‘Haath jod kar maafi maang rahe the’ : Tejashwi Yadav on Nitish Kumar - Hindustan Times",
        "link": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQVWJIWGc0QUZwN2QweGo3LXRaRUFpWkVVQWdqV2V6d1FTTUd4SDVMTUlCaFo0YmJ0OXAzZGZKNnhsV2xiYkNRel91aDVvenhfWUtTTzZNcHFoZWRheVVNWTdSNjZxZzNvOGRkZERJTmVWQ1VVRl92Y28zcVhHbUdyYVdRaGQyc1FodzUtQ1pzcTQ3WnZyR1V6WDVPalRVb3EwMGx0NzY5bHpZMDlMb0VtLUREMk5NS0NmRmpNTlhMd24yS3piZkVF?oc=5",
        "keywords": null,
        "description": "‘Haath jod kar maafi maang rahe the’ : Tejashwi Yadav on Nitish Kumar Hindustan Times'Haath jodkar maafi maang rahe the': RJD's Tejashwi Yadav rules out future alliance with Bihar CM Nitish The Times of IndiaLalu nixes Nitish’s possible return to mahagathbandhan The HinduAnother Chance To Nitish Kumar? What Tejashwi Yadav Told NDTV NDTV‘Haath jodkar maafi maang...’: Tejashwi Yadav’s sharp jibe on JDU-BJP alliance Mint",
        "pubDate": "2024-09-10 12:55:24",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.8622313141822815
    },
    {
        "title": "The US Navy is about to launch a submarine built for a mixed-gender crew, the first of its kind",
        "link": "https://www.businessinsider.in/defense/news/the-us-navy-is-about-to-launch-a-submarine-built-for-a-mixed-gender-crew-the-first-of-its-kind/articleshow/113233345.cms",
        "keywords": [
            "defense"
        ],
        "description": "The USS New Jersey, designed for a co-ed crew, is set to join the US fleet on Saturday.A ban on women serving on US submarines was lifted in 2010, leading to hundreds joining the service.A submarine designed to fully integrate male and female sailors is set to join the US fleet on Saturday.The USS New Jersey \"is the first Virginia-class submarine designed and built for a full gender integrated crew,\" according to Naval Sea Systems Command.Delivered last April after eight years of construction, it will enter active service on September 14, following a ceremony at Naval Weapons Station Earle in New Jersey.A long-standing ban on women serving aboard US submarines was lifted in 2010, and as of 2023 there were 609 women assigned to submarines in operation, per the US Naval Institute.\"The submarine",
        "pubDate": "2024-09-10 12:55:21",
        "source_priority": 6525,
        "source_name": "Business Insider India",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.80600506067276
    },
    {
        "title": "Diljit Dosanjh's Dil-Luminati Tour Pre-Sale Tickets Get Sold Out In 2 Minutes",
        "link": "https://www.news18.com/movies/diljit-dosanjhs-dil-luminati-tour-pre-sale-tickets-get-sold-out-in-2-minutes-9046136.html",
        "keywords": [
            "movies"
        ],
        "description": "The pre-sales for the tour tickets were opened on September 10 at 12 PM, exclusively for HDFC Pixel Credit Card holders.",
        "pubDate": "2024-09-10 12:55:20",
        "source_priority": 6644,
        "source_name": "News 18",
        "category": [
            "entertainment"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.921653687953949
    },
    {
        "title": "In Pics: Apple Launches iPhone 16 Lineup, AirPods And More",
        "link": "https://www.ndtv.com/world-news/in-pics-apple-launches-iphone-16-lineup-airpods-and-more-6533990",
        "keywords": [
            "world"
        ],
        "description": "Tech giant Apple on Monday introduced new the new iPhone 16 series enabled with artificial intelligence, larger display sizes, a new camera control button and a big leap in battery life.",
        "pubDate": "2024-09-10 12:55:13",
        "source_priority": 1204,
        "source_name": "Ndtv",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.9304844737052917
    },
    {
        "title": "LEAD Group's TECHBOOK set to disrupt student learning in India",
        "link": "https://www.business-standard.com/content/press-releases-ani/lead-group-s-techbook-set-to-disrupt-student-learning-in-india-124091001082_1.html",
        "keywords": null,
        "description": "New Delhi [India], September 10: India's largest School Edtech company, LEAD Group, today announced the launch of TECHBOOK, an intelligent book designed to transform traditional textbook-driven learning. The TECHBOOK brings three cutting-edge technologies and NCF aligned curriculum to address key learning challenges among school students today.",
        "pubDate": "2024-09-10 12:55:13",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.7951885461807251
    },
    {
        "title": "U.S. Polo Assn. Celebrates a Year of Digital Innovation with its Website's First Birthday",
        "link": "https://www.business-standard.com/content/press-releases-ani/u-s-polo-assn-celebrates-a-year-of-digital-innovation-with-its-website-s-first-birthday-124091001081_1.html",
        "keywords": null,
        "description": "Bengaluru (Karnataka) [India], September 10: U.S. Polo Assn., the official brand of the United States Polo Association, proudly commemorates the first birthday of its exclusive brand website, upsoloassn.in. Launched this time, last year, the website has seen significant growth and innovation over the past year, solidifying U.S. Polo Assn.'s position as a leader in India's casual wear market.",
        "pubDate": "2024-09-10 12:55:11",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.8966677784919739
    },
    {
        "title": "Rain Hits Parts Of Delhi, Minimum Temperature Settles At 25.2 Degrees",
        "link": "https://www.ndtv.com/delhi-news/rain-hits-parts-of-delhi-minimum-temperature-settles-at-25-2-degrees-6533705",
        "keywords": null,
        "description": "Rain lashed areas of south and central Delhi on Tuesday evening, with the sky covered in an overcast blanket, according to the weather department.",
        "pubDate": "2024-09-10 12:55:00",
        "source_priority": 1204,
        "source_name": "Ndtv",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.7803928256034851
    },
    {
        "title": "Indian chess players great at grabbing opportunities: Viswanathan Anand",
        "link": "https://www.business-standard.com/sports/other-sports-news/indian-chess-players-great-at-grabbing-opportunities-viswanathan-anand-124091001020_1.html",
        "keywords": null,
        "description": "\"Slowly transitioning\" from a world champion competitor to a mentor-cum-sports administrator, chess icon Viswanathan Anand feels the current crop of Indian players, that he has had a role in shaping, has turned out to be \"great\" in grabbing crucial opportunities.The 54-year-old, among the all-time greats of Indian sports with five world titles to his credit, is set to have a rare competitive outing at the Tech-Mahnindra Global Chess League come next month in London where he will be part of the Ganges Grandmasters team.In an interview to PTI, Anand shared his thoughts on India's chances at the Chess Olympiad starting on Wednesday, his impressions of the country's Olympic and Paralympic performance, the golden generation of young players that he has helped groom and also his own plans going forward.Widely credited for shaping the likes of youngest ever world championship challenger D Gukesh, and R Praggnanandhaa among others, Anand said he played a small part and shared the credit",
        "pubDate": "2024-09-10 12:54:51",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "sports"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.899929940700531
    },
    {
        "title": "\"We don't want to beat Ric Flair's record\"- WWE Hall of Famer on Ric Flair's World Championship Record",
        "link": "https://timesofindia.indiatimes.com/sports/wwe/top-stories/bully-ray-questions-ric-flairs-championship-record-in-wwe-under-triple-hs-leadership/articleshow/113231441.cms",
        "keywords": null,
        "description": "Bully Ray recently discussed the possibility of Ric Flair’s world champion record being broken, suggesting it might have happened under Vince McMahon's leadership. However, he believes Triple H's respect for Flair makes it unlikely. Co-host Dave LaGreca proposed that a feud between John Cena and Randy Orton could potentially break the record.",
        "pubDate": "2024-09-10 12:54:37",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.8833779096603394
    },
    {
        "title": "Happy Gilmore 2: Does Travis Kelce have a cameo in sequel? Here’s latest update about production, cast",
        "link": "https://economictimes.indiatimes.com/news/international/us/happy-gilmore-2-does-travis-kelce-have-a-cameo-in-sequel-heres-latest-update-about-production-cast/articleshow/113237733.cms",
        "keywords": null,
        "description": "Adam Sandler has begun production on Happy Gilmore 2, the sequel to the 1996 comedy about a failed hockey player who excels in golf. The film will feature new cameos, including NFL star Travis Kelce, and bring back iconic elements from the original. Netflix greenlit the film earlier this year.",
        "pubDate": "2024-09-10 12:54:24",
        "source_priority": 231,
        "source_name": "The Economic Times",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.6440734267234802
    },
    {
        "title": "Jr NTR, Saif Ali Khan look fierce in 'Devara: Part 1' trailer, Janhvi Kapoor looks appealing | WATCH",
        "link": "https://www.indiatvnews.com/entertainment/regional-cinema/jr-ntr-saif-ali-khan-look-fierce-in-devara-part-1-trailer-janhvi-kapoor-looks-appealing-watch-2024-09-10-951427",
        "keywords": null,
        "description": "The fiery trailer of Junior NTR, Janhvi Kapoor and Saif Ali Khan's upcoming film 'Devara: Part 1' has been released, which is getting a tremendous response from the fans. This is Jr NTR's first film after SS Rajamouli's RRR (2022). Fans have been waiting for his return to the big screen for a long time, and ending their wait, the actor is now all set to take over the silver screen with his Pan India film Devara: Part 1. There has been a lot of anticipation for the film for a long time and now the makers have also released the trailer of Devara: Part 1 to ignite the excitement among fans.",
        "pubDate": "2024-09-10 12:54:16",
        "source_priority": 10055,
        "source_name": "India Tv",
        "category": [
            "entertainment"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.9222078323364258
    },
    {
        "title": "Harris and Trump face off for the first time tonight, but some corners of the business world are already over it",
        "link": "https://www.businessinsider.in/politics/world/news/harris-and-trump-face-off-for-the-first-time-tonight-but-some-corners-of-the-business-world-are-already-over-it/articleshow/113233350.cms",
        "keywords": [
            "world"
        ],
        "description": "This post originally appeared in the Insider Today newsletter.Hello there! How rich is Elon Musk? If things keep heading in the right direction for the Tesla CEO, he'll become the world's first trillionaire by 2027. And a few others aren't far behind.In today's big story, it's a presidential showdown in Philadelphia. But some people on Wall Street are already fed up.What's on deck:Markets: Higher education meant higher returns for one corner of Wall Street.Tech: Everything you want to know about the newest Apple gadgets that just got announced.Business: Starbucks' new CEO just started, which could mean big changes to the coffee chain.But first, you have two minutes, and your time starts now.If this was forwarded to you, sign up here.The big storyLet's debate113231925Kamala Harris and Donald",
        "pubDate": "2024-09-10 12:54:00",
        "source_priority": 6525,
        "source_name": "Business Insider India",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.7423458695411682
    },
    {
        "title": "Mrunal Thakur is in 'Mumbai meri jaan' to shoot for 'Son Of Sardaar 2'",
        "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/mrunal-thakur-is-in-mumbai-meri-jaan-to-shoot-for-son-of-sardaar-2/articleshow/113231551.cms",
        "keywords": null,
        "description": "Actress Mrunal Thakur revealed she is now back in Mumbai to shoot for a schedule of her upcoming film \"Son Of Sardaar 2\".",
        "pubDate": "2024-09-10 12:53:51",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.7907547354698181
    },
    {
        "title": "IAF Wing Commander booked for rape in J&K on woman officer’s complaint - The Indian Express",
        "link": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxPdlRmeXFIcGJjZ09qQlNxNmVvVTlGOC1UNXpTTXNGbXBmZmxEaVF1dkdESGZMZi1lRnpxWmtld0NkY1R5RVNOTTdraV9TLVV5Z053cHkyQko0Yk9yMGFlbEdtX1lBY1BTT2dTY1lPNEFlbWt4RHlWUThuMk5OXy0yU1NPc3ppS2hnZTU4QlVoT052X1htOXFYRXd4VmpXWV9BYjdCVTlwSTJjRDNGM25EakhEdFRmY1JrUWFIM2Y4LU83V3drYlVFQtIBzwFBVV95cUxQb042VnVYYm42UTV4S2lhbWhyQm9UTVhld1JoUGs3d2F5dnlVaHpqZTVpTVN1T0w2c1FRMVBOdkFWekRIMUY4ZzNsZlBJZDRWMEpGQTVPak5uQjcyenM1MEk2anZhT3dsdWtxSHh1WGxOZzV6Y3lqVk1NeDVMMnZidE9hczVzSmxiR0hqRXVld3pkMWxkTjluUnJDWEo2T2h6R1drQzgxaWM2Z1FmVndsenpDZHZ6cEtvR1pCSjZnY25rUDZWR1lvdGRZQzBBbWs?oc=5",
        "keywords": null,
        "description": "IAF Wing Commander booked for rape in J&K on woman officer’s complaint The Indian ExpressIAF Officer Files Rape Case Against Senior, Says Was Forced Into Oral Sex NDTVIAF Wing commander accused of sexual assault by Woman officer; IAF cooperating with probe The Times of IndiaAir Force officer accuses Wing Commander at J&K station of rape India TodayIAF Officer accuses Wing Commander of rape, claims IC probe closed to ’hide’ mistakes Mint",
        "pubDate": "2024-09-10 12:53:50",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "sentiment_score": 0.5999553203582764
    },
    {
        "title": "Current Situation In Gaza Is India's Foremost Concern, Says EAM S Jaishankar",
        "link": "https://www.businesstoday.in/bt-tv/short-video/current-situation-in-gaza-is-indias-foremost-concern-says-eam-s-jaishankar-445327-2024-09-10",
        "keywords": null,
        "description": "Current Situation In Gaza Is India's Foremost Concern, Says EAM S Jaishankar",
        "pubDate": "2024-09-10 12:53:47",
        "source_priority": 9735,
        "source_name": "Business News India",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.8195399641990662
    },
    {
        "title": "Bobby Deol reveals it took a long time for him to become close to Sunny Deol; says father Dharmendra was 'never a friend while growing up'",
        "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/bobby-deol-reveals-it-took-a-long-time-for-him-to-become-close-to-sunny-deol-says-father-dharmendra-was-never-a-friend-while-growing-up/articleshow/113228928.cms",
        "keywords": null,
        "description": "Bobby Deol often praises his brother Sunny and father Dharmendra on social media, though their relationship was strained in his youth. The age gap made Sunny treat Bobby like a son, and Dharmendra's strictness stemmed from his small-town upbringing. Over time, their bond improved, and Bobby now cares for his aging parents. Professionally, Bobby’s role as Abrar Haque in Animal was a career highlight, earning acclaim for his intense portrayal despite limited screen time.",
        "pubDate": "2024-09-10 12:53:46",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.6272832751274109
    },
    {
        "title": "Plastics recycling project to be rolled out in Hyderabad, Raipur",
        "link": "https://www.thehindu.com/news/cities/Hyderabad/plastics-recycling-project-to-be-rolled-out-in-hyderabad-raipur/article68626023.ece",
        "keywords": [
            "hyderabad"
        ],
        "description": "32,000 tonnes of waste to be processed and 9,000 tonnes of superior recycled polymers produced under the joint initiative of Re Sustainability and Harsh Mariwala family investment office Sharrp Ventures",
        "pubDate": "2024-09-10 12:53:45",
        "source_priority": 2972,
        "source_name": "The Hindu",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.8035746812820435
    },
    {
        "title": "Affirmations for Every Zodiac Sign: Empowering Words for Every Star",
        "link": "https://timesofindia.indiatimes.com/astrology/zodiacs-astrology/affirmations-for-every-zodiac-sign-empowering-words-for-every-star/articleshow/113231568.cms",
        "keywords": null,
        "description": "The article delves into the power of affirmations tailored to each Zodiac sign, from Aries to Pisces. Each affirmation is designed to resonate with the unique traits of the signs, helping individuals harness their strengths and address challenges. These personalized affirmations aim to align thoughts and actions with one's astrological identity for a more fulfilling life.",
        "pubDate": "2024-09-10 12:53:43",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.7072327733039856
    },
    {
        "title": "AP EdCET 2024 Phase 1 Counselling Seat Allotment Result Released At edcet-sche.aptonline.in- Check Direct Link, Steps Here",
        "link": "https://zeenews.india.com/education/ap-edcet-2024-phase-1-counselling-seat-allotment-result-released-at-edcet-sche-aptonline-in-check-direct-link-steps-here-2791227.html",
        "keywords": [
            "latest news"
        ],
        "description": "AP EdCET 2024: The first phase of counselling for the Andhra Pradesh Education Common Entrance Test (AP EdCET) 2024 has concluded, with seat allotment results announced on September 10. Candidates can now check their results and complete the admission process online, scroll down for more details.",
        "pubDate": "2024-09-10 12:53:42",
        "source_priority": 5319,
        "source_name": "Zee News",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.9046832919120789
    },
    {
        "title": "Dramatic Video Of Vijayawada Street Flooding, 4 Feet Of Water In 3 Hours",
        "link": "https://www.ndtv.com/south/vijayawada-floods-ajit-singh-nagar-flooding-dramatic-video-of-vijayawada-street-flooding-4-feet-of-water-in-3-hours-6533985",
        "keywords": null,
        "description": "Dramatic time-lapse footage of floodwaters taking over a street in Andhra Pradesh's Vijayawada were shared Tuesday, after heavy rain in coastal districts killed nearly 50 people, a majority in the city, and affected over 10 lakh.",
        "pubDate": "2024-09-10 12:53:33",
        "source_priority": 1204,
        "source_name": "Ndtv",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "sentiment_score": 0.5880597233772278
    },
    {
        "title": "Scrappage policy to be based on pollution level, not age of vehicle: Govt",
        "link": "https://www.business-standard.com/industry/auto/scrappage-policy-to-be-based-on-pollution-level-not-age-of-vehicle-govt-124091001049_1.html",
        "keywords": null,
        "description": "The government is working on a policy for scrappage of vehicles to be based on pollution and not on the age of the automobiles, an official said on Tuesday.Speaking at the annual convention of Society of Indian Automobile Manufacturers (SIAM), Ministry of Road Transport & Highways Secretary Anurag Jain asked the automobile industry to help the government in designing the programme of pollution checks \"trustworthy\".\"When you come out with a policy that scrapping is mandatory after 15 years, people come back to us with a question -- if I have maintained my vehicle well, why do you want to scrap my vehicle? You can't mandate,\" Jain said.In order to consider such situations, he said, \"We are studying it from the pollution (point) only.\" The government is \"working at a policy\" for the same, he added.\"Can we say that pre BS II? We are not talking about age. Can we do it? BS I or pre-BS I? Can we put up a limit for the vehicle pollution?\" he added.He, however, said, \"There also we .",
        "pubDate": "2024-09-10 12:53:04",
        "source_priority": 9158,
        "source_name": "Business Standard",
        "category": [
            "business"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.8895424604415894
    },
    {
        "title": "Fact Check: Rahul Gandhi Image With Journalist Given False ‘George Soros’ Spin",
        "link": "https://news.abplive.com/fact-check/fact-check-rahul-gandhi-journalist-george-soros-manmohan-singh-amrit-singh-1716373",
        "keywords": [
            "fact check"
        ],
        "description": "Fact Check: Rahul Gandhi Image With Journalist Given False ‘George Soros’ Spin",
        "pubDate": "2024-09-10 12:53:01",
        "source_priority": 10959,
        "source_name": "Abp News",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.7029479146003723
    },
    {
        "title": "Current Generation of Indian Chess Players Great at Grabbing Opportunities: Viswanathan Anand",
        "link": "https://www.news18.com/sports/current-generation-of-indian-chess-players-great-at-grabbing-opportunities-viswanathan-anand-9046135.html",
        "keywords": [
            "sports"
        ],
        "description": "Viswanathan Anand shared his thoughts on India's chances at the Chess Olympiad, his impressions of the country's Olympic and Paralympic performance, the golden generation of young players that he has helped groom and also his own plans going forward.",
        "pubDate": "2024-09-10 12:52:37",
        "source_priority": 6644,
        "source_name": "News 18",
        "category": [
            "sports"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.5502145290374756
    },
    {
        "title": "Pawan Singh Breaks Silence On Akshra Singh's Allegations, Makes Major Statement | ABP Live",
        "link": "https://news.abplive.com/videos/news/india-pawan-singh-breaks-silence-on-akshra-singh-s-allegations-makes-major-statement-abp-live-1716377",
        "keywords": [
            "india"
        ],
        "description": "Pawan Singh has finally broken his silence on Akshra Singh's allegations. In a recent podcast, Pawan Singh explained the reasons behind ending his relationship with Akshra Singh. He addressed the accusations made by Akshra Singh and provided clarity on their separation. Pawan Singh discussed the personal and professional factors that influenced his decision, offering insights into the complexities of their relationship. He emphasized his perspective on the situation and clarified any misunderstandings. The statement aims to provide a complete view of the events leading up to their split and to set the record straight regarding the accusations. Watch Pawan Singh's full statement on Akshra Singh's allegations to understand his side of the story.",
        "pubDate": "2024-09-10 12:52:27",
        "source_priority": 10959,
        "source_name": "Abp News",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.8808605074882507
    },
    {
        "title": "In Pics: SpaceX Launches Four Astronauts On Polaris Dawn Mission",
        "link": "https://in.mashable.com/science/82000/in-pics-spacex-launches-four-astronauts-on-polaris-dawn-mission",
        "keywords": [
            "polaris",
            "science",
            "reels",
            "space",
            "spacex"
        ],
        "description": "SpaceX, on September 10, launched the historic Polaris Dawn mission wherein astronauts will attempt the first private spacewalk.",
        "pubDate": "2024-09-10 12:52:27",
        "source_priority": 335,
        "source_name": "In Mashable",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.598200798034668
    },
    {
        "title": "‘The Glassworker’ interview: Usman Riaz on bringing Pakistan’s first hand-drawn animated feature to life",
        "link": "https://www.thehindu.com/entertainment/movies/the-glassworker-interview-usman-riaz-on-bringing-pakistans-first-hand-drawn-animated-feature-to-life/article68600965.ece",
        "keywords": [
            "movies"
        ],
        "description": "Having made history at home, the creator reflects on his seasoned anime inspirations, growing in post 9/11 Pakistan and the outpour of support from India",
        "pubDate": "2024-09-10 12:52:21",
        "source_priority": 2972,
        "source_name": "The Hindu",
        "category": [
            "entertainment"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.768744170665741
    },
    {
        "title": "LEAD Group launches ‘TECHBOOK’, envisages to transform traditional textbook-driven learning",
        "link": "https://www.hindustantimes.com/education/news/lead-group-launches-techbook-envisages-to-transform-traditional-textbook-driven-learning-101725970953528.html",
        "keywords": [
            "latest"
        ],
        "description": "LEAD Group Co-founder and CEO Sumeet Mehta said the company expects India’s top 5000 schools to upgrade to TECHBOOKS by 2028. Read details below.",
        "pubDate": "2024-09-10 12:52:15",
        "source_priority": 933,
        "source_name": "Hindustan Times",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.504225492477417
    },
    {
        "title": "Video: Ajit Pawar Stops Convoy To Help Accident Victim In Pune",
        "link": "https://www.ndtv.com/india-news/video-ajit-pawar-stops-convoy-to-help-accident-victim-in-pune-6533972",
        "keywords": null,
        "description": "In a heartwarming gesture, Maharashtra Deputy Chief Minister Ajit Pawar stopped his convoy to help an injured man lying on a road in Pune.",
        "pubDate": "2024-09-10 12:52:13",
        "source_priority": 1204,
        "source_name": "Ndtv",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.7741335034370422
    },
    {
        "title": "Aviation Minister K Rammohan Naidu: Looking At Issues Being Faced By SpiceJet",
        "link": "https://www.businesstoday.in/bt-tv/short-video/aviation-minister-k-rammohan-naidu-looking-at-issues-being-faced-by-spicejet-445326-2024-09-10",
        "keywords": null,
        "description": "Aviation Minister K Rammohan Naidu: Looking At Issues Being Faced By SpiceJet",
        "pubDate": "2024-09-10 12:52:00",
        "source_priority": 9735,
        "source_name": "Business News India",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.7299070358276367
    },
    {
        "title": "The Most Blessed Zodiac Signs: Who’s Got the Cosmic Golden Ticket?",
        "link": "https://timesofindia.indiatimes.com/astrology/zodiacs-astrology/the-most-blessed-zodiac-signs-whos-got-the-cosmic-golden-ticket/articleshow/113231544.cms",
        "keywords": null,
        "description": "Certain Zodiac signs are notably blessed with favorable circumstances and enriching experiences. Sagittarius is known for its adventurous luck; Taurus enjoys material abundance; Pisces has spiritual depth; and Libra benefits from harmonious relationships. These traits lead to a life filled with positive events for these signs.",
        "pubDate": "2024-09-10 12:51:59",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.9720656871795654
    },
    {
        "title": "YouTuber Nikocado Avocado Lost Over 100 Kg In Two Years In A \"Secret\" Weight Loss Journey",
        "link": "https://swirlster.ndtv.com/wellness/youtuber-nikocado-avocado-lost-over-100-kg-in-two-years-in-a-secret-weight-loss-journey-6533239",
        "keywords": null,
        "description": "YouTuber Nikocado Avocado shocked his followers with a drastic physical transformation after he lost over 100 kg spanning 2 years",
        "pubDate": "2024-09-10 12:51:58",
        "source_priority": 1204,
        "source_name": "Ndtv",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.8207486867904663
    },
    {
        "title": "Selena Gomez says her boyfriend is biased, here's why",
        "link": "https://timesofindia.indiatimes.com/entertainment/english/hollywood/news/selena-gomez-says-her-boyfriend-is-biased-heres-why/articleshow/113231474.cms",
        "keywords": null,
        "description": "The recently released musical crime comedy film 'Emilia Perez', which stars actress-singer Selena Gomez and Zoe Saldana, has been getting great response from all quarters. In fact, Selena's boyfriend Benny Blanco too has been raving about the film, which to Selena feels is a little biased.",
        "pubDate": "2024-09-10 12:51:45",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.8903149366378784
    },
    {
        "title": "This Diwali, quick comm comes bearing gifts; platforms partner FMCG brands for special packs, offers, ads",
        "link": "https://economictimes.indiatimes.com/industry/services/retail/this-diwali-quick-comm-comes-bearing-gifts-platforms-partner-fmcg-brands-for-special-packs-offers-ads/articleshow/113237692.cms",
        "keywords": null,
        "description": "Quick commerce companies are collaborating with FMCG brands like Parle, Mondelez, and ITC for the festive season. They are aiming to boost inventory levels by 60% and offer special packs and promotions on chocolates, sweets, dry fruits, and cookies. The platforms are also partnering with consumer electronics companies for kitchen appliances and personal care products.",
        "pubDate": "2024-09-10 12:51:29",
        "source_priority": 231,
        "source_name": "The Economic Times",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.7677268981933594
    },
    {
        "title": "Jayam Ravi's magical birthday special poster from 'Genie' out!",
        "link": "https://timesofindia.indiatimes.com/entertainment/tamil/movies/news/jayam-ravis-magical-birthday-special-poster-from-genie-out/articleshow/113231528.cms",
        "keywords": null,
        "description": "Jayam Ravi joins forces with director Arjunan for the fantasy drama 'Genie', releasing a new poster on his 44th birthday. He is also part of 'Kadhalikka Neramillai' and 'Brother'. Additionally, Ravi has announced his divorce from wife Aarti, leaving fans shocked.",
        "pubDate": "2024-09-10 12:50:56",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.857295036315918
    },
    {
        "title": "More than 40 students injured in Manipur in clashes with forces",
        "link": "https://economictimes.indiatimes.com/news/india/more-than-40-students-injured-in-manipur-in-clashes-with-forces/articleshow/113237693.cms",
        "keywords": null,
        "description": "The students were demanding the removal of the DGP and security advisor. Despite a curfew, protests erupted, leading to tear gas shelling by police. The state government has suspended internet services and closed educational institutions.",
        "pubDate": "2024-09-10 12:50:40",
        "source_priority": 231,
        "source_name": "The Economic Times",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "sentiment_score": 0.8481358289718628
    },
    {
        "title": "Rupee weakens slightly to 83.975 vs. dollar ahead of Fed meeting next week",
        "link": "https://economictimes.indiatimes.com/markets/forex/rupee-weakens-slightly-to-83-975-vs-dollar-ahead-of-fed-meeting-next-week/articleshow/113231522.cms",
        "keywords": null,
        "description": "The rupee weakened marginally versus the dollar on Monday, closing at 83.975 as risk appetite of the market was weak ahead of the Federal Open Market Committee Meeting that will happen next week on 18th. Dollar sales from state run banks also helped cap further weakness in the rupee, traders said.",
        "pubDate": "2024-09-10 12:50:29",
        "source_priority": 231,
        "source_name": "The Economic Times",
        "category": [
            "business"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.6171953678131104
    },
    {
        "title": "'Yudh Abhyas 2024’: India, US army troops in action! Soldiers join hands for exercise in Rajasthan",
        "link": "https://economictimes.indiatimes.com/news/defence/yudh-abhyas-2024-india-us-army-troops-in-action-soldiers-join-hands-for-exercise-in-rajasthan/videoshow/113231519.cms",
        "keywords": null,
        "description": null,
        "pubDate": "2024-09-10 12:50:25",
        "source_priority": 231,
        "source_name": "The Economic Times",
        "category": [
            "top"
        ],
        "sentiment": "",
        "sentiment_score": ""
    },
    {
        "title": "Hero MotoCorp Backed EV 2-Wheeler Maker Ather Energy Files DRHP, Will Compete With Ola Electric",
        "link": "https://www.businesstoday.in/bt-tv/market-today/short-video/hero-motocorp-backed-ev-2-wheeler-maker-ather-energy-files-drhp-will-compete-with-ola-electric-445325-2024-09-10",
        "keywords": null,
        "description": "Hero MotoCorp Backed EV 2-Wheeler Maker Ather Energy Files DRHP, Will Compete With Ola Electric",
        "pubDate": "2024-09-10 12:50:24",
        "source_priority": 9735,
        "source_name": "Business News India",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.76029372215271
    },
    {
        "title": "Kolkata rape-murder case: Junior doctors defy SC directive to join duty, continue agitation - The New Indian Express",
        "link": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPMVZxMWN3YXpnRFRRUjNXeHA2VXdaYm8zZWJqNXJscU5uMXRIM014MW1ETG1hN3NDZnlaVmtjRHlhaTVrMWpXQVUzNmVNeVJNbGpGeDYybTBCam80ZktYY2lEUmVYN3pOQWxLRkdvLUpZS0tWUU5Ja2tiRVYtR2FwbWpSbUN0eVVIS0VFVW1MRWdxOERTTTFzaF9XN0lrdkNHUUVvbGpjd0ktWDhMbjlhbWlZOENrTFhzczlwaE1fWW1GWkN4UjFmUVBpLU1zNnIzR3ZVY2s1RUjSAeYBQVVfeXFMT09rWmNFRU1XV1R2eFl0QnpwWHNXWks4WTZYUlpIbkpQUEVhR1NOTkJNd2JSbHpleEp5Q3lsdy1OZkdfcGtUS3NnVmh5VlV3UjlPdmlWRlpkaURzeE0zNTNoZlE1VUNKMGowZDFYVzRkMHliNmdCUVRnMUJEc2JiUnFYU1U4bFpHeFVLZUhCQ0pMQTFmdlpZRjl0SFJrcW93bm15Qk9sR3JzMVlBRlc4MTRNLTFZWkNQTzJGeDBUNC12a3R0N202TkNuV2QzSEJPakQ5Vml4WUIwSUFKUlZMUnVIc3g4Snc?oc=5",
        "keywords": null,
        "description": "Kolkata rape-murder case: Junior doctors defy SC directive to join duty, continue agitation The New Indian Express‘Humiliating’: Doctors slam Mamata's talks offer, say protests to continue Hindustan TimesBengal seeks dialogue with protesting doctors, medics say 'humiliating' India Today\"Insulting To Us\": Called For Talks, Bengal Doctors' Strong Rebuff NDTVRG Kar: Junior doctors defy Supreme Court directive to join duty, continue with ‘cease work’ Deccan Herald",
        "pubDate": "2024-09-10 12:50:02",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.5280528664588928
    },
    {
        "title": "Govt sends 2,000 more CRPF personnel to Manipur amid fresh protests",
        "link": "https://economictimes.indiatimes.com/news/india/govt-sends-2000-more-crpf-personnel-to-manipur-amid-fresh-protests/articleshow/113231504.cms",
        "keywords": null,
        "description": "The Centre has ordered the deployment of two new CRPF battalions, totaling about 2,000 personnel, to Manipur for security duties. This move follows the withdrawal of two Assam Rifles battalions. The CRPF will play a lead role in stabilizing the region affected by ethnic conflict since May last year.",
        "pubDate": "2024-09-10 12:49:45",
        "source_priority": 231,
        "source_name": "The Economic Times",
        "category": [
            "top"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.8246326446533203
    },
    {
        "title": "Transport Department suspends 6,916 licences in Telangana due to road safety violations",
        "link": "https://www.thehindu.com/news/national/telangana/transport-department-suspends-6916-licences-in-telangana-due-to-road-safety-violations/article68625957.ece",
        "keywords": [
            "telangana"
        ],
        "description": "The suspensions were for several offences that included wrong side driving, drunken driving and overspeeding",
        "pubDate": "2024-09-10 12:49:44",
        "source_priority": 2972,
        "source_name": "The Hindu",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "sentiment_score": 0.6532608270645142
    },
    {
        "title": "Google loses fight against $2.7 billion EU antitrust fine; penalty upheld by Europe's top court",
        "link": "https://economictimes.indiatimes.com/news/et-tv/google-loses-fight-against-2-7-billion-eu-antitrust-fine-penalty-upheld-by-europes-top-court/videoshow/113231502.cms",
        "keywords": null,
        "description": "Google loses fight against $2.7 billion EU antitrust fine; penalty upheld by Europe's top court",
        "pubDate": "2024-09-10 12:49:41",
        "source_priority": 231,
        "source_name": "The Economic Times",
        "category": [
            "business"
        ],
        "sentiment": "negative",
        "sentiment_score": 0.6764891743659973
    },
    {
        "title": "Who’s Your Destined Wife? Finding Your Perfect Match Through Your Rising Sign",
        "link": "https://timesofindia.indiatimes.com/astrology/zodiacs-astrology/whos-your-destined-wife-finding-your-perfect-match-through-your-rising-sign/articleshow/113231497.cms",
        "keywords": null,
        "description": "The article delves into how your rising sign can guide you to your ideal wife by revealing the qualities you seek in a partner. It explores each ascendant's unique traits, from adventurous Aries to compassionate Pisces, offering insights into compatibility and relationship dynamics for finding your perfect match.",
        "pubDate": "2024-09-10 12:49:32",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.6392835378646851
    },
    {
        "title": "Walker Blanco cheers on rumoured girlfriend Ananya Panday’s success with 'Call Me Bae'",
        "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/walker-blanco-cheers-on-rumoured-girlfriend-ananya-pandays-success-with-call-me-bae/articleshow/113231180.cms",
        "keywords": null,
        "description": "Ananya Panday is earning acclaim for her role as Bae in 'Call Me Bae', which topped Amazon Prime Video in India. Her rumored boyfriend, Walker Blanco, cheered her success on Instagram. The series, marking Panday’s web debut, features a strong cast including Vihaan Samat, Muskkaan Jaferi, and Gurfateh Pirzada.",
        "pubDate": "2024-09-10 12:49:12",
        "source_priority": 391,
        "source_name": "The Times Of India",
        "category": [
            "top"
        ],
        "sentiment": "positive",
        "sentiment_score": 0.9413790702819824
    },
    {
        "title": "Alia Bhatt is a beauty as she radiates desi Barbie glam in a pink suit. Watch",
        "link": "https://www.hindustantimes.com/lifestyle/fashion/alia-bhatt-is-a-beauty-as-she-radiates-desi-barbie-glam-in-a-pink-suit-watch-101725970113382.html",
        "keywords": [
            "lifestyle/fashion"
        ],
        "description": "Alia Bhatt switched two looks in one day, she went from Wednesday to being a desi Barbie.",
        "pubDate": "2024-09-10 12:49:11",
        "source_priority": 933,
        "source_name": "Hindustan Times",
        "category": [
            "entertainment"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.7969459295272827
    },
    {
        "title": "Mukesh Ambani Makes Special Visit With His Convoy To Meet Deepika & Ranveer's Babygirl | WATCH - The Times of India",
        "link": "https://news.google.com/rss/articles/CBMigwJBVV95cUxNVE1SMzU5TElCR1hXR0Uyczd2NTFYZGNrU1BnS0lHYVlzZVNmVW96NENRY0MySmNNVHRScVEtRnNZV2ZBQWg3Q0VRUlB6Vk9ER2EwUGFITWowMFQ5RHRnT1RIYVhXWlYyQzdhMjNRUGU2VmkzcVBYLS1HRVE3cW9QNkZ2bG1wNUVERXhaTE5KOUNxajBXdU9BSnhYQk9OY2N5Vk9CQWNmUG9OdExNcGg2MFA1eGpkbnNtMGpmTUhrS1pPSWVwV0UyMVNDUFJWdG1FdGVJY09mci1VdVByNFBWTHFzZGRZclc3bW9rb0d0Q1ZpQ1ppbzB4cFpXUWtGMTVTQ2pJ0gGIAkFVX3lxTFBuX0pkSE9YNFlYVng5UjUwYU1xVS03b0xPQ1hxdWVNR0FFeU5SaG5zNUFHVC1OQktCcUItUTh0M0hiZ184dFByNi1ZT0RleXlmNVFvNW9ORGFRcEh6NjFzcjB1NE9KTGIwdndGdllmaERqdUd0N0lZelZFRUZBei1yWlNwTUpRZFl2eDBwMm9tM2hZMVEwdG83SnRBeExNbWJCOS0tWWZEbF8tRHNyUFBLbUJfTGtfMDRXNmszOTRITnVsQmR3T3Z1dnF6UHB1dXBhUGRIQ3dOQ0N0OTZtR0NuOG5mS003UjJmVl9NSDBRc3UzRDZmNGVQOFZLMHpGRy1SSDZMZ21sdg?oc=5",
        "keywords": null,
        "description": "Mukesh Ambani Makes Special Visit With His Convoy To Meet Deepika & Ranveer's Babygirl | WATCH The Times of IndiaRanveer Singh’s sister visits Deepika Padukone in hospital to meet her baby girl. Watch Hindustan TimesDid Deepika Padukone, Ranveer Singh's First Baby Pics Leak Online? Here's The Truth Oneindia",
        "pubDate": "2024-09-10 12:48:56",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "entertainment"
        ],
        "sentiment": "neutral",
        "sentiment_score": 0.895818829536438
    },
    {
        "title": "IAF Officer accuses Wing Commander of rape, claims IC probe closed to 'hide' mistakes",
        "link": "https://www.livemint.com/news/india/srinagar-based-iaf-officer-files-fir-against-wing-commander-of-rape-says-ic-investigation-closed-to-hide-mistakes-11725972002151.html",
        "keywords": null,
        "description": "An Indian Air Force flying officer has accused a Wing Commander of rape and filed a police complaint. The case is under investigation as she alleges ongoing harassment and mental torture since the incident at a New Year party in 2023.",
        "pubDate": "2024-09-10 12:48:54",
        "source_priority": 7134,
        "source_name": "Mint",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "sentiment_score": 0.8597630262374878
    },
    {
        "title": "IAF Officer accuses Wing Commander of rape, claims IC probe closed to 'hide' mistakes | Today News - Mint",
        "link": "https://news.google.com/rss/articles/CBMi_gFBVV95cUxQVHdZNUpJcEZtRko4a3dGRGQwbVU3dWxQTjUxNFNZSjY1Z1l1S3E0ODJ4b0pRalUtT1JHamtlWklGd0VyZlNVd2RKemlYd0tSOW02MVBFVnhXN1lSUFFKQXo4dkxXNTRqdXVUWnhDa2ZlTFlCSXVyeDlCV1pBUlNaQmZEUEtJaU1QaERSMXdiemF3TDd0T1ZsRzdxSGcyVk40SmR6czVIeThQWTZzSkdSREpYVDI2OXFNQ29BSEZGeldYbjhmVTNfUkt1WG91WjN5Vmo4STVQanFhSkdxTDN3cHJHb3ZDenI1NnI1WVJfMGpIbzJCcmhnRGl0THBwZ9IBgwJBVV95cUxQOF83dTUyMVhaUFBjc0E4U28zQndmS2V6ckVBeDd4MGhLZ29CbmYtVWY4MWRPXzZRd1hfRU1BbDU1SEhScFJxZzNPNzFpVXl5dkdVeF9XVzBkRXpxNnNOZ3FyMktrQm9Ib0hnSEE5X1JMcExLVl9uWGlmdk85LXk3V3JvWE55NXNCTDJEcXJsMnBDMVQ4eEE4N2xxa25EclhoTGZOdFRXWTFKQmJJYUlMQTc0aG15Z1lYSHBmOHowVHpxSG9Cay1zVnJYUlpFaTdFZW5hWEV0ZzM1MzZSbTZrMjlqTDFRWkRiNE5qVl9sakltVHlxcXBHU2tQbWM2dXVPNS00?oc=5",
        "keywords": null,
        "description": "IAF Officer accuses Wing Commander of rape, claims IC probe closed to 'hide' mistakes | Today News MintIAF Officer Files Rape Case Against Senior, Says Was Forced Into Oral Sex NDTVIAF Wing commander accused of sexual assault by Woman officer; IAF cooperating with probe The Times of IndiaIAF Wing Commander booked for rape in J&K on woman officer’s complaint The Indian ExpressAir Force officer accuses Wing Commander at J&K station of rape India Today",
        "pubDate": "2024-09-10 12:48:54",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "sentiment_score": 0.6162991523742676
    },
    {
        "title": "IAF Officer accuses Wing Commander of rape, claims IC probe closed to ’hide’ mistakes - Mint",
        "link": "https://news.google.com/rss/articles/CBMi_gFBVV95cUxQVHdZNUpJcEZtRko4a3dGRGQwbVU3dWxQTjUxNFNZSjY1Z1l1S3E0ODJ4b0pRalUtT1JHamtlWklGd0VyZlNVd2RKemlYd0tSOW02MVBFVnhXN1lSUFFKQXo4dkxXNTRqdXVUWnhDa2ZlTFlCSXVyeDlCV1pBUlNaQmZEUEtJaU1QaERSMXdiemF3TDd0T1ZsRzdxSGcyVk40SmR6czVIeThQWTZzSkdSREpYVDI2OXFNQ29BSEZGeldYbjhmVTNfUkt1WG91WjN5Vmo4STVQanFhSkdxTDN3cHJHb3ZDenI1NnI1WVJfMGpIbzJCcmhnRGl0THBwZw?oc=5",
        "keywords": null,
        "description": "IAF Officer accuses Wing Commander of rape, claims IC probe closed to ’hide’ mistakes MintIAF Officer Files Rape Case Against Senior, Says Was Forced Into Oral Sex NDTVIAF Wing Commander booked for rape in J&K on woman officer’s complaint The Indian ExpressIAF Wing commander accused of sexual assault by Woman officer; IAF cooperating with probe The Times of IndiaAir Force officer accuses Wing Commander at J&K station of rape India Today",
        "pubDate": "2024-09-10 12:48:54",
        "source_priority": 14,
        "source_name": "Google News",
        "category": [
            "top"
        ],
        "sentiment": "negative",
        "sentiment_score": 0.6234468221664429
    }
]