{
    "business": [
        {
            "title": "Readymade garment exports rise 12% in Aug despite global challenges",
            "link": "https://www.business-standard.com/industry/news/readymade-garment-exports-rise-12-in-aug-despite-global-challenges-124091900761_1.html",
            "description": "The country's ready-made garment exports (RMG) in August rose by about 12 per cent to USD 1.26 billion despite global headwinds and challenges such as high logistic cost, according to the commerce ministry data.Cumulatively, RMG exports during the April-August period of 2024-25 grew by 7.12 per cent to USD 6.39 billion.Apparel Export Promotion Council (AEPC) Chairman Sudhir Sekhri said that exports are keeping the growth momentum despite global headwinds, persisting Red Sea crisis and other challenges such as high logistic costs.\"Growing at an average of 7.12 per cent in the last five months (April to August 2024-25), the RMG exports have bucked the trend of falling merchandise exports which touched a 13-month low in August,\" he said.He added that with focus on product quality as well as environmental and social compliance, the industry is poised to take a leap into high growth trajectory and be a major global player of garment exports.\"I am hopeful that the growth momentum w",
            "source_name": "Business Standard"
        },
        {
            "title": "PM E-DRIVE to boost electric vehicle adoption, says H D Kumaraswamy",
            "link": "https://www.business-standard.com/industry/news/pm-e-drive-to-boost-electric-vehicle-adoption-says-h-d-kumaraswamy-124091801393_1.html",
            "description": "FAME-II proved to be financially successful, with approximately 93 per cent of targeted vehicles incentivized and 92 per cent of the allocated funds utilised, Kumaraswamy said",
            "source_name": "Business Standard"
        },
        {
            "title": "Jindal India plans to invest Rs 1,500 crore to expand production capacity",
            "link": "https://www.business-standard.com/companies/news/jindal-india-plans-to-invest-rs-1-500-crore-to-expand-production-capacity-124091900833_1.html",
            "description": "Jindal India, a downstream steel player, on Thursday announced its plans to invest Rs 1,500 crore to increase its annual production capacity to 1.6 million tonne.The expansion focuses on the production of coated flat products, pipes, and crash barriers, the company said in a statement.\"Jindal India announces a capex spend of over Rs 1,500 crore to effect a strategic capacity expansion of 0.6 Million MT, a 60 per cent increase from its current capacity of 1 million metric tonne per annum,\" it said.The expansion is expected to be completed by the financial year 2025-26, while the production is slated to be started within the ongoing fiscal, it said.The increased focus on rapidly augmenting the nation's highway network with critical safety components such as crash barriers is a key area where Jindal India has been adding value, a company spokesperson said.Part of B C Jindal Group, Jindal India Limited is into manufacturing of colour-coated and galvanized steel sheets and coils,",
            "source_name": "Business Standard"
        }
    ],
    "entertainment": [
        {
            "title": "‘Emilia Pérez’ selected as France’s official submission for the Oscars 2025",
            "link": "https://www.thehindu.com/entertainment/movies/emilia-p%C3%A9rez-selected-as-frances-official-submission-for-the-oscars-2025/article68659103.ece",
            "description": "The film made a strong impression at Cannes, where it won the Jury Prize and earned a joint Best Actress award for its ensemble cast",
            "source_name": "The Hindu"
        },
        {
            "title": "Tumbbad Re-Release Day 6: Sohum Shah Starrer Remains Steady, Grosses ₹12.11 Cr Total",
            "link": "https://zeenews.india.com/people/tumbbad-re-release-day-6-sohum-shah-starrer-remains-steady-grosses-12-11-cr-total-2795618.html",
            "description": "Tumbbad, the critically acclaimed film originally released in 2018, has made a striking comeback, surpassing ₹12 crore at the Indian box office.",
            "source_name": "Zee News"
        },
        {
            "title": "Pakistan's only 100 crore earning film 'Maula Jatt' featuring Fawad, Mahira to finally release in India",
            "link": "https://www.indiatvnews.com/entertainment/news/pakistan-s-first-100-crore-earning-film-the-legend-of-maula-jatt-featuring-fawad-khan-mahira-khan-to-finally-release-in-india-2024-09-18-952805",
            "description": "Many Indian films have been banned in Pakistan. However, many films have been watched with great interest by Pakistani audiences and Bollywood films have received a lot of love from Pakistan. On the other hand, Pakistani dramas are also loved a lot by the Indian audience. At the same time, now there is a buzz about a Pakistani film in India. This film is 'The Legend of Maula Jatt' featuring Kapoor And Sons actor Fawad Khan and Raees actress Mahira Khan in the lead roles. The film has been very successful in Pakistan and the audience has given it a lot of love. Now 'The Legend of Maula Jatt' is releasing in India. Its release date has also been revealed.",
            "source_name": "India Tv"
        }
    ],
    "top": [
        {
            "title": "Rupee rises 6 paise to 83.70 against U.S. dollar after fed rate cate",
            "link": "https://www.thehindu.com/business/markets/rupee-rises-6-paise-to-8370-against-us-dollar-after-fed-rate-cate/article68658626.ece",
            "description": "The rupee also got support from lower crude oil prices, positive domestic equity markets as well as inflow of foreign funds, forex traders said",
            "source_name": "The Hindu"
        },
        {
            "title": "Karnataka to establish centre of excellence for space technologies",
            "link": "https://www.thehindu.com/news/cities/bangalore/karnataka-to-establish-centre-of-excellence-for-space-technologies/article68656246.ece",
            "description": "The State will also soon introduce a comprehensive space policy designed to foster investments, innovation and adoption of cutting-edge space technologies",
            "source_name": "The Hindu"
        },
        {
            "title": "Revved up! Nykaa scales its same, next-day deliveries to 110 cities",
            "link": "https://www.business-standard.com/companies/start-ups/fashion-e-commerce-firm-nykaa-scales-its-same-day-delivery-to-110-cities-124091901232_1.html",
            "description": "Nykaa has expanded its supply chain network to 44 warehouses across India by FY24, up from 18 in FY21",
            "source_name": "Business Standard"
        }
    ],
    "technology": [
        {
            "title": "Stroke cases increasing globally, air pollution, high temperatures driving numbers: The Lancet study",
            "link": "https://www.thehindu.com/sci-tech/health/stroke-cases-increasing-globally-air-pollution-high-temperatures-driving-numbers-the-lancet-study/article68659411.ece",
            "description": "Researchers found that the contribution of high temperatures to poor health and early death due to strokes has increased 72 per cent since 1990, and is likely to continue increasing in the future",
            "source_name": "The Hindu"
        },
        {
            "title": "ICMR gets U.N. award for successes in control of non-communicable diseases",
            "link": "https://www.thehindu.com/sci-tech/health/icmr-gets-un-award-for-successes-in-control-of-non-communicable-diseases/article68659652.ece",
            "description": "Union Health Minister J.P. Nadda said the 2024 @UN Inter-Agency Task Force Award highlighted the ICMR’s innovative work in assistive technology and creating sustainable solutions to enhance the quality of life of those with NCDs and mental health challenges",
            "source_name": "The Hindu"
        },
        {
            "title": "New migraine drugs no better than cheap painkillers: big study",
            "link": "https://www.thehindu.com/sci-tech/health/new-migraine-drugs-no-better-than-cheap-painkillers-big-study/article68659543.ece",
            "description": "A new meta-analysis, published in The BMJ journal found that newer and more expensive drugs rimegepant and ubrogepant -- as well as another called lasmiditan -- were about as effective as paracetamol and anti-inflammatory painkillers",
            "source_name": "The Hindu"
        }
    ],
    "sports": [
        {
            "title": "Afghanistan Beat South Africa In International Cricket For First Time With Dominant Six-Wicket Victory In 1st ODI",
            "link": "https://zeenews.india.com/cricket/afghanistan-beat-south-africa-in-international-cricket-for-first-time-with-dominant-six-wicket-victory-in-1st-odi-2795291.html",
            "description": "The Afghan victory was sealed with 24 overs to spare, underlining their dominance from start to finish.",
            "source_name": "Zee News"
        },
        {
            "title": "ISL | Bengaluru FC will fancy its chances against Hyderabad",
            "link": "https://www.thehindu.com/sport/football/isl-bengaluru-fc-will-fancy-its-chances-against-hyderabad/article68656131.ece",
            "description": "The home side will look to improve its head-to-head record against the visitor while the latter will aim to put behind a disappointing last season",
            "source_name": "The Hindu"
        },
        {
            "title": "Kerala Cricket League Final | Sachin Baby’s ton powers Kollam Sailors to the title",
            "link": "https://www.thehindu.com/sport/cricket/kerala-cricket-league-final-sachin-babys-ton-powers-kollam-sailors-to-the-title/article68657284.ece",
            "description": "The skipper’s unbeaten 105, and his 114-run partnership with Vatsal, helps the side overhaul a challenging target of 214 set by Globstars",
            "source_name": "The Hindu"
        }
    ],
    "top_news": [
        {
            "title": "IND vs BAN, 1st Test Day 1: Ashwin-Jadeja rescue India with record-breaking partnership after early collapse",
            "link": "https://www.indiatvnews.com/sports/cricket/ind-vs-ban-1st-test-day-1-ashwin-jadeja-rescue-india-with-record-breaking-partnership-after-early-collapse-2024-09-19-953005",
            "description": "India managed to make a sensational comeback on the opening day of the first Test match against Bangladesh in Chennai on Thursday. Ravichandran Ashwin and Ravindra Jadeja pulled off a record-breaking stand for the seventh wicket to take India from 144/6 to a challenging total of 339/6 at the end of Day 1 at Chepauk.",
            "source_name": "India Tv"
        },
        {
            "title": "Indian shares set to open higher after bumper U.S. Fed rate cut",
            "link": "https://www.thehindu.com/business/markets/shares-set-to-open-higher-after-bumper-us-fed-rate-cut/article68658552.ece",
            "description": "The Fed cutting rates could boost the markets to record highs, two analysts said",
            "source_name": "The Hindu"
        },
        {
            "title": "India Becomes 6th Largest Market In Global MSCI IMI Index, Surpasses China",
            "link": "https://zeenews.india.com/economy/india-becomes-6th-largest-market-in-global-msci-imi-index-surpasses-china-2795393.html",
            "description": "The global index tracks capital market performance across the world. The index includes large- and mid-cap stocks and is a more inclusive version of the widely tracked MSCI ACWI Index.",
            "source_name": "Zee News"
        }
    ]
}