{
    "business": [
        {
            "title": "RBI's Forex Reserves Set To Cross 700 Bn Dollars Sooner Than Expected In FY25",
            "link": "https://zeenews.india.com/economy/rbis-forex-reserves-set-to-cross-700-bn-dollars-sooner-than-expected-in-fy25-2793568.html",
            "description": "According to the weekly RBI data, foreign currency assets (FCAs) grew by $5.10 billion to $604.1 billion.",
            "source_name": "Zee News"
        },
        {
            "title": "JSPL, JRPL sign pact to invest in green hydrogen production in Odisha",
            "link": "https://www.business-standard.com/companies/news/jspl-jrpl-sign-pact-to-invest-in-green-hydrogen-production-in-odisha-124091600426_1.html",
            "description": "The steel producer said on Monday that this represents the largest investment in green hydrogen by any Indian steelmaker",
            "source_name": "Business Standard"
        },
        {
            "title": "Rupee rises 5 paise to 83.87 against US dollar during early trade",
            "link": "https://www.business-standard.com/finance/news/rupee-rises-5-paise-to-83-87-against-us-dollar-during-early-trade-124091600145_1.html",
            "description": "The rupee appreciated by 5 paise to 83.87 against the US dollar in early trade on Monday supported by weakening of the American currency in the overseas market and significant foreign fund inflows.Forex traders said market participants are eagerly awaiting cues from the US Fed policy on Wednesday, with a rate cut all but certain. However, the magnitude of the cut remains uncertain.Moreover, the rupee continues to hold steady within a well-defined range on active intervention by the Reserve Bank of India (RBI), they added.At the interbank foreign exchange market, the local unit opened at 83.89, then inched further to touch 83.87, registering a rise of 5 paise from its previous close.On Friday, the local unit settled higher by 4 paise at 83.92 against the US dollar.\"Despite a significant drop in the dollar index and crude oil prices remaining under control in recent sessions, alongside inflation figures staying below the Central Bank's 4 per cent target for the second consecuti",
            "source_name": "Business Standard"
        }
    ],
    "entertainment": [
        {
            "title": "'The Buckingham Murders' Triumphs At The Box Office, Collects Impressive ₹6.75 Cr. Over The Weekend!",
            "link": "https://zeenews.india.com/bollywood/the-buckingham-murders-triumphs-at-the-box-office-collects-impressive-6-75-cr-over-the-weekend-2793929.html",
            "description": "'The Buckingham Murders' has made a notable impact at the box office, earning ₹6.75 Cr. over its opening weekend and garnering widespread acclaim for its thrilling narrative and Kareena Kapoor Khan's captivating performance!",
            "source_name": "Zee News"
        },
        {
            "title": "Emmys 2024: ‘Baby Reindeer’ finishes its Emmy run with four wins for Richard Gadd, Jessica Gunning and Limited series",
            "link": "https://www.thehindu.com/entertainment/movies/emmys-2024-baby-reindeer-finishes-its-emmy-run-with-four-wins-for-richard-gadd-jessica-gunning-and-limited-series/article68647238.ece",
            "description": "The series’ first win of the night started with a win for Outstanding Writing for a Limited or Anthology Series or Movie",
            "source_name": "The Hindu"
        },
        {
            "title": "Tumbbad's Re-Release Achieves Rs. 7.34 Crore Box Office Milestone In Just 3 Days",
            "link": "https://zeenews.india.com/bollywood/tumbbads-re-release-achieves-rs-7-34-crore-box-office-milestone-in-just-3-days-2793931.html",
            "description": "The re-release of 'Tumbbad' has quickly matched its original week-long earnings of ₹7.34 crore in just three days.",
            "source_name": "Zee News"
        }
    ],
    "top": [
        {
            "title": "Significant investment needed to increase Kerala’s power generation capability",
            "link": "https://www.thehindu.com/news/national/kerala/significant-investment-needed-to-increase-keralas-power-generation-capability/article68648803.ece",
            "description": "Kerala State Electricity Board estimates ₹42,800 crore investment needed to add 7,750 MW capacity by 2030. In 2023-24, the State’s installed capacity – KSEB units and other sources combined – stood at 3,419 MW.",
            "source_name": "The Hindu"
        },
        {
            "title": "India very important market, looking at more frequencies: Malaysia Airlines",
            "link": "https://www.business-standard.com/companies/news/india-very-important-market-looking-at-more-frequencies-malaysia-airlines-124091500455_1.html",
            "description": "The airline, which currently flies to nine Indian cities, is eyeing new destinations as well as looking to increase frequencies to Trivandrum and Ahmedabad",
            "source_name": "Business Standard"
        },
        {
            "title": "BRAP 2024: Andhra Pradesh confident of remaining a ‘top achiever’",
            "link": "https://www.thehindu.com/news/national/andhra-pradesh/brap-2024-andhra-pradesh-confident-of-remaining-a-top-achiever/article68645340.ece",
            "description": "A.P. took a proactive stance in executing the BRAP-2024 by formulating detailed department-level action plans to ensure that all the 344 recommendations it made, spread over 21 areas, were implemented efficiently, says Industries Department official",
            "source_name": "The Hindu"
        }
    ],
    "technology": [
        {
            "title": "Apple mulls switching from aluminium to plastic case for next-gen Watch SE",
            "link": "https://www.business-standard.com/technology/tech-news/apple-mulls-switching-from-aluminium-to-plastic-case-for-next-gen-watch-se-124091600513_1.html",
            "description": "The move to a plastic casing could allow Apple to offer a more cost-effective Watch SE with advanced features and a potentially more attractive price point",
            "source_name": "Business Standard"
        }
    ],
    "sports": [
        {
            "title": "Bangladesh team arrives in Chennai; Najmul Shanto predicts good results after historic win against Pakistan",
            "link": "https://www.indiatvnews.com/sports/cricket/bangladesh-team-arrives-in-chennai-for-india-test-series-najmul-shanto-predicts-good-results-after-historic-win-against-pakistan-2024-09-15-952249",
            "description": "Bangladesh men's cricket team arrived in Chennai ahead of their opening Test match against India on Sunday, September 15. Najmul Shanto-led Bangladeshi team arrived at Chennai International Airport and then received a grand welcome at the ITC hotel.",
            "source_name": "India Tv"
        },
        {
            "title": "Kamboj’s eight-for gives India-C the lead despite Abhimanyu’s heroics",
            "link": "https://www.thehindu.com/sport/cricket/kambojs-eight-for-gives-india-c-the-lead-despite-abhimanyus-heroics/article68645469.ece",
            "description": "Kamboj went on to rattle the stumps for Navdeep Saini, and have Mukesh Kumar caught by Sai Sudharsan at short leg.",
            "source_name": "The Hindu"
        },
        {
            "title": "Asian Champions Trophy semifinal: In-form India clear favourites against Koreal",
            "link": "https://www.thehindu.com/sport/hockey/asian-champions-trophy-semifinal-in-form-india-clear-favourites-against-koreal/article68645431.ece",
            "description": "It has been a commanding performance from the Indians as they excelled in every department — be it forwardline, midfield or defence.",
            "source_name": "The Hindu"
        }
    ],
    "top_news": [
        {
            "title": "Emmys 2024: FX's Shogun steals the night with record-breaking 18 wins",
            "link": "https://www.business-standard.com/entertainment/emmys-2024-fx-s-shogun-steals-the-night-with-record-breaking-18-wins-124091600434_1.html",
            "description": "An adaptation of James Clavell's historical novel set in 17th-century Japan, Shogun earned a record-breaking 25 nominations at this year's Emmys",
            "source_name": "Business Standard"
        },
        {
            "title": "Mercedes expands BEV range; rolls out 2nd locally produced model in India",
            "link": "https://www.business-standard.com/companies/news/mercedes-expands-bev-range-rolls-out-2nd-locally-produced-model-in-india-124091600538_1.html",
            "description": "EQS SUV 580 4MATIC is the second model, after the EQS sedan, to be locally produced at company's Pune-based manufacturing plant",
            "source_name": "Business Standard"
        },
        {
            "title": "AI Training Now a Priority for At Least 50 per cent of Enterprises; Expanding Initiatives to Business and Support Teams Reveals Great Learning's Report",
            "link": "https://www.business-standard.com/content/press-releases-ani/ai-training-now-a-priority-for-at-least-50-per-cent-of-enterprises-expanding-initiatives-to-business-and-support-teams-reveals-great-learning-s-report-124091600774_1.html",
            "description": "Bangalore (Karnataka) [India], September 16: Great Learning (GL), a leading global edtech company for higher education and professional training, has released the \"Workforce Skills Evolution Report 2024-25\". Based on trends observed among Great Learning's client partners across various sectors and insights from a survey of over 100 learning and development (L & D) and business unit heads, this report offers a comprehensive look at key training trends and forecasts for FY25. It synthesises these insights to illustrate how organisations plan to harness talent development to drive growth, foster innovation, and build a sustainable competitive advantage.",
            "source_name": "Business Standard"
        }
    ]
}