{
    "business": [
        {
            "title": "Sensex Rebounds Nearly 100 Pts To Hit Lifetime High; Nifty Scales Record Intra-Day Level",
            "link": "https://zeenews.india.com/economy/sensex-rebounds-nearly-100-pts-to-hit-lifetime-high-nifty-scales-record-intra-day-level-2794033.html",
            "description": "The 30-share BSE Sensex climbed 97.84 points or 0.12 per cent to settle at a new record peak of 82,988.78. During the day, it jumped 293.4 points or 0.35 per cent to hit a fresh lifetime intra-day high of 83,184.34.",
            "source_name": "Zee News"
        },
        {
            "title": "Increase in airfare not linked to rise in airport charges, says ACI",
            "link": "https://www.business-standard.com/industry/news/increase-in-airfare-not-linked-to-rise-in-airport-charges-says-aci-124091700823_1.html",
            "description": "Airport charges are an important element of the commercial aviation ecosystem for infrastructure development and increase in airfares is not linked to a rise in the charges, according to the Airports Council International (ACI).Against the backdrop of the International Air Transportation Association (IATA) flagging concerns over a steep rise in airport charges, ACI also said that the charges will remain a critical source of revenue for airports.\"Airport charges are an important element of the commercial aviation ecosystem for infrastructure development. Failing to address the capital expenditure requirements to accommodate the projected growth could have serious socio-economic consequences,\" Stefano Baronci, Director General, ACI Asia Pacific & Middle East, said.In a statement to PTI, he noted that airports are highly infrastructure-intensive businesses, with their cost structures dominated by significant fixed costs for the operation and upkeep of essential infrastructure such",
            "source_name": "Business Standard"
        },
        {
            "title": "iBUS Network and Infrastructure receives Rs 280 crore investment from IFC",
            "link": "https://www.business-standard.com/companies/news/ibus-network-and-infrastructure-receives-rs-280-crore-investment-from-ifc-124091700538_1.html",
            "description": "This investment will bolster iBUS's plans for both domestic and international growth",
            "source_name": "Business Standard"
        }
    ],
    "entertainment": [
        {
            "title": "Tumbbad's Re-Release Achieves Rs. 7.34 Crore Box Office Milestone In Just 3 Days",
            "link": "https://zeenews.india.com/bollywood/tumbbads-re-release-achieves-rs-7-34-crore-box-office-milestone-in-just-3-days-2793931.html",
            "description": "The re-release of 'Tumbbad' has quickly matched its original week-long earnings of ₹7.34 crore in just three days.",
            "source_name": "Zee News"
        },
        {
            "title": "Emmys 2024: FX's Shogun steals the night with record-breaking 18 wins",
            "link": "https://www.business-standard.com/entertainment/emmys-2024-fx-s-shogun-steals-the-night-with-record-breaking-18-wins-124091600434_1.html",
            "description": "An adaptation of James Clavell's historical novel set in 17th-century Japan, Shogun earned a record-breaking 25 nominations at this year's Emmys",
            "source_name": "Business Standard"
        },
        {
            "title": "UMG, Taylor Swift's music label, sees higher profit, helped by superfans",
            "link": "https://www.business-standard.com/world-news/umg-taylor-swift-s-music-label-sees-higher-profit-helped-by-superfans-124091700587_1.html",
            "description": "UMG said it sees annual subscription revenue growth of between 8 per cent and 10 per cent",
            "source_name": "Business Standard"
        }
    ],
    "top": [
        {
            "title": "Significant investment needed to increase Kerala’s power generation capability",
            "link": "https://www.thehindu.com/news/national/kerala/significant-investment-needed-to-increase-keralas-power-generation-capability/article68648803.ece",
            "description": "Kerala State Electricity Board estimates ₹42,800 crore investment needed to add 7,750 MW capacity by 2030. In 2023-24, the State’s installed capacity – KSEB units and other sources combined – stood at 3,419 MW.",
            "source_name": "The Hindu"
        },
        {
            "title": "Revolutionising Travel: How Etripto.in Is Changing Game For Affordable And Comfortable Vacations",
            "link": "https://zeenews.india.com/india/revolutionising-travel-how-etripto-in-is-changing-game-for-affordable-and-comfortable-vacations-2793981.html",
            "description": "Following a surge in tourism interest post COVID-19, travel enthusiasts are more eager than ever to explore new destinations. Statista reports a significant 30% increase in search interest for travel-related queries in 2023 compared to the previous year, with a notable focus on budget-friendly options.",
            "source_name": "Zee News"
        },
        {
            "title": "Truck Rentals Surge as Festive Season Approaches, Srinagar Sector Looks up, Indo-Bangla Border Reopens: Shriram Mobility Bulletin",
            "link": "https://www.business-standard.com/content/press-releases-ani/truck-rentals-surge-as-festive-season-approaches-srinagar-sector-looks-up-indo-bangla-border-reopens-shriram-mobility-bulletin-124091600861_1.html",
            "description": "Mumbai (Maharashtra) [India], September 16: Truck rentals continued their upward trend in August 2024, marking the second consecutive month of growth, as per the latest Shriram Mobility Bulletin. The festive season's approach, coupled with increased post-election activities, has significantly driven demand across various transportation routes.",
            "source_name": "Business Standard"
        }
    ],
    "technology": [
        {
            "title": "Apple mulls switching from aluminium to plastic case for next-gen Watch SE",
            "link": "https://www.business-standard.com/technology/tech-news/apple-mulls-switching-from-aluminium-to-plastic-case-for-next-gen-watch-se-124091600513_1.html",
            "description": "The move to a plastic casing could allow Apple to offer a more cost-effective Watch SE with advanced features and a potentially more attractive price point",
            "source_name": "Business Standard"
        },
        {
            "title": "Lenovo to build AI servers in India as nation's tech push deepens",
            "link": "https://www.business-standard.com/companies/news/lenovo-to-build-ai-servers-in-india-as-nation-s-tech-push-deepens-124091700550_1.html",
            "description": "The company said Tuesday it has started making the large, powerful computers in Pondicherry",
            "source_name": "Business Standard"
        },
        {
            "title": "2 years of Project Cheetah: Hasn't been an easy road, says Bhupender Yadav",
            "link": "https://www.thehindu.com/sci-tech/energy-and-environment/2-years-of-project-cheetah-hasnt-been-an-easy-road-says-bhupender-yadav/article68651106.ece",
            "description": "Union Environment Minister Bhupender Yadav reflects on the challenges and successes of Project Cheetah’s first two years",
            "source_name": "The Hindu"
        }
    ],
    "sports": [
        {
            "title": "Pakistan register come from behind win to seal bronze against South Korea in Asian Champions Trophy",
            "link": "https://www.indiatvnews.com/sports/hockey/pakistan-register-come-from-behind-win-to-seal-bronze-against-south-korea-in-asian-champions-trophy-2024-09-17-952585",
            "description": "Pakistan registered a brilliant come-from-behind win against South Korea to seal the bronze medal at the Asian Champions Trophy 2024. Despite trailing against the Koreans 0-1, the Green Shirts came back roaring to win the match 5-2 and take the third prize home.",
            "source_name": "India Tv"
        },
        {
            "title": "Virat Kohli Leads Team To Victory In Fielding Competition Ahead Of IND vs BAN 1st Test, Video Goes Viral - Watch",
            "link": "https://zeenews.india.com/cricket/virat-kohli-leads-team-to-victory-in-fielding-competition-ahead-of-ind-vs-ban-1st-test-video-goes-viral-watch-2794301.html",
            "description": "The competition aimed not only to sharpen the players' catching skills but also to foster team cohesion.",
            "source_name": "Zee News"
        },
        {
            "title": "Chess Olympiad: Indian men crush Azerbaijan, women beat Kazakhstan",
            "link": "https://www.thehindu.com/sport/chess-olympiad-indian-men-crush-azerbaijan-women-beat-kazakhstan/article68647390.ece",
            "description": "After scoring the fifth victory on the trot, the Indian men maintained a clean slate on ten points and they were joined by Vietnam who continued with their impressive show and downed Poland 2.5-1.5",
            "source_name": "The Hindu"
        }
    ],
    "top_news": [
        {
            "title": "ICC announces equal prize money for men's and women's World Cups from 2024",
            "link": "https://www.business-standard.com/cricket/world-cup/icc-announces-equal-prize-money-for-men-s-and-women-s-world-cups-from-2024-124091700749_1.html",
            "description": "The winners will receive $2.34 million, a substantial 134 per cent increase from the $1 million awarded to Australia in 2023",
            "source_name": "Business Standard"
        },
        {
            "title": "Mercedes expands BEV range; rolls out 2nd locally produced model in India",
            "link": "https://www.business-standard.com/companies/news/mercedes-expands-bev-range-rolls-out-2nd-locally-produced-model-in-india-124091600538_1.html",
            "description": "EQS SUV 580 4MATIC is the second model, after the EQS sedan, to be locally produced at company's Pune-based manufacturing plant",
            "source_name": "Business Standard"
        }
    ]
}