[
    {
        "title": "Micro SUVs gain ground in India, with sales soaring 72% in early FY24",
        "link": "https://www.business-standard.com/industry/auto/micro-suvs-gain-ground-in-india-with-sales-soaring-72-in-early-fy24-124091400161_1.html",
        "description": "Hyundai Exter and Tata Punch, priced under Rs 10 lakh, saw a 72 per cent sales jump in the first four months of FY24, far outpacing the 1.8 per cent growth in overall domestic passenger vehicle sales",
        "pubDate": "2024-09-14 05:08:34",
        "source_name": "Business Standard",
        "category": "business",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.954470157623291,
            0.9522789120674133
        ]
    },
    {
        "title": "TN CM Stalin arrives back from US, says investment trip successful",
        "link": "https://www.business-standard.com/india-news/tn-cm-stalin-arrives-back-from-us-says-investment-trip-successful-124091400136_1.html",
        "description": "Tamil Nadu Chief Minister M K Stalin arrived at the airport here on Saturday to a rousing reception following his fortnight-long official trip to the US to attract investments to the state.The visit was successful and met his aspirations to ensure investment to Tamil Nadu to facilitate jobs for the people and skill training for the youth, he said briefing reporters.State Ministers, officials and DMK members received him at the airport upon his arrival.It was successful in terms of attracting investments from reputed global companies including those among the Fortune 500. The 14-day overseas trip was beneficial to the state as we signed 19 Memorandum of Understanding for a commitment of Rs 7,618 crore, the Chief Minister said.Eight companies from San Francisco and 11 from Chicago inked the pact and they would ensure employment opportunities to 11,516 people through their ventures in Madurai, Tiruchirappalli, Coimbatore, Krishnagiri, Chennai, Chengalpattu and Kancheepuram, he ..",
        "pubDate": "2024-09-14 05:06:36",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "neutral",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.733985185623169,
            0.9203663468360901
        ]
    },
    {
        "title": "Two years of Project Cheetah: India awaits Kenya's approval for new batch",
        "link": "https://www.business-standard.com/india-news/two-years-of-project-cheetah-india-awaits-kenya-s-approval-for-new-batch-124091400117_1.html",
        "description": "The MoU process to bring a new batch of cheetahs from Kenya is in progress, with India having finalised its part and awaiting approval from the African country, a senior official has said.Cheetahs for the breeding centre being built in Gujarat's Bunni grasslands will also be brought from Kenya, SP Yadav, the director general of the International Big Cat Alliance, told PTI editors during a recent interaction here.As part of the first-ever intercontinental translocation of the big cats, 20 cheetahs have been brought to the Kuno National Park in Madhya Pradesh so far -- eight from Namibia in September 2022 and 12 from South Africa in February 2023.Since they arrived in India, eight adult cheetahs -- three females and five males -- have died.Seventeen cubs have been born in India, with 12 surviving, bringing the total number of cheetahs, including cubs, in Kuno to 24. Currently, all are in enclosures. The grand initiative completes two years on September 17.The 'Action Plan for .",
        "pubDate": "2024-09-14 04:53:00",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "neutral"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.7868126630783081,
            0.6227152943611145
        ]
    },
    {
        "title": "FM Sitharaman Discusses Investment Opportunities With US International Development Finance Corporation Delegation",
        "link": "https://zeenews.india.com/economy/fm-sitharaman-discusses-investment-opportunities-with-us-international-development-finance-corporation-delegation-2793050.html",
        "description": "Finance Minister Sitharaman also emphasized the broad-based and multi-sectoral cooperation between India and the US, noting that recent reforms and the country's evolving investment climate have created a conducive environment for growth.",
        "pubDate": "2024-09-14 04:31:00",
        "source_name": "Zee News",
        "category": "business",
        "sentiment": [
            "neutral",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8675037026405334,
            0.9174909591674805
        ]
    },
    {
        "title": "Coimbatore YMCA’s 110-year-old main building gets a facelift",
        "link": "https://www.thehindu.com/news/cities/Coimbatore/coimbatore-ymcas-110-year-old-main-building-gets-a-facelift/article68633693.ece",
        "description": "The heritage building has been renovated in tune with the original’s architecture",
        "pubDate": "2024-09-14 04:29:34",
        "source_name": "The Hindu",
        "category": "coimbatore",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.845898449420929,
            0.7169697284698486
        ]
    },
    {
        "title": "‘Like A Big Brother’: Sarfaraz Khan Lauds Rohit Sharma Ahead Of IND Vs BAN Test",
        "link": "https://zeenews.india.com/cricket/like-a-big-brother-sarfaraz-khan-lauds-rohit-sharma-ahead-of-ind-vs-ban-test-2793044.html",
        "description": "The Mumbai-based batter Sarfaraz had a brilliant series where he collected 200 runs in three matches with the help of three fifties.",
        "pubDate": "2024-09-14 04:19:00",
        "source_name": "Zee News",
        "category": "sports",
        "sentiment": [
            "neutral",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.55122971534729,
            0.8397762179374695
        ]
    },
    {
        "title": "Tamil Nadu Chief Minister Stalin returns after U.S. tour",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/tamil-nadu-chief-minister-stalin-returns-after-us-tour/article68641328.ece",
        "description": "Stalin was in the U.S. for 17 days and during this period signed MoUs with various companies that have attracted investment to the tune of ₹7,600 crore.",
        "pubDate": "2024-09-14 04:10:02",
        "source_name": "The Hindu",
        "category": "tamil nadu",
        "sentiment": [
            "neutral",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.6457437872886658,
            0.8297494649887085
        ]
    },
    {
        "title": "Negotiations and diligent follow-ups helped bring back Ford to Tamil Nadu",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/negotiations-and-diligent-follow-ups-helped-bring-back-ford-to-tamil-nadu/article68639508.ece",
        "description": "Even though many other companies evinced interest in the Maraimalai Nagar facility, negotiations continued with Ford, culminating in the auto major’s decision to restart operations for exports",
        "pubDate": "2024-09-13 22:11:03",
        "source_name": "The Hindu",
        "category": "tamil nadu",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.928476095199585,
            0.9288780689239502
        ]
    },
    {
        "title": "Truth has triumphed over conspiracy, says Kejriwal after stepping out of jail",
        "link": "https://www.thehindu.com/news/cities/Delhi/truth-has-triumphed-over-conspiracy-says-kejriwal-after-stepping-out-of-jail/article68640205.ece",
        "description": "My strength has grown 100-fold, AAP chief tells supporters after stepping out of jail; vows to fight ‘anti-national forces’ working to weaken judiciary, EC; Bharadwaj cites SC judgment, seeks Amit Shah’s resignation; Kejriwal’s release will boost AAP’s poll campaigns in Haryana and Delhi, says party leader",
        "pubDate": "2024-09-13 20:00:57",
        "source_name": "The Hindu",
        "category": "delhi",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.855824887752533,
            0.8239716291427612
        ]
    },
    {
        "title": "Adani Group features in TIME's world's best companies 2024 list",
        "link": "https://www.indiatvnews.com/business/news/adani-group-features-time-world-best-companies-2024-list-statista-revenue-growth-ports-ambuja-cements-cbi-enforcement-directorate-supreme-court-2024-09-13-952039",
        "description": "The Adani Group has been included in TIME's prestigious \"World's Best Companies of 2024\" list, created in collaboration with Statista, a global leader in industry rankings and statistics. The recognition acknowledges the group's efforts in employee satisfaction, revenue growth, and sustainability across its businesses.",
        "pubDate": "2024-09-13 17:30:49",
        "source_name": "India Tv",
        "category": "business",
        "sentiment": [
            "neutral",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8299354910850525,
            0.8826473355293274
        ]
    },
    {
        "title": "Indian Bank raises Rs 5,000 crore via long-term infrastructure bonds",
        "link": "https://www.business-standard.com/finance/news/indian-bank-raises-rs-5-000-crore-via-long-term-infrastructure-bonds-124091301488_1.html",
        "description": "This strategic move is part of Indian Bank's efforts to mobilise resources for credit growth and refinancing of infrastructure projects",
        "pubDate": "2024-09-13 17:04:31",
        "source_name": "Business Standard",
        "category": "business",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.7742419242858887,
            0.7958092093467712
        ]
    },
    {
        "title": "MSC Claude Girardet reaches Kerala's Vizhinjam international seaport",
        "link": "https://www.business-standard.com/india-news/msc-claude-girardet-reaches-kerala-s-vizhinjam-international-seaport-124091301298_1.html",
        "description": "MSC Claude Girardet, the largest cargo ship ever to have docked in India, has arrived at the Vizhinjam International Seaport here on Friday.Kerala Chief Minister Pinarayi Vijayan on Friday said the berthing of the giant vessels showcases the readiness of the state to become a key player in global cargo shipping.The ship that sailed from Malaysia will return after container handling at Vizhinjam international seaport.\"MSC Claude Girardet, the largest cargo ship ever to be berthed in India, has anchored at @PortOfVizhinjam, marking a pivotal moment in Kerala's growth. With a capacity of 24,116 containers, this giant vessel showcases our readiness to become a key player in global cargo shipping,\" Vijayan posted on X.The ship is 399.99 metres long, 61.5 metres in width and 16.6 metres in depth.The CM noted that it was the largest ship to have arrived in South Asia.The arrival of one of the biggest cargo vessel shows that the mother port of Vizhinjam can easliy handle internatio",
        "pubDate": "2024-09-13 16:42:04",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.708174467086792,
            0.8027872443199158
        ]
    },
    {
        "title": "Chennai Corporation’s Gender and Policy Lab gets international attention",
        "link": "https://www.thehindu.com/news/cities/chennai/chennai-corporations-gender-and-policy-lab-gets-international-attention/article68637698.ece",
        "description": "The lab’s outcome-based studies and initiatives were much appreciated by the delegates, say officials",
        "pubDate": "2024-09-13 16:23:28",
        "source_name": "The Hindu",
        "category": "chennai",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.5799553990364075,
            0.9207035899162292
        ]
    },
    {
        "title": "India's coal output grows significantly, up 5.85% at 411.6 MT in FY25",
        "link": "https://www.business-standard.com/industry/news/india-s-coal-output-grows-significantly-up-5-85-at-411-6-mt-in-fy25-124091301368_1.html",
        "description": "The country's coal output grew 5.85 per cent to 411.62 million tonnes (MT) in the current fiscal year (up to September 12), over the year-ago period.This country's coal production was 388.86 MT during the same period last year.\"This marks a significant increase... reflecting a commendable growth rate of 5.85 per cent, despite adverse climatic conditions that challenged mining operations,\" the coal ministry said in a statement.The figures are provisional. The production by state-owned Coal India Ltd rose to 311 MT during the same period, marking a growth of 2.80 per cent compared to 302.53 MT in the corresponding period of the previous year.This growth is even more notable given the interruptions in mining activities in CIL subsidiaries due to heavy rains, it said.Coal dispatch has also experienced a substantial uplift, reaching 442.24 MT during 2024-25 (up to September 12), compared to 421.29 MT in the same period last year, it said, adding that this reflects a robust growth",
        "pubDate": "2024-09-13 16:13:23",
        "source_name": "Business Standard",
        "category": "business",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.9543038010597229,
            0.9514175653457642
        ]
    },
    {
        "title": "WHO approves first Mpox vaccine for limited use in select countries",
        "link": "https://www.indiatvnews.com/news/world/who-approves-first-mva-bn-vaccine-against-mpox-limited-use-africa-gavi-and-unicef-dr-tedros-adhanom-ghebreyesus-2024-09-13-952029",
        "description": "The World Health Organization (WHO) has approved the MVA-BN vaccine, developed by Bavarian Nordic A/S, as the first vaccine for mpox. The vaccine has been added to the WHO’s prequalification list, aimed at improving access, particularly for communities in Africa facing urgent need. The two-dose vaccine has shown 82% effectiveness in preventing mpox after full administration. WHO Director-General Dr. Tedros Adhanom Ghebreyesus emphasized the importance of equitable access to the vaccine to curb ongoing outbreaks.",
        "pubDate": "2024-09-13 15:37:56",
        "source_name": "India Tv",
        "category": "top",
        "sentiment": [
            "neutral",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8908846974372864,
            0.8927344679832458
        ]
    },
    {
        "title": "India vs Pakistan men's hockey head-to-head record ahead of Asian Champions Trophy 2024 showdown",
        "link": "https://www.indiatvnews.com/sports/hockey/india-vs-pakistan-mens-hockey-head-to-head-record-ahead-of-asian-champions-trophy-2024-showdown-2024-09-13-952024",
        "description": "India and Pakistan will revive their historic men's hockey field rivalry in the mega encounter in the Asian Champions Trophy 2024 on Saturday, September 14. Harmanpreet Kaur-led India will enter the fixture as clear favourites against Pakistan who are ranked 16th in the current men's hockey team rankings.",
        "pubDate": "2024-09-13 15:36:21",
        "source_name": "India Tv",
        "category": "sports",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.5768519639968872,
            0.737415075302124
        ]
    },
    {
        "title": "Food, water and online deliveries – support pours in for Kolkata’s protesting doctors",
        "link": "https://www.thehindu.com/news/national/west-bengal/food-water-and-online-deliveries-support-pours-in-for-kolkatas-protesting-doctors/article68638792.ece",
        "description": "Irrespective of their economic background, people have contributed to the movement in what has been one of the most organic outpourings of support.",
        "pubDate": "2024-09-13 15:35:19",
        "source_name": "The Hindu",
        "category": "west bengal",
        "sentiment": [
            "neutral",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.42135298252105713,
            0.7829384207725525
        ]
    },
    {
        "title": "Delhi Metro hits record ridership; extra trains added on Fridays, Saturdays",
        "link": "https://www.business-standard.com/india-news/delhi-metro-hits-record-ridership-extra-trains-added-on-fridays-saturdays-124091301309_1.html",
        "description": "Delhi Metro has recorded 13 of its highest passenger journeys in the past one month, with daily commuters ranging from over 72 lakh to 78 lakh, according to an official statement issued here on Friday.In response to the increased ridership, the Delhi Metro Rail Corporation (DMRC) has decided to run one extra train on all its lines on Fridays and Saturdays, officials said.\"The passenger journeys registered by the Delhi Metro in the past four days have turned out to be among the top five journeys performed in the metro network, with the highest ever passenger journeys record made on August 20 at 77,49,682,\" DMRC's Principal Executive Director (Corporate Communication) Anuj Dayal, said.\"In view of the increased passenger journeys, the DMRC has decided to run one extra train on all its Lines performing 84 extra train trips on Friday and Saturday. These additional trains/trips will be continued on coming weekdays also, if required,\" he said.This trend further strengthens the Delhi .",
        "pubDate": "2024-09-13 15:27:39",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.9366037249565125,
            0.8686739802360535
        ]
    },
    {
        "title": "Govt extends incentives to exports via courier medium to boost e-commerce",
        "link": "https://www.business-standard.com/industry/news/govt-extends-incentives-to-exports-via-courier-medium-to-boost-e-commerce-124091301322_1.html",
        "description": "The government has extended incentives for exports through the courier medium, a move aimed at promoting shipments through e-commerce.This was informed in the meeting of Board of Trade (BoT) in Mumbai.\"In the realm of e-commerce exports, the Board of Trade was informed by officials from the Central Board of Indirect Taxes and Customs (CBIC) that effective immediately, RoDTEP, RoSCTL, and drawback benefits will be extended to all exports made via courier,\" the commerce ministry said in a statement.It added that plans to extend these benefits to postal route exports are also in the pipeline, creating a more equitable environment for e-commerce exporters utilising the courier and postal mode.RoDTEP (Remission of Duties and Taxes on Exported Products) provides refunds of central, state, and local taxes and levies on exported products that are not covered by other schemes.The scheme covers a range of sectors, including marine, leather, gems and jewellery, agriculture, electrical,",
        "pubDate": "2024-09-13 15:25:43",
        "source_name": "Business Standard",
        "category": "business",
        "sentiment": [
            "positive",
            "neutral"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8888720273971558,
            0.7216684818267822
        ]
    },
    {
        "title": "Kerala eyeing tie-ups with power plants to tap coal linkage",
        "link": "https://www.thehindu.com/news/national/kerala/kerala-eyeing-tie-ups-with-power-plants-to-tap-coal-linkage/article68639021.ece",
        "description": "The Centre has earmarked long-term coal linkage for 500 megawatts (MW) under the Union Coal Ministry’s Scheme for Harnessing and Allocating Koyala (Coal) Transparently in India (SHAKTI), according to the State Power department.",
        "pubDate": "2024-09-13 15:04:01",
        "source_name": "The Hindu",
        "category": "kerala",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.6966841816902161,
            0.6116651892662048
        ]
    },
    {
        "title": "Akums Drugs gets patent for formulation to manage sickle cell disease",
        "link": "https://www.business-standard.com/companies/news/akums-drugs-gets-patent-for-formulation-to-manage-sickle-cell-disease-124091301035_1.html",
        "description": "The company has received a patent from India patent office for its room temperature stable oral suspension of Hydroxyurea, a formulation aimed at managing sickle cell disease",
        "pubDate": "2024-09-13 14:55:58",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8376253247261047,
            0.9113565683364868
        ]
    },
    {
        "title": "Renewed interest in Hyderabad State and Operation Polo driven by curiosity",
        "link": "https://www.thehindu.com/news/national/telangana/renewed-interest-in-hyderabad-state-and-operation-polo-driven-by-curiosity/article68635039.ece",
        "description": "The success of Telangana movement questioned long-accepted narratives and encouraged many to inquire into the events related to Operation Polo",
        "pubDate": "2024-09-13 14:55:42",
        "source_name": "The Hindu",
        "category": "telangana",
        "sentiment": [
            "positive",
            "neutral"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.905601441860199,
            0.543538510799408
        ]
    },
    {
        "title": "Zomato teams up with IRCTC to offer food delivery service on trains",
        "link": "https://www.business-standard.com/companies/news/zomato-teams-up-with-irctc-to-offer-food-delivery-service-on-trains-124091301304_1.html",
        "description": "This collaboration aims to transform train journeys, enabling passengers to enjoy a variety of dishes from the comfort of their train seats",
        "pubDate": "2024-09-13 14:42:51",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "neutral"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.7881959080696106,
            0.7494586706161499
        ]
    },
    {
        "title": "Govt To Drive Economic Growth Via Robust Partnerships With States: Piyush Goyal",
        "link": "https://zeenews.india.com/economy/govt-to-drive-economic-growth-via-robust-partnerships-with-states-piyush-goyal-2792961.html",
        "description": "The minister Goyal also inaugurated ECGC’s new online service portal, alongside a revamped in-house SMILE-ERP system.",
        "pubDate": "2024-09-13 14:31:00",
        "source_name": "Zee News",
        "category": "business",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": true,
        "sentiment_score": [
            0.7135732769966125,
            0.5252479910850525
        ]
    },
    {
        "title": "Efficient logistics, paperless system to boost int'l trade: Comm secy",
        "link": "https://www.business-standard.com/industry/news/efficient-logistics-paperless-system-to-boost-int-l-trade-comm-secy-124091301207_1.html",
        "description": "Efficient logistics and paperless system are critical to boost international trade, and strong connectivity is key to foster trade and economic development, Commerce Secretary Sunil Barthwal has said.However, while making such efforts to bolster connectivity projects, it is essential to build trust as well as transparency in the cooperative efforts, he said addressing meeting of Ministers of Shanghai Cooperation Organization (SCO) on Thursday.The secretary noted that it is of utmost importance that \"we uphold the principles of SCO Charter including respect for sovereignty and territorial integrity of the member states.\"\"Barthwal focused on the importance of efficient logistics for international trade, in which, paperless trading is a critical step towards streamlining cross-border transactions,\" the commerce ministry said in a statement.He congratulated Pakistan for its Presidency of the Heads of Government of the SCO and welcomed Belarus on becoming the new member of the ...",
        "pubDate": "2024-09-13 14:29:52",
        "source_name": "Business Standard",
        "category": "business",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.7896510362625122,
            0.7854726910591125
        ]
    },
    {
        "title": "Mandi tension: CM Sukhu makes appeal to maintain peace, welcome tourists",
        "link": "https://www.business-standard.com/india-news/mandi-tension-cm-sukhu-makes-appeal-to-maintain-peace-welcome-tourists-124091301159_1.html",
        "description": "Amid tension after demand for demolition of \"unauthorised\" mosque structure in Mandi and protests by Hindu outfits, Himachal Pradesh Chief Minister Sukhvinder Singh Sukhu on Friday appealed to the people to maintain peace and brotherhood and said tourists are welcome.\"We appeal to maintain peace and brotherhood and welcome tourists,\" said the chief minister while addressing media persons after an all-party meeting here with state Congress chief Pratibha Singh, BJP leader Randhir Sharma, CPI(M) leader Rakesh Singha, AAP leader Surjit Singh and others.\"I have appealed to everyone to maintain peace and make no provocative statements, and that is why an all-party meeting. No one is allowed to take the law into their hands.\"We respect everyone. The land of Himachal has respect for all religions,\" the chief minister said.Referring to the protest on Friday by Hindu organisations demanding demolition of the \"encroached\" structure of a mosque in Mandi town, he said Himachal Pradesh is a",
        "pubDate": "2024-09-13 14:14:47",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.5387265682220459,
            0.6231405735015869
        ]
    },
    {
        "title": "Forest Minister declares Eravikulam in Munnar as a disabled friendly destination, carbon-negative national park",
        "link": "https://www.thehindu.com/news/national/kerala/forest-minister-declares-eravikulam-in-munnar-as-a-disabled-friendly-destination-carbon-negative-national-park/article68638809.ece",
        "description": "State has spent ₹446 lakh to reduce wild animal attacks, integrating projects in Munnar forest division and Munnar wildlife division, says Forest Minister",
        "pubDate": "2024-09-13 14:10:36",
        "source_name": "The Hindu",
        "category": "kerala",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.744785487651825,
            0.7545080780982971
        ]
    },
    {
        "title": "Our focus is on being a future ready company, says Rites CMD Mithal",
        "link": "https://www.business-standard.com/companies/news/our-focus-is-on-being-a-future-ready-company-says-rites-cmd-mithal-124091301172_1.html",
        "description": "With our focus on being 'Future Ready', RITES has vigorously pursued its #ITReady, #SkillReady, and #AIReady initiatives, Mithal added",
        "pubDate": "2024-09-13 14:00:13",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.7758251428604126,
            0.8896391987800598
        ]
    },
    {
        "title": "Indian Immunologicals unveils IVF media for bovine embryo transfer developed in partnership with NDDB",
        "link": "https://www.thehindu.com/news/cities/Hyderabad/indian-immunologicals-unveils-ivf-media-for-bovine-embryo-transfer-developed-in-partnership-with-nddb/article68638427.ece",
        "description": "The public sector vaccine maker is set to make the IVF technology more affordable to farmers, enhance the farmer-centric model of animal husbandry and dairy development",
        "pubDate": "2024-09-13 13:53:14",
        "source_name": "The Hindu",
        "category": "hyderabad",
        "sentiment": [
            "neutral",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.6537599563598633,
            0.7865814566612244
        ]
    },
    {
        "title": "'Couldn't Break Me': Arvind Kejriwal To Supporters As He Walks Out Of Jail",
        "link": "https://zeenews.india.com/india/couldnt-break-me-arvind-kejriwal-to-supporters-as-he-walks-out-of-jail-2792945.html",
        "description": "After being released from Tihar Jail, Delhi Chief Minister Arvind Kejriwal expressed his renewed resolve saying that the prison term has made him 100-times stronger.",
        "pubDate": "2024-09-13 13:24:00",
        "source_name": "Zee News",
        "category": "top",
        "sentiment": [
            "neutral",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8323620557785034,
            0.9224374890327454
        ]
    },
    {
        "title": "Interarch Building Products Q1FY25: Net profit rises 5% to Rs 20.3 cr",
        "link": "https://www.business-standard.com/companies/results/interarch-building-products-q1fy25-net-profit-rises-5-to-rs-20-3-cr-124091301071_1.html",
        "description": "Net revenue rose 3 per cent to Rs 303.4 crore in April-June period of this fiscal from Rs 293.7 crore in the corresponding period of the previous year, the company said in a statement on Thursday",
        "pubDate": "2024-09-13 13:10:25",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.9493169784545898,
            0.9506248235702515
        ]
    },
    {
        "title": "‘India literacy’ in Australia can unlock bilateral potential",
        "link": "https://www.thehindu.com/news/international/interview-with-lisa-singh-ceo-of-the-australia-india-institute/article68638262.ece",
        "description": "Lisa Singh is in India to meet with a wide range of stakeholders invested in the development of the Indian Ocean and Indo Pacific region, and to deepen the footprint of the research- and policy-focused fellowship that the AI Institute offers.",
        "pubDate": "2024-09-13 13:07:02",
        "source_name": "The Hindu",
        "category": "world",
        "sentiment": [
            "positive",
            "neutral"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8690043091773987,
            0.6209632158279419
        ]
    },
    {
        "title": "Arvind Kejriwal walks out of jail after bail, receives rousing welcome by AAP workers",
        "link": "https://www.indiatvnews.com/delhi/kejriwal-comes-out-of-tihar-jail-bail-supreme-court-aap-leaders-welcome-rouse-avenue-court-excise-policy-case-cbi-ed-atishi-sanjay-singh-2024-09-13-951997",
        "description": "Delhi Chief Minister Arvind Kejriwal on Friday walked out of Tihar Jail after the Rouse Avenue court accepted the surety bonds and issued his release warrant. For his early release, the court had also accepted the request for sending the release warrant through a special messenger.",
        "pubDate": "2024-09-13 12:54:34",
        "source_name": "India Tv",
        "category": "top",
        "sentiment": [
            "positive",
            "neutral"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.793296217918396,
            0.7830254435539246
        ]
    },
    {
        "title": "A Ford Comeback: Two Years After India Exit, Ford Motor To Restart Chennai Plant, Hire 3,000 Employees",
        "link": "https://zeenews.india.com/auto/a-ford-comeback-two-years-after-india-exit-ford-motor-to-restart-chennai-plant-hire-3000-employees-2792921.html",
        "description": "Tamil Nadu Chief Minister MK Stalin had posted on social media that he had a productive discussion with the Ford Motor team, exploring the possibility of renewing the company's three-decade partnership with the state, aiming to once again manufacture in Tamil Nadu for global markets.",
        "pubDate": "2024-09-13 12:44:00",
        "source_name": "Zee News",
        "category": "business",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.7641629576683044,
            0.8897204995155334
        ]
    },
    {
        "title": "Direct flights connecting Hyderabad to Bangkok from October 27",
        "link": "https://www.thehindu.com/news/cities/Hyderabad/direct-flights-connecting-hyderabad-to-bangkok-from-october-27/article68634726.ece",
        "description": "A direct flight from Chennai to Phuket will commence on October 30, with three weekly flights",
        "pubDate": "2024-09-13 12:42:21",
        "source_name": "The Hindu",
        "category": "hyderabad",
        "sentiment": [
            "positive",
            "neutral"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8036730289459229,
            0.6310662031173706
        ]
    },
    {
        "title": "Italian watchmaker U-Boat debuts in India with Helios, targets 45% growth",
        "link": "https://www.business-standard.com/india-news/italian-watchmaker-u-boat-debuts-in-india-with-helios-targets-45-growth-124091301068_1.html",
        "description": "Company eyes 45% growth in festive season as premium segment presents big opportunity",
        "pubDate": "2024-09-13 12:23:42",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.6894288063049316,
            0.9490692615509033
        ]
    },
    {
        "title": "Helios partners with U-Boat, aims for 45% growth in India's watch market",
        "link": "https://www.business-standard.com/companies/news/helios-partners-with-u-boat-aims-for-45-growth-in-india-s-watch-market-124091301068_1.html",
        "description": "With a portfolio of 45 brands in the fashion and semi-luxury category, Helios recorded a growth of 35 per cent last year",
        "pubDate": "2024-09-13 12:22:01",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.9135289192199707,
            0.8801904916763306
        ]
    },
    {
        "title": "Govt designates CMFRI as Centre of Excellence for seaweed cultivation",
        "link": "https://www.business-standard.com/india-news/govt-designates-cmfri-as-centre-of-excellence-for-seaweed-cultivation-124091300976_1.html",
        "description": "The Department of Fisheries under the Union Ministry of Fisheries, Animal Husbandry and Dairying has designated the ICAR-Central Marine Fisheries Research Institute as a Centre of Excellence for seaweed cultivation.The regional centre of Central Marine Fisheries Research Institute (CMFRI) at Mandapam in Tamil Nadu will serve as a hub for research, development, training and capacity building in seaweed cultivation.\"The centre will promote sustainable seaweed farming practices and address key challenges in the area with an aim to enhance India's role in the global seaweed industry,\" CMFRI said in a release.Dr Grinson George, Director of CMFRI termed this development as a crucial step in unlocking the country's potential in seaweed cultivation.\"The centre will focus on several key areas, including works on improving seaweed cultivation techniques and addressing challenges,\" he said.The release said a seed bank will be established to maintain the genetic diversity of indigenous .",
        "pubDate": "2024-09-13 12:13:50",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.7624871730804443,
            0.8106109499931335
        ]
    },
    {
        "title": "India's forex reserves rise $5.25 billion to new peak of $689.24 billion",
        "link": "https://www.business-standard.com/economy/news/india-s-forex-reserves-rise-5-25-billion-to-new-peak-of-689-24-billion-124091301023_1.html",
        "description": "India's forex reserves jumped USD 5.248 billion to a new all-time high of USD 689.235 billion for the week ended September 6, the Reserve Bank of India said on Friday.The overall kitty had jumped by USD 2.299 billion to a record USD 683.987 billion for the previous reporting week.For the week ended September 6, foreign currency assets, a major component of the reserves, increased by USD 5.107 billion to USD 604.144 billion, the data showed.Expressed in dollar terms, the foreign currency assets include the effect of appreciation or depreciation of non-US units like the euro, pound and yen held in the foreign exchange reserves.Gold reserves increased by USD 129 million to USD 61.988 billion during the week, the RBI said.The Special Drawing Rights (SDRs) were up by USD 4 million to USD 18.472 billion, the apex bank said.India's reserve position with the IMF was up by USD 9 million to USD 4.631 billion in the reporting week, the apex bank data showed.",
        "pubDate": "2024-09-13 12:03:07",
        "source_name": "Business Standard",
        "category": "business",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.9342360496520996,
            0.8480740189552307
        ]
    },
    {
        "title": "BREAKING: India's forex reserves jump $5.248 billion to $689.235 billion, says RBI",
        "link": "https://www.indiatvnews.com/business/news/breaking-india-s-forex-reserves-jump-5-248-billion-to-689-235-billion-says-rbi-2024-09-13-951998",
        "description": "India's forex reserves jump USD 5.248 billion to an all-time high of USD 689.235 billion for the week ended September 6, says Reseve Bank of India.",
        "pubDate": "2024-09-13 12:00:27",
        "source_name": "India Tv",
        "category": "business",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.9200176000595093,
            0.9217849373817444
        ]
    },
    {
        "title": "TN CM Stalin concludes US tour, govt signs pacts worth over Rs 7,000 cr",
        "link": "https://www.business-standard.com/india-news/tn-cm-stalin-concludes-us-tour-govt-signs-pacts-worth-over-rs-7-000-cr-124091300917_1.html",
        "description": "The Tamil Nadu government on Friday said it has signed an MoU with US-headquartered Rapid Global Business Solutions, Inc, a supplier of business solutions across various industries, and the firm would set up a new unit in the state by investing Rs 100 crore.The MoU was signed in the presence of Chief Minister M K Stalin in Chicago on September 12 between officials of the state and the company, represented by its Chairman and CEO Nanua Singh and others, an official release here said, adding the new electronic and telematics firm would come up at Hosur. Industries Minister TRB Rajaa and top state officials were present.In total, the state government has inked pacts totally worth Rs 7,616 crore with 18 companies during the Chief Minister's official US tour to attract investments.Stalin, who embarked on his US tour on August 27, completed his trip and departed from Chicago to Chennai on September 12 following a warm send-off by the Tamil diaspora.In a post on X, he said: Goodbye, U",
        "pubDate": "2024-09-13 11:54:33",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.6569452285766602,
            0.7001466155052185
        ]
    },
    {
        "title": "G Square Unveils New Project on Pollachi-Coimbatore Highway: Unmatched Connectivity and Competitive Pricing",
        "link": "https://www.business-standard.com/content/press-releases-ani/g-square-unveils-new-project-on-pollachi-coimbatore-highway-unmatched-connectivity-and-competitive-pricing-124091301022_1.html",
        "description": "Coimbatore (Tamil Nadu) [India], September 13: G Square, South India's leading plot promoter, has announced the launch of G Square Emerald Enclave in Pollachi.",
        "pubDate": "2024-09-13 11:50:06",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.9296980500221252,
            0.5230233669281006
        ]
    },
    {
        "title": "Domestic air traffic rises 5.7% to 13.1 mn in August: Official data",
        "link": "https://www.business-standard.com/industry/news/domestic-air-traffic-rises-5-7-to-13-1-mn-in-august-official-data-124091301001_1.html",
        "description": "Indian airlines carried 1.31 crore passengers in August, an increase of 5.7 per cent compared to the year-ago period, according to official data released on Friday.In August 2023, carriers had flown 1.24 crore domestic passengers while in July this year, the count stood at 1.29 crore.The report released by the Directorate General of Civil Aviation (DGCA) showed that last month, flight delays impacted 1,79,744 passengers with airlines shelling out around Rs 2.44 crore towards facilitation.As many as 38,599 passengers were affected by flight cancellations and carriers spent about Rs 1.14 crore for compensation and facilities.\"The overall cancellation rate of scheduled domestic airlines for the month of August 2024 has been 0.83 per cent,\" the report said.A total of 728 passengers were denied boarding and the amount spent towards compensation and facilities in this regard was Rs 77.96 lakh.\"Passengers carried by domestic airlines during January-August 2024 were 1,054.66 lakh a",
        "pubDate": "2024-09-13 11:48:27",
        "source_name": "Business Standard",
        "category": "business",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.9377189874649048,
            0.6486364006996155
        ]
    },
    {
        "title": "Duleep Trophy 2024 2nd round Day 2: Openers help India A extend lead past 200 after pacers shine vs India D",
        "link": "https://www.indiatvnews.com/sports/cricket/duleep-trophy-2024-2nd-round-day-2-openers-help-india-a-extend-lead-past-200-after-khaleel-ahmed-aaqib-khan-impact-2024-09-13-951991",
        "description": "India A displayed an impressive all-round show to take control of the Duleep Trophy 2024 second-round fixture against India D in Anantapur on Friday, September 13. Fast bowlers Khaleel Ahmed and Aaqib Khan shone to bowl out India D to 183 and then openers Mayank Agarwal and Pratham Singh scored brilliant fifties each to put India A in the dominant position at the end of Day 2.",
        "pubDate": "2024-09-13 11:40:55",
        "source_name": "India Tv",
        "category": "sports",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8498852849006653,
            0.8753552436828613
        ]
    },
    {
        "title": "Food ministry inks pact with FCI to boost grain operation efficiency",
        "link": "https://www.business-standard.com/india-news/food-ministry-inks-pact-with-fci-to-boost-grain-operation-efficiency-124091300918_1.html",
        "description": "The food ministry has signed an agreement with the state-run Food Corporation of India (FCI) for the 2024-25 fiscal year, aiming to enhance efficiency and accountability in foodgrain procurement and distribution.The MoU (Memorandum of Understanding) sets specific performance benchmarks, including metrics for FCI depots, and outlines accountability measures to optimise public fund usage in food security operations.\"Depot efficiency parameters like capacity utilization, operational losses, security measures, and modernisation of processes are part of the performance benchmarking,\" the ministry said in a statement.This initiative underscores the government's commitment to refining the Public Distribution System (PDS) and ensuring efficient management of food subsidy funds through improved FCI operations.Established in 1965, FCI handles the purchase, storage, transport, distribution, and sale of foodgrains. It relies entirely on central government food subsidies, having no independ",
        "pubDate": "2024-09-13 11:37:22",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": true,
        "sentiment_score": [
            0.9320628046989441,
            0.8723639249801636
        ]
    },
    {
        "title": "Gastrointestinal problems could heighten Parkinson’s disease risk by 76 per cent, study finds",
        "link": "https://www.thehindu.com/sci-tech/health/gastrointestinal-problems-could-heighten-parkinsons-disease-risk-by-76-per-cent-study-finds/article68638193.ece",
        "description": "These findings, published in JAMA Network Open, add to a growing body of evidence that ageing-related or neurodegenerative disease, long thought to originate in the brain, could begin in the gut",
        "pubDate": "2024-09-13 11:32:29",
        "source_name": "The Hindu",
        "category": "science",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8830169439315796,
            0.512786328792572
        ]
    },
    {
        "title": "More medical insurers joining NHCX platform for efficient claim processing",
        "link": "https://www.business-standard.com/finance/personal-finance/more-medical-insurers-joining-nhcx-platform-for-efficient-claim-processing-124091300923_1.html",
        "description": "The National Health Claims Exchange (NHCX) platform, introduced by the National Health Authority, is gaining traction among Indian health insurers for adoption as the platform streamlines the healthcare claims processing, offering various benefits to insurers, healthcare providers and patients.This digital platform aims to enable patients to access quality healthcare quickly and reduce out-of-pocket expenses.NHCX connects insurance companies, healthcare service providers, and government insurance scheme administrators to streamline healthcare access and claims.Officials said that leading insurers like Aditya Birla Health Insurance, Magma HDI General Insurance, Reliance General Insurance, Future Generali India Insurance and HDFC Ergo are joining the NHCX platform in their operations.By leveraging this technology, insurers can significantly reduce claim processing time, improve operational efficiency, and enhance customer satisfaction, health insurance firms said.Claim settleme",
        "pubDate": "2024-09-13 11:30:12",
        "source_name": "Business Standard",
        "category": "business",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.7080055475234985,
            0.5963262915611267
        ]
    },
    {
        "title": "Coaching Centre deaths: Delhi HC grants interim bail to four basement co-owners",
        "link": "https://www.thehindu.com/news/cities/Delhi/coaching-centre-deaths-delhi-hc-grants-interim-bail-to-four-basement-co-owners/article68638229.ece",
        "description": "Delhi High Court grants interim bail to co-owners of coaching center where three civil services aspirants drowned, subject to conditions",
        "pubDate": "2024-09-13 11:29:19",
        "source_name": "The Hindu",
        "category": "delhi",
        "sentiment": [
            "positive",
            "neutral"
        ],
        "duplicate": true,
        "sentiment_score": [
            0.6952129006385803,
            0.5207402110099792
        ]
    },
    {
        "title": "WHO grants first mpox vaccine approval to enhance response in Africa",
        "link": "https://www.business-standard.com/world-news/who-grants-first-mpox-vaccine-approval-to-enhance-response-in-africa-124091300954_1.html",
        "description": "The pre-qualification of the vaccine by Bavarian Nordic A/S means that donors like GAVI the Vaccine Alliance and UNICEF can buy it but supplies are limited because there's only a single manufacturer",
        "pubDate": "2024-09-13 11:16:15",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "neutral"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8872705698013306,
            0.483020156621933
        ]
    },
    {
        "title": "WHO grants first mpox vaccine approval to ramp up response to disease in Africa and beyond",
        "link": "https://www.thehindu.com/sci-tech/health/who-grants-first-mpox-vaccine-approval-to-ramp-up-response-to-disease-in-africa-and-beyond/article68638171.ece",
        "description": "The pre-qualification of the vaccine by Bavarian Nordic A/S means that donors such as GAVI the Vaccine Alliance and UNICEF can buy it",
        "pubDate": "2024-09-13 11:11:40",
        "source_name": "The Hindu",
        "category": "technology",
        "sentiment": [
            "positive",
            "neutral"
        ],
        "duplicate": true,
        "sentiment_score": [
            0.8886545300483704,
            0.7896369695663452
        ]
    },
    {
        "title": "Bahrain Secures USD 16.65 Million in Investments from Indian Companies",
        "link": "https://www.business-standard.com/content/press-releases-ani/bahrain-secures-usd-16-65-million-in-investments-from-indian-companies-124091300887_1.html",
        "description": "Mumbai (Maharashtra) [India], September 13: With the support of Team Bahrain, the Bahrain Economic Development Board (Bahrain EDB) has secured investment commitments valued at USD 16.65 million from three leading India-based companies across the sectors of manufacturing, renewable energy, and ICT. The announcements were made during Bahrain EDB's ongoing week-long visit to Mumbai, Bengaluru, and Chennai, designed to strengthen bilateral economic ties and attract foreign direct investment to Bahrain.",
        "pubDate": "2024-09-13 10:55:14",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": true,
        "sentiment_score": [
            0.9113457798957825,
            0.9344515204429626
        ]
    },
    {
        "title": "Rupee rises 6 paise to close at 83.90 against U.S. dollar",
        "link": "https://www.thehindu.com/business/markets/rupee-rises-6-paise-to-close-at-8390-against-us-dollar/article68638080.ece",
        "description": "The rupee gains against U.S. dollar on weakening American currency, supported by foreign fund inflows and RBI intervention",
        "pubDate": "2024-09-13 10:47:36",
        "source_name": "The Hindu",
        "category": "business",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8668844699859619,
            0.9052813053131104
        ]
    },
    {
        "title": "Hippo Homes continues its robust expansion; opens new home improvement and home interior store in Greater Noida West",
        "link": "https://www.business-standard.com/content/press-releases-ani/hippo-homes-continues-its-robust-expansion-opens-new-home-improvement-and-home-interior-store-in-greater-noida-west-124091300920_1.html",
        "description": "New Delhi [India], September 13: Dalmia Bharat Enterprise promoted 'Hippo Homes', a premier omnichannel provider of home building, home renovation and interior solutions, has opened its fourth retail store in India, at Greater Noida West. The new store, which is the third store for Hippo Homes in Noida and Greater Noida region, was inaugurated by Arvind Mediratta, MD & CEO, Hippo Homes, in the presence of key partners and the senior leadership team of Hippo Homes in India.",
        "pubDate": "2024-09-13 10:45:10",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8870601654052734,
            0.730622410774231
        ]
    },
    {
        "title": "Spreading Happiness InDiya Foundation aims to transform 500 rural schools in India by 2025",
        "link": "https://www.business-standard.com/content/press-releases-ani/spreading-happiness-indiya-foundation-aims-to-transform-500-rural-schools-in-india-by-2025-124091300912_1.html",
        "description": "New Delhi [India], September 13: With an aim to empower young students, Spreading Happiness InDiya Foundation (SHIF), a collaboration between cricketing icon Sachin Tendulkar (through Sachin Tendulkar Foundation - STF) and Schneider Electric India, a leader in digital energy management and next-generation automation, have reached a major milestone in their mission to empower young minds in rural areas through digital education. Through the flagship SMITA program, the Foundation has positively impacted 60,000 students across 300+ schools in India. Inspired by the success and in celebration of World Literacy Day, SHIF has committed to revitalising 500 rural government schools by 2025. It aims to touch the lives of more than 100,000 young learners across aspirational blocks of India.",
        "pubDate": "2024-09-13 10:40:14",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.5028879642486572,
            0.8649730682373047
        ]
    },
    {
        "title": "Annapurna Finance, British International Investment, and FinReach Solutions Sign Landmark Credit Guarantee Agreement to Empower Micro and Small Enterprises (MSEs)",
        "link": "https://www.business-standard.com/content/press-releases-ani/annapurna-finance-british-international-investment-and-finreach-solutions-sign-landmark-credit-guarantee-agreement-to-empower-micro-and-small-enterprises-mses-124091300902_1.html",
        "description": "New Delhi [India], September 13: Annapurna Finance Pvt. Ltd., one of India's leading Non-Banking Financial Companies and Microfinance Institutions (NBFC-MFI), has entered into a landmark partnership with British International Investment (BII), the UK's development finance institution and impact investor, and FinReach Solutions, a guarantee facilitation partner dedicated to enhancing credit availability to viable MSEs. This strategic alliance aims to empower India's Micro and Small Enterprises (MSEs), which form the backbone of the country's economy.",
        "pubDate": "2024-09-13 10:35:14",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.9318361282348633,
            0.9344779849052429
        ]
    },
    {
        "title": "DRDO, Indian Navy achieve success with VLSRSAM in successful low-altitude interception test",
        "link": "https://www.indiatvnews.com/news/india/drdo-indian-navy-achieve-success-with-vlsrsam-in-successful-low-altitude-interception-test-2024-09-13-951977",
        "description": "In a significant advancement for India's defense capabilities, the Defence Research & Development Organisation (DRDO) and the Indian Navy celebrated a major achievement with the successful test launch of the Vertical Launch Short Range Surface to Air Missile (VLSRSAM). This marks the second consecutive successful launch of the VLSRSAM, conducted on September 13, 2024, from the Integrated Test Range (ITR) in Chandipur, Odisha.",
        "pubDate": "2024-09-13 10:13:44",
        "source_name": "India Tv",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.9381493926048279,
            0.9188412427902222
        ]
    },
    {
        "title": "Pixel 9 review: With AI at core, this Google phone punches above its weight",
        "link": "https://www.business-standard.com/technology/tech-reviews/pixel-9-review-with-ai-at-core-this-google-phone-punches-above-its-weight-124091300834_1.html",
        "description": "Google Pixel 9 is a compact smartphone, but its size and accessible pricing should not mislead you into thinking it is inferior to flagship models, particularly in terms of user experience",
        "pubDate": "2024-09-13 09:59:38",
        "source_name": "Business Standard",
        "category": "technology",
        "sentiment": [
            "positive",
            "neutral"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.9286864995956421,
            0.41037920117378235
        ]
    },
    {
        "title": "Five-star hotel groups keen on expanding footprint in Northeast",
        "link": "https://www.thehindu.com/news/national/assam/five-star-hotel-groups-keen-on-expanding-footprint-in-northeast/article68637738.ece",
        "description": "On May 11, Assam Tourism Minister Jayanta Malla Baruah said three luxury hotel projects are being developed in and around the Kaziranga National Park and Tiger Reserve",
        "pubDate": "2024-09-13 09:53:57",
        "source_name": "The Hindu",
        "category": "assam",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8897042870521545,
            0.7255032658576965
        ]
    },
    {
        "title": "Jigra Songs: 'Ikk Kudi Duo' Alia Bhatt And Diljit Dosanjh Are Back For Soulful Track",
        "link": "https://zeenews.india.com/bollywood/jigra-songs-ikk-kudi-duo-alia-bhatt-and-diljit-dosanjh-are-back-for-soulful-track-2792778.html",
        "description": "\"Alia Bhatt and Diljit Dosanjh reunite for a soulful track in 'Jigra,' bringing back their 'Ikk Kudi' magic'.",
        "pubDate": "2024-09-13 09:47:00",
        "source_name": "Zee News",
        "category": "entertainment",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.6183529496192932,
            0.7992942333221436
        ]
    },
    {
        "title": "India's renewable energy sector fuels hiring boom in race to net-zero goal",
        "link": "https://www.business-standard.com/industry/news/india-s-renewable-energy-sector-fuels-hiring-boom-in-race-to-net-zero-goal-124091300785_1.html",
        "description": "The renewable energy sector has experienced a remarkable surge in jobs, with a staggering 23.7 per cent increase in FY24, compared to 8.5 per cent in FY23",
        "pubDate": "2024-09-13 09:23:45",
        "source_name": "Business Standard",
        "category": "business",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8783432245254517,
            0.9491967558860779
        ]
    },
    {
        "title": "India's steel companies look forward to recycle mandate for automakers",
        "link": "https://www.business-standard.com/economy/news/boost-to-steel-ecosystem-steel-companies-look-forward-to-recycle-mandate-124091300790_1.html",
        "description": "Proposed mandate will help steel scrap availability and in reducing emissions, they say",
        "pubDate": "2024-09-13 09:22:29",
        "source_name": "Business Standard",
        "category": "business",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.703433632850647,
            0.8100483417510986
        ]
    },
    {
        "title": "NLCIL to invest Rs 50,000 cr to ramp up renewable capacity to 10.11 GW",
        "link": "https://www.business-standard.com/companies/news/nlcil-to-invest-rs-50-000-cr-to-ramp-up-renewable-capacity-to-10-11-gw-124091300694_1.html",
        "description": "India is committed to a low-carbon emission path while pursuing its development goals, as pledged at COP 26",
        "pubDate": "2024-09-13 09:13:49",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8591740131378174,
            0.7508181929588318
        ]
    },
    {
        "title": "Asian Champions Trophy hockey: Favourites India look to continue supremacy over Pakistan",
        "link": "https://www.thehindu.com/sport/hockey/asian-champions-trophy-hockey-favourites-india-look-to-continue-supremacy-over-pakistan/article68637806.ece",
        "description": "With four wins out of as many games, defending champions India are leading the points table, followed closely by Pakistan.",
        "pubDate": "2024-09-13 09:04:46",
        "source_name": "The Hindu",
        "category": "hockey",
        "sentiment": [
            "positive",
            "neutral"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8362764716148376,
            0.5485689043998718
        ]
    },
    {
        "title": "The Association of Indian Technology Sales ProfessionalsTM [AITSP] Welcomes Industry Stalwarts Amit Chatterjee and Somya Shahi to its Advisory Board",
        "link": "https://www.business-standard.com/content/press-releases-ani/the-association-of-indian-technology-sales-professionals-aitsp-welcomes-industry-stalwarts-amit-chatterjee-and-somya-shahi-to-its-advisory-board-124091300722_1.html",
        "description": "Bengaluru (Karnataka) [India], September 13: The Association of Indian Technology Sales ProfessionalsTM [AITSP] is proud to announce the addition of two esteemed industry leaders, Amit Chatterjee and Somya Shahi, to its advisory board. Their extensive experience and strategic insights will be invaluable as AITSP continues its mission to empower and elevate tech sales professionals in India.",
        "pubDate": "2024-09-13 08:35:12",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.5432143211364746,
            0.868953287601471
        ]
    },
    {
        "title": "88% of top 25 MF schemes close higher in August, Axis Bluechip Fund leads",
        "link": "https://www.business-standard.com/finance/personal-finance/88-of-top-25-mf-schemes-close-higher-in-aug-axis-bluechip-fund-leads-124091300716_1.html",
        "description": "On an MoM basis, the weights of Technology, Healthcare, Retail,Consumer, NBFCs, and Telecom increased",
        "pubDate": "2024-09-13 08:33:26",
        "source_name": "Business Standard",
        "category": "business",
        "sentiment": [
            "positive",
            "neutral"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.9268904328346252,
            0.9219352602958679
        ]
    },
    {
        "title": "Ford planning to re-enter India; to restart Tamil Nadu plant for exports",
        "link": "https://www.business-standard.com/companies/news/ford-planning-to-re-enter-india-to-restart-tamil-nadu-plant-for-exports-124091300701_1.html",
        "description": "Automaker's factory in Chennai will be repurposed after it stopped production in 2022",
        "pubDate": "2024-09-13 08:28:21",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "neutral"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.6531884670257568,
            0.6251590847969055
        ]
    },
    {
        "title": "Russia, China take swipe at Western ‘arrogance’ at Beijing forum, pledge to enhance military ties",
        "link": "https://www.indiatvnews.com/news/world/russia-china-take-swipe-at-western-arrogance-at-beijing-forum-pledge-to-enhance-military-ties-ukraine-war-global-south-updates-2024-09-13-951958",
        "description": "Beijing: Chinese and Russian defence officials took digs at Western “arrogance” at a military diplomacy forum in Beijing and pledged to enhance military relations with developing countries. China pitched a greater role in reaching out to the Global South while Russia criticised the US for bringing military conflicts to the Indo-Pacific region and playing a “dangerous game” in Ukraine.",
        "pubDate": "2024-09-13 08:07:44",
        "source_name": "India Tv",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.6962197422981262,
            0.4953180253505707
        ]
    },
    {
        "title": "UST Launches 'UST Retail GenAI platform' - Transforming Retail Operations with Generative AI-Driven Solutions",
        "link": "https://www.business-standard.com/content/press-releases-ani/ust-launches-ust-retail-genai-platform-transforming-retail-operations-with-generative-ai-driven-solutions-124091300653_1.html",
        "description": "London [UK]/ Bengaluru (Karnataka) [India], September 13: UST, a leading digital transformation solutions company, has unveiled its 'UST Retail GenAI platform' at the London Innovation Lab. Steve Rempel, SVP & International CIO at Walgreens Boots Alliance, inaugurated this pioneering platform to transform retail operations through the power of Generative AI. Steve shared valuable insights on critical success factors to enable GenAI adoption, including the need to appreciate the trust cycle while planning various investments. Prior to the inauguration, UST's CEO, Krishna Sudheendra, shared the focus with which UST is championing the adoption of Generative AI, including the in-house program to train 25,000 employees on GenAI.",
        "pubDate": "2024-09-13 07:35:07",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "neutral",
            "positive"
        ],
        "duplicate": true,
        "sentiment_score": [
            0.521589994430542,
            0.7809773087501526
        ]
    },
    {
        "title": "India's Fast-Emerging Sports League Arrives in Odisha: A New Chapter in the State's Sporting Revolution",
        "link": "https://www.business-standard.com/content/press-releases-ani/india-s-fast-emerging-sports-league-arrives-in-odisha-a-new-chapter-in-the-state-s-sporting-revolution-124091300646_1.html",
        "description": "Kolkata (West Bengal) [India], September 13: Odisha made its debut in the internationally recognised Legends League Cricket (LLC) T-20 with the introduction of its own team, Team Konark Suryas Odisha, owned by SANPRIYA Group. This addition marked a significant milestone for the state as it further established itself as a growing hub for sports in India. The league, which brought together cricket legends from across the world, featured Team Konark Suryas Odisha alongside teams such as India Capitals Delhi, Gujarat Giants Gujarat, Manipal Tigers Bengaluru, Urbanrisers Hyderabad and Southern Super Stars Chennai.",
        "pubDate": "2024-09-13 07:30:08",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "neutral",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.749679684638977,
            0.8472518920898438
        ]
    },
    {
        "title": "Asian Hockey Champions Trophy: India look to continue supremacy over PAK",
        "link": "https://www.business-standard.com/sports/other-sports-news/asian-hockey-champions-trophy-india-look-to-continue-supremacy-over-pak-124091300489_1.html",
        "description": "A semifinal berth already secured, unbeaten India will look to continue the winning run and supremacy over arch-rivals Pakistan in their last and most-awaited round-robin match of the Hero Asian Champions Trophy here on Saturday.With four wins out of as many games, defending champions India are leading the points table, followed closely by Pakistan.Starting the tournament as clear favourites, Paris Olympics bronze-medallists India haven't disappointed so far, beating hosts China 3-0, Japan 5-1, trouncing Malaysia 8-1 before registering a 3-1 victory against Korea in their last match.Pakistan, on the other hand, have been resilient in the campaign. Playing under the guidance of legendary forward Tahir Zaman, the Ammad Butt-led side has improved with every passing game.Pakistan drew 2-2 against Malaysia and Korea, before beating Japan and China 2-1 and 5-1 respectively to climb to the second spot.Going by recent results, India enjoy an upper-hand over Pakistan.In their last .",
        "pubDate": "2024-09-13 07:22:37",
        "source_name": "Business Standard",
        "category": "sports",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.79267418384552,
            0.8017966151237488
        ]
    },
    {
        "title": "Biden, Starmer to discuss Ukraine's push to ease weapons restrictions",
        "link": "https://www.thehindu.com/news/international/biden-starmer-usa-uk-discuss-ukraine-push-ease-weapons-restrictions-russia-war/article68637492.ece",
        "description": "Ukrainian officials renewed their pleas to use Western-provided long-range missiles against targets deeper inside Russia",
        "pubDate": "2024-09-13 07:13:28",
        "source_name": "The Hindu",
        "category": "world",
        "sentiment": [
            "neutral",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8150275945663452,
            0.8640990853309631
        ]
    },
    {
        "title": "Woxsen University Signs a Strategic MoU with FDDI",
        "link": "https://www.business-standard.com/content/press-releases-ani/woxsen-university-signs-a-strategic-mou-with-fddi-124091300608_1.html",
        "description": "Hyderabad (Telangana) [India], September 13: Woxsen University, has entered into a strategic Memorandum of Understanding (MoU) with the Centre of Excellence (CoE), Footwear Design & Development Institute (FDDI). This MoU with FDDI is a significant feat making Woxsen one of the only four Universities in India to participate in this collaboration, expanding its offerings in the realm of design and innovation.",
        "pubDate": "2024-09-13 07:05:17",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": true,
        "sentiment_score": [
            0.8969643712043762,
            0.9376958012580872
        ]
    },
    {
        "title": "Puravankara Expands Its Redevelopment Portfolio in Mumbai & Signs JDA for a Project in Bengaluru",
        "link": "https://www.business-standard.com/content/press-releases-ani/puravankara-expands-its-redevelopment-portfolio-in-mumbai-signs-jda-for-a-project-in-bengaluru-124091300596_1.html",
        "description": "Mumbai (Maharashtra) [India], September 13: Puravankara Limited (NSE: PURVA | BSE: 532891) has acquired the redevelopment rights of a prestigious society -- Miami Apartments at Breach Candy. Spread little over ~2,000 sq m of land, this marks the developer's entry into the uber-luxury South Mumbai market, where rates (as per market sources) are estimated in the range of Rs 1,25,000 and Rs 1,40,000 per sq. ft.",
        "pubDate": "2024-09-13 07:00:19",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "neutral"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8268417716026306,
            0.7677815556526184
        ]
    },
    {
        "title": "SMS Magic Launches New Messaging Era with Enhanced AI CoPilot Services and Salesforce Admin Assistance at Dreamforce 2024",
        "link": "https://www.business-standard.com/content/press-releases-ani/sms-magic-launches-new-messaging-era-with-enhanced-ai-copilot-services-and-salesforce-admin-assistance-at-dreamforce-2024-124091300594_1.html",
        "description": "Pune (Maharashtra) [India]/New York [US], September 13: SMS Magic, the leading conversational messaging platform, top Salesforce partner, and recipient of the 2021 and 2022 Salesforce APAC ISV Partner of the Year Award, today announces its participation in Dreamforce 2024, the annual Salesforce community event. SMS Magic has chosen the event to unveil its new Messaging AI CoPilot and expanded industry-specific services under its Conversive brand, along with free messaging campaign assessments. The company will also host an advanced AI messaging roundtable led by its CEO, Nitin Seth.",
        "pubDate": "2024-09-13 07:00:11",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "neutral",
            "positive"
        ],
        "duplicate": true,
        "sentiment_score": [
            0.7201303243637085,
            0.777406632900238
        ]
    },
    {
        "title": "When Sisodia, Atishi rejoiced the moment after SC granted bail to CM Arvind Kejriwal | WATCH VIDEO",
        "link": "https://www.indiatvnews.com/news/india/arvind-kejriwal-bail-when-manish-sisodia-atishi-rejoiced-the-moment-after-sc-granted-bail-to-delhi-cm-watch-video-2024-09-13-951936",
        "description": "Celebrations are in the air at the Aam Aadmi Party (AAP) office and Arvind Kejriwal's residence after the Supreme Court on Friday granted bail to Delhi Chief Minister in the corruption case lodged by the CBI in connection with the excise policy 'scam'. While the AAP hailed the Supreme Court decision and said, \"Satyamev Jayate,\" Kejriwal's wife Sunita congratulated the party and said, \"Congratulations to AAP family! Kudos for staying strong. Wishing also the soonest release of our other leaders,\" Sunita said in a post on X.",
        "pubDate": "2024-09-13 06:45:51",
        "source_name": "India Tv",
        "category": "top",
        "sentiment": [
            "neutral",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.5334316492080688,
            0.665867030620575
        ]
    },
    {
        "title": "India has consistently championed cause of Global South: UN Representative",
        "link": "https://www.business-standard.com/india-news/india-has-consistently-championed-cause-of-global-south-un-representative-124091300230_1.html",
        "description": "Harish stated that South-South Cooperation offers the potential to build stronger ties among countries of the Global South",
        "pubDate": "2024-09-13 05:55:18",
        "source_name": "Business Standard",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8125882744789124,
            0.9480320811271667
        ]
    },
    {
        "title": "Apple's hearing aid features for AirPods Pro 2 get FDA clearance in US",
        "link": "https://www.business-standard.com/technology/tech-news/apple-s-hearing-aid-features-for-airpods-pro-2-get-fda-clearance-in-us-124091300320_1.html",
        "description": "Apple's hearing aid feature enables compatible versions of the AirPods Pro to serve as an over-the-counter (OTC) hearing aid, says FDA",
        "pubDate": "2024-09-13 05:54:16",
        "source_name": "Business Standard",
        "category": "technology",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.8757324814796448,
            0.7822919487953186
        ]
    },
    {
        "title": "Hardik Pandya To Make Test Comeback In Border Gavaskar Trophy? India All-Ronder's Fiery Net Session Sparks Speculation",
        "link": "https://zeenews.india.com/cricket/hardik-pandya-to-make-test-comeback-in-border-gavaskar-trophy-india-all-ronders-fiery-net-session-sparks-speculation-2792569.html",
        "description": "The video, posted on Instagram, captures Pandya in full flow as he delivers the red ball with characteristic vigour.",
        "pubDate": "2024-09-13 05:43:00",
        "source_name": "Zee News",
        "category": "sports",
        "sentiment": [
            "positive",
            "neutral"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.7524436712265015,
            0.6586757898330688
        ]
    },
    {
        "title": "Rupee rises 5 paise to 83.91 against U.S. dollar in early trade",
        "link": "https://www.thehindu.com/business/markets/rupee-rises-5-paise-to-8391-against-us-dollar-in-early-trade/article68637339.ece",
        "description": "Forex traders said the rupee continues to trade within a tight range, as the Reserve Bank of India (RBI) is maintaining a firm grip on the domestic currency",
        "pubDate": "2024-09-13 05:38:45",
        "source_name": "The Hindu",
        "category": "business",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.9015365242958069,
            0.8299674391746521
        ]
    },
    {
        "title": "'Welcome back Arvind Kejriwal, we missed you': AAP as Supreme Court grants bail to Delhi CM",
        "link": "https://www.indiatvnews.com/news/india/welcome-back-arvind-kejriwal-we-missed-you-aap-lauds-supreme-court-verdict-on-delhi-cm-bail-plea-raghav-chadha-atishi-sanjay-singh-latest-updates-2024-09-13-951917",
        "description": "The Aam Aadmi Party (AAP) on Friday (September 13) lauded the Supreme Court's verdict on Chief Minister Arvind Kejriwal's plea seeking bail in the excise policy case, and said that \"truth can be troubled but not defeated\".",
        "pubDate": "2024-09-13 05:31:16",
        "source_name": "India Tv",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.717065155506134,
            0.5714992880821228
        ]
    },
    {
        "title": "Big Relief For Arvind Kejriwal: SC Grants Bail In Delhi Excise Policy Case",
        "link": "https://zeenews.india.com/india/supreme-court-grants-bail-to-arvind-kejriwal-in-delhi-excise-policy-case-2792540.html",
        "description": "A Bench comprising Justices Surya Kant and Ujjal Bhuyan granted bail to the Aam Aadmi Party (AAP) chief.",
        "pubDate": "2024-09-13 05:21:57",
        "source_name": "Zee News",
        "category": "top",
        "sentiment": [
            "positive",
            "positive"
        ],
        "duplicate": false,
        "sentiment_score": [
            0.9239213466644287,
            0.8216087222099304
        ]
    }
]