[
    {
        "top_articles": [
            {
                "title": "Castrol expands its auto care product range",
                "link": "https://www.business-standard.com/markets/capital-market-news/castrol-expands-its-auto-care-product-range-124091200498_1.html",
                "description": "Introduces Castrol Microfibre Cloth and Castrol Shiner Sponge"
            },
            {
                "title": "Michael B Jordan takes reins as director, to star in new ‘Thomas Crown Affair’ remake",
                "link": "https://www.thehindu.com/entertainment/movies/michael-b-jordan-takes-reins-as-director-to-star-in-new-thomas-crown-affair-remake/article68633176.ece",
                "description": "Michael B Jordan, in collaboration with Amazon MGM Studios, is set to direct and star in the new ‘Thomas Crown Affair’ adaptation"
            },
            {
                "title": "Bisleri International Partners with Panjab University to establish On-Campus Material Recovery Facility (MRF) under 'Bottles for Change' initiative",
                "link": "https://www.business-standard.com/content/press-releases-ani/bisleri-international-partners-with-panjab-university-to-establish-on-campus-material-recovery-facility-mrf-under-bottles-for-change-initiative-124091200470_1.html",
                "description": "Chandigarh [India], September 12: Bisleri International Pvt. Ltd., through its flagship CSR initiative 'Bottles for Change,' proudly announces the official launch of its campus activities in partnership with Panjab University, Chandigarh. This landmark event, which marks the culmination of a collaborative effort that began in September 2023, includes the signing of an MoU today to develop a Material Recovery Facility (MRF) on campus - a significant step towards sustainability. The event attracted over 300 enthusiastic students who came together to support sustainable practices and recycling efforts on campus."
            }
        ]
    },
    {
        "business": [
            {
                "title": "Castrol expands its auto care product range",
                "link": "https://www.business-standard.com/markets/capital-market-news/castrol-expands-its-auto-care-product-range-124091200498_1.html",
                "description": "Introduces Castrol Microfibre Cloth and Castrol Shiner Sponge"
            },
            {
                "title": "Enforcement Directorate Mumbai attaches assets worth ₹43.52 crore in bank fraud case linking Ushdev International",
                "link": "https://www.thehindu.com/news/cities/mumbai/enforcement-directorate-mumbai-attaches-assets-worth-4352-crore-in-bank-fraud-case-linking-ushdev-international/article68633274.ece",
                "description": "“The investigation revealed that the funds which were granted as loan by multiple banks to M/s UIL were diverted to different entities in the guise of advances and unsecured loans,” ED official said"
            },
            {
                "title": "Jain Irrigation Systems enters into MoU with SKUAST-Kashmir",
                "link": "https://www.business-standard.com/markets/capital-market-news/jain-irrigation-systems-enters-into-mou-with-skuast-kashmir-124091200497_1.html",
                "description": "To offer state-of-the-art irrigation techniques and sustainable farming practices to region's farmers"
            }
        ]
    },
    {
        "politics": [
            {
                "title": "India aims to unite, move forward together with other nations: Rajnath Singh in Jodhpur",
                "link": "https://www.thehindu.com/news/national/india-aims-to-unite-move-forward-together-with-other-nations-rajnath-singh-in-jodhpur/article68633279.ece",
                "description": "Defence Minister Rajnath Singh emphasises India’s unity and progress amidst global conflicts, highlighting self-reliance and IAF advancements"
            },
            {
                "title": "Terror funding accused Kashmir MP Rashid Engineer gets bail: Who is he?",
                "link": "https://www.business-standard.com/elections/jammu-kashmir-elections/terror-funding-accused-kashmir-mp-rashid-engineer-gets-bail-who-is-he-124091200423_1.html",
                "description": "Lok Sabha MP Rashid Engineer reached Srinagar on Thursday after getting an interim bail. In his first comments, he vowed to fight for justice while targeting the BJP over the abrogation of Article 370"
            },
            {
                "title": "Semicon 2.0 policy to be in place in 3-4 months: Ashwini Vaishnaw",
                "link": "https://www.thehindu.com/news/national/semicon-20-policy-to-be-in-place-in-3-4-months-ashwini-vaishnaw/article68633157.ece",
                "description": "Union Minister Ashwini Vaishnaw said five projects entailing investments worth ₹1.5 lakh crore have been approved of which construction is underway for two of the plants."
            }
        ]
    },
    {
        "entertainment": [
            {
                "title": "Michael B Jordan takes reins as director, to star in new ‘Thomas Crown Affair’ remake",
                "link": "https://www.thehindu.com/entertainment/movies/michael-b-jordan-takes-reins-as-director-to-star-in-new-thomas-crown-affair-remake/article68633176.ece",
                "description": "Michael B Jordan, in collaboration with Amazon MGM Studios, is set to direct and star in the new ‘Thomas Crown Affair’ adaptation"
            },
            {
                "title": "Young hunters turn protectors | Ashwika Kapur’s ‘Catapults to Cameras’ is a film and an experiment",
                "link": "https://www.thehindu.com/entertainment/movies/ashwika-kapur-catapults-to-cameras-ritual-hunting-festival-south-bengal/article68626002.ece",
                "description": "Catapults to Cameras is not just a wildlife documentary. It’s also an experiment to encourage youngsters in rural Bengal to move away from ritual hunting"
            },
            {
                "title": "Malaika Arora's Father's Last Rites: Kareena, Saif Ali Khan, Arjun Kapoor And Other Celebs Attend The Funeral",
                "link": "https://zeenews.india.com/people/malaika-aroras-fathers-last-rites-kareena-saif-ali-khan-arjun-kapoor-and-other-celebs-attend-the-funeral-2792107.html",
                "description": "Kareena Kapoor Khan, Karisma, Saif and others reached out to pay their last respects to Malaika Arora’s father Anil Mehta."
            }
        ]
    },
    {
        "sports": [
            {
                "title": "Exclusive | Pakistan Voting Against Jay Shah Will Have Implications: Danish Kaneria",
                "link": "https://zeenews.india.com/cricket/exclusive-pakistan-voting-against-jay-shah-will-have-implications-danish-kaneria-2792108.html",
                "description": "Danish Kaneria lauded BCCI Secretary and the newly made ICC Chairman, Jay Shah for his impeccable work with the Indian cricket."
            },
            {
                "title": "IND vs BAN: Uncapped batter Jaker Ali replaces injured Shoriful Islam",
                "link": "https://www.business-standard.com/cricket/news/ind-vs-ban-uncapped-batter-jaker-ali-replaces-injured-shoriful-islam-124091200460_1.html",
                "description": "Shoriful Islam suffered a groin injury during the first test against Pakistan last month and didn't get to play the second Test later on."
            },
            {
                "title": "India vs Bangladesh test series: Pacer Shoriful Islam misses India tour due to injury",
                "link": "https://www.thehindu.com/sport/cricket/india-vs-bangladesh-test-series-pacer-shoriful-islam-misses-india-tour-due-to-injury/article68633282.ece",
                "description": "Uncapped Jaker Ali Anik has been drafted in as the second wicketkeeper"
            }
        ]
    },
    {
        "world": [
            {
                "title": "Former Bangladesh PM Khaleda Zia admitted to hospital",
                "link": "https://www.thehindu.com/news/international/former-bangladesh-pm-khaleda-zia-admitted-to-hospital/article68633233.ece",
                "description": "The 79-year-old Bangladesh Nationalist Party chairperson arrived at the Evercare Hospital from her Gulshan residence around 1.40 a.m., said BNP media cell member Sayrul Kabir Khan"
            },
            {
                "title": "Ukraine businesses hire more women, teens as labour shortages bite",
                "link": "https://www.business-standard.com/world-news/ukraine-businesses-hire-more-women-teens-as-labour-shortages-bite-124091200437_1.html",
                "description": "Male-dominated industries are more affected by staff shortages, the central bank said"
            },
            {
                "title": "Tamil party's support to Lanka's oppn presidential candidate in dispute",
                "link": "https://www.business-standard.com/world-news/tamil-party-s-support-to-lanka-s-oppn-presidential-candidate-in-dispute-124091200379_1.html",
                "description": "A dispute has been brewing among the leaders of Sri Lanka's main Tamil party over its support to the main opposition challenger Sajith Premadasa in the September 21 presidential election.The Tamil National Alliance (TNA) on September 1 decided to back Premadasa in the election. The decision was taken at the central committee meeting of Ilankai Tamil Arasu Kachchi (ITAK), the main constituent of the TNA.However, the party's president, S Sritharan, who was in the UK at the time, said there was no such decision and they would be backing the Tamil common candidate P Ariyanethiran.Mavai Senathirajah, another party leader, told reporters on Wednesday that a party meeting held in Vauniya, with the participation of 10 executive committee members, decided to hold back the final decision on the matter until September 15.Senior TNA leader M A Sumanthiran, however, said: ITAK decision to back Premadasa was final and is not under review.The TNA had traditionally backed the main opposition"
            }
        ]
    }
]